{
  "main": {
    "table_description": "The \"main\" table contains comprehensive clinical and demographic data related to cancer patients, specifically focusing on renal cell carcinoma. It includes information on patient identifiers, tumor characteristics, treatment details, comorbidities, and follow-up outcomes, facilitating research and analysis in oncology and personalized medicine.",
    "fields": {
      "cid": {
        "field_data_type": "object",
        "field_description": "The column \"cid\" in the \"main\" table appears to represent a unique identifier for a specific item or record. The values follow a consistent format, which includes a prefix (C3L), a numeric code (00004, 00010, etc.), and a suffix (01, 06), suggesting that these identifiers may categorize items based on certain criteria, such as type or version. With 179 unique values and a uniqueness percentage of 100.0, each entry in this column is distinct, indicating that it is likely used to uniquely identify different items or records within the database.",
        "field_sample_values": [
          "C3L-00004-01",
          "C3L-00004-06",
          "C3L-00010-01",
          "C3L-00010-06",
          "C3L-00011-01"
        ],
        "field_unique_values": "179 unique values",
        "field_uniqueness_percent": 100.0
      },
      "sample_submitter_id": {
        "field_data_type": "object",
        "field_description": "The column \"sample_submitter_id\" in the \"main\" table is likely used to uniquely identify samples submitted by various contributors or organizations. Each identifier follows a specific format, which appears to consist of a prefix (e.g., \"C3L\") followed by a numeric code and a suffix that may indicate a specific version or batch of the sample. With 179 unique values and a uniqueness percentage of 100.0, it indicates that each sample submitter ID is distinct, ensuring that no two samples share the same identifier. This field is essential for tracking and managing individual samples within the database.",
        "field_sample_values": [
          "C3L-00004-01",
          "C3L-00004-06",
          "C3L-00010-01",
          "C3L-00010-06",
          "C3L-00011-01"
        ],
        "field_unique_values": "179 unique values",
        "field_uniqueness_percent": 100.0
      },
      "kw_curated_tissue": {
        "field_data_type": "object",
        "field_description": "The column \"kw_curated_tissue\" in the \"main\" table is designed to store information about specific types of tissues that have been curated for analysis or study. The data type is an object, indicating that it can hold various types of data, but in this case, the sample and unique values suggest that it primarily contains categorical data. The only sample and unique value present is \"kidney,\" which implies that this column may be used to identify or categorize records related to kidney tissue. With a uniqueness percent of 0.56, it indicates that this value is not highly diverse within the dataset, suggesting that most entries may pertain to kidney tissue specifically.",
        "field_sample_values": [
          "kidney"
        ],
        "field_unique_values": [
          "kidney"
        ],
        "field_uniqueness_percent": 0.56
      },
      "kw_curated_disease": {
        "field_data_type": "object",
        "field_description": "The column \"kw_curated_disease\" in the \"main\" table is designed to represent the classification of diseases associated with the data entries. It contains categorical data, specifically indicating the type of disease or health condition. Sample values include \"Carcinoma, Renal Cell,\" which refers to a specific type of kidney cancer, and \"Normal,\" indicating the absence of disease. With only two unique values and a uniqueness percentage of 1.12, this column likely serves as a binary indicator of disease presence or absence in the dataset.",
        "field_sample_values": [
          "Carcinoma, Renal Cell",
          "Normal"
        ],
        "field_unique_values": [
          "Carcinoma, Renal Cell",
          "Normal"
        ],
        "field_uniqueness_percent": 1.12
      },
      "kw_curated_cell_type": {
        "field_data_type": "object",
        "field_description": "The column \"kw_curated_cell_type\" in the \"main\" table is designed to categorize or specify the type of cell being referenced in the dataset. Currently, it contains a single unique value, \"none,\" which suggests that this field may not have been populated with specific cell type information for the entries in the database. The low uniqueness percentage of 0.56 indicates that the majority of records share this same value, implying that the data may be incomplete or that the cell type has not been curated for the majority of entries. This field likely serves as a placeholder for future data entry or refinement regarding cell types.",
        "field_sample_values": [
          "none"
        ],
        "field_unique_values": [
          "none"
        ],
        "field_uniqueness_percent": 0.56
      },
      "kw_curated_cell_line": {
        "field_data_type": "object",
        "field_description": "The column \"kw_curated_cell_line\" in the \"main\" table is designed to store information about curated cell lines associated with the data entries. The data type is an object, indicating that it can hold various types of data, but in this case, the sample and unique values are both 'none'. This suggests that the column may not contain any meaningful data for the current dataset, with a uniqueness percentage of only 0.56%. This low uniqueness indicates that the majority of entries in this column are likely not utilized or relevant, possibly serving as a placeholder or default value.",
        "field_sample_values": [
          "none"
        ],
        "field_unique_values": [
          "none"
        ],
        "field_uniqueness_percent": 0.56
      },
      "kw_curated_drug": {
        "field_data_type": "object",
        "field_description": "The column \"kw_curated_drug\" in the \"main\" table is designed to store information related to curated drug data. Given that the data type is an object and the sample and unique values are both 'none', it suggests that this field may be used to indicate the absence of any curated drug information for the corresponding records. The uniqueness percent of 0.56 indicates that a significant majority of the entries in this column contain the same value, reinforcing the idea that this field may often be left unpopulated or is primarily used to denote a lack of data.",
        "field_sample_values": [
          "none"
        ],
        "field_unique_values": [
          "none"
        ],
        "field_uniqueness_percent": 0.56
      },
      "kw_curated_genetic_mod_type": {
        "field_data_type": "object",
        "field_description": "The column \"kw_curated_genetic_mod_type\" in the \"main\" table is designed to capture the type of genetic modification associated with a particular entry. The data type is classified as an object, indicating that it may contain various types of data, though in this case, the sample and unique values are both limited to the single entry 'none'. This suggests that the majority of records in this column do not specify any genetic modification type, resulting in a uniqueness percentage of only 0.56%. Therefore, it is likely that this field is intended for future use or expansion to include different types of genetic modifications, but currently, it predominantly reflects a lack of specified modifications.",
        "field_sample_values": [
          "none"
        ],
        "field_unique_values": [
          "none"
        ],
        "field_uniqueness_percent": 0.56
      },
      "kw_curated_modified_gene": {
        "field_data_type": "object",
        "field_description": "The column \"kw_curated_modified_gene\" in the \"main\" table is designed to store information related to genes that have been curated or modified in some way. The data type is an object, indicating that the values may include various types of data, but in this case, the sample and unique values are both 'none'. This suggests that the column currently does not contain any meaningful data or that the modifications to genes have not been recorded. The uniqueness percent of 0.56 indicates that the majority of entries in this column are identical, reinforcing the idea that it may not be actively used or populated with diverse information at this time.",
        "field_sample_values": [
          "none"
        ],
        "field_unique_values": [
          "none"
        ],
        "field_uniqueness_percent": 0.56
      },
      "curated_sample_stage": {
        "field_data_type": "object",
        "field_description": "The `curated_sample_stage` column in the `main` table is an object data type that likely represents the different stages of a curated sample. The sample values include 'I', 'II', 'III', and 'IV', which suggest a progression or classification system, possibly indicating phases of development, testing, or evaluation. With a total of four unique values and a uniqueness percentage of 2.23, this column is likely used to categorize samples into distinct stages for analysis or reporting purposes.",
        "field_sample_values": [
          "III",
          "I",
          "IV",
          "II"
        ],
        "field_unique_values": [
          "III",
          "I",
          "IV",
          "II"
        ],
        "field_uniqueness_percent": 2.23
      },
      "curated_sample_tnm_stage": {
        "field_data_type": "object",
        "field_description": "The column \"curated_sample_tnm_stage\" in the \"main\" table appears to represent the TNM staging classification for cancer, which is a system used to describe the extent of cancer in a patient's body. The TNM system categorizes cancer based on three key components: \n\n- **T (Tumor)**: Indicates the size and extent of the primary tumor.\n- **N (Nodes)**: Refers to the absence or presence of regional lymph node involvement.\n- **M (Metastasis)**: Indicates whether there are distant metastases (spread of cancer to other parts of the body).\n\nThe sample values, such as 'T3NX' and 'T1bN0', suggest a combination of these classifications, where 'T' denotes the tumor size and extent, 'N' indicates lymph node involvement, and 'M' (if present) indicates metastasis. The unique values show a variety of combinations, indicating a range of cancer stages and conditions. The uniqueness percentage of 15.08 suggests that there is a moderate level of variability in the data, with many entries sharing similar classifications. Overall, this field is likely used for clinical or research purposes to track and analyze cancer staging in patients.",
        "field_sample_values": [
          "T3NX",
          "T1bN0",
          "T3aNXM1",
          "T1aNX",
          "T3aN1"
        ],
        "field_unique_values": [
          "T3NX",
          "T1bN0",
          "T3aNXM1",
          "T1aNX",
          "T3aN1",
          "T3aNX",
          "T3aN0M1",
          "T3bN0",
          "T1aNXM0",
          "T2aNX",
          "T3aNXM0",
          "T3bNX",
          "T1bNX",
          "T2bNX",
          "T3aN0M0",
          "T1bNXM0",
          "T1bN1",
          "T3aN0",
          "T1aN0M0",
          "T4N0",
          "T3N0",
          "none",
          "T3N1",
          "T2bNXM0",
          "T2bN0",
          "T2aN0",
          "T2aNXM0"
        ],
        "field_uniqueness_percent": 15.08
      },
      "curated_sample_grade": {
        "field_data_type": "object",
        "field_description": "The column \"curated_sample_grade\" in the \"main\" table appears to represent a grading system for samples, likely indicating their quality or classification. The values in this column include 'G1', 'G2', 'G3', and 'G4', which suggest a hierarchical grading scale, with 'G1' possibly representing the highest quality and 'G4' the lowest. Given that there are only four unique values and a low uniqueness percentage of 2.23, it indicates that this column is likely used to categorize a limited set of samples into distinct grades for analysis or reporting purposes.",
        "field_sample_values": [
          "G3",
          "G4",
          "G2",
          "G1"
        ],
        "field_unique_values": [
          "G3",
          "G4",
          "G2",
          "G1"
        ],
        "field_uniqueness_percent": 2.23
      },
      "curated_stage": {
        "field_data_type": "object",
        "field_description": "The `curated_stage` column in the `main` table likely represents the different stages of a process or classification system, indicated by Roman numerals. The sample values, which include 'I', 'II', 'III', and 'IV', suggest a hierarchical or sequential progression, where 'I' may denote the initial stage and 'IV' the final stage. With a low uniqueness percentage of 2.23, this indicates that the values are not highly distinct across the dataset, suggesting that many records may share the same stage designation. This column is likely used to categorize or track the status of items or entities within a specific workflow or system.",
        "field_sample_values": [
          "III",
          "I",
          "IV",
          "II"
        ],
        "field_unique_values": [
          "III",
          "I",
          "IV",
          "II"
        ],
        "field_uniqueness_percent": 2.23
      },
      "curated_drug_sensitivity": {
        "field_data_type": "object",
        "field_description": "The `curated_drug_sensitivity` column in the `main` table is designed to indicate the sensitivity of a subject or sample to specific drugs. The data type is an object, which suggests that it may contain various types of data, but in this case, the sample and unique values are both limited to the entry 'none'. This indicates that there may be no recorded drug sensitivity information for the entries in this column. With a uniqueness percent of 0.56, it implies that the majority of the records share the same value, further reinforcing that drug sensitivity data may not be available or relevant for the current dataset.",
        "field_sample_values": [
          "none"
        ],
        "field_unique_values": [
          "none"
        ],
        "field_uniqueness_percent": 0.56
      },
      "curated_patient_id": {
        "field_data_type": "object",
        "field_description": "The column \"curated_patient_id\" in the \"main\" table likely represents a unique identifier assigned to patients within a healthcare or clinical database. The identifiers are formatted as alphanumeric strings, such as 'C3L-00004', which suggest a systematic approach to categorizing patients. With 107 unique values out of a total number of entries, this column has a uniqueness percentage of approximately 59.78%, indicating that some patients may have multiple entries or records associated with them. This field is essential for tracking patient data, ensuring accurate record-keeping, and facilitating data analysis in clinical research or patient management.",
        "field_sample_values": [
          "C3L-00004",
          "C3L-00010",
          "C3L-00011",
          "C3L-00026",
          "C3L-00079"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "curated_sample_type": {
        "field_data_type": "object",
        "field_description": "The column \"curated_sample_type\" in the \"main\" table is designed to categorize the type of biological samples collected in a study. It contains object data types, with sample values including 'primary_tumor' and 'tumor_adjacent_normal'. These values indicate that the samples are either taken directly from a primary tumor or from normal tissue adjacent to the tumor. The uniqueness percent of 1.12 suggests that there are very few distinct values in this column, indicating a limited range of sample types being recorded. This field is likely used to help differentiate between tumor samples and their surrounding normal tissues for analysis in research or clinical settings.",
        "field_sample_values": [
          "primary_tumor",
          "tumor_adjacent_normal"
        ],
        "field_unique_values": [
          "primary_tumor",
          "tumor_adjacent_normal"
        ],
        "field_uniqueness_percent": 1.12
      },
      "age_at_diagnosis_in_yrs": {
        "field_data_type": "float64",
        "field_description": "The column \"age_at_diagnosis_in_yrs\" in the \"main\" table represents the age of individuals, measured in years, at the time they were diagnosed with a particular condition or disease. The data type is float64, indicating that the values can include decimal points, which allows for more precise age measurements. Sample values such as 72.4, 30.2, and 63.9 suggest that ages can vary widely, and there are a total of 97 unique values recorded in this column, reflecting a diversity of ages at diagnosis. The uniqueness percent of 54.19 indicates that just over half of the entries in this column are distinct, suggesting that some ages may be more common than others among the diagnosed individuals.",
        "field_sample_values": [
          72.4,
          30.2,
          63.9,
          65.4,
          49.4
        ],
        "field_unique_values": "97 unique values",
        "field_uniqueness_percent": 54.19
      },
      "ajcc_pathologic_m": {
        "field_data_type": "object",
        "field_description": "The column \"ajcc_pathologic_m\" in the \"main\" table likely represents the pathologic classification of metastatic disease according to the AJCC (American Joint Committee on Cancer) staging system. The values in this column indicate the presence or absence of metastasis in a patient's cancer diagnosis. \n\n- \"M0\" signifies that there is no evidence of distant metastasis.\n- \"M1\" indicates that there is evidence of distant metastasis.\n- \"Unknown\" is used when the status of metastasis is not determined or documented.\n\nWith a uniqueness percent of 1.68, this field contains a limited number of distinct values, suggesting that most entries are either \"M0\" or \"M1,\" with \"Unknown\" being less common. This classification is crucial for determining the stage of cancer and guiding treatment decisions.",
        "field_sample_values": [
          "Unknown",
          "M1",
          "M0"
        ],
        "field_unique_values": [
          "Unknown",
          "M1",
          "M0"
        ],
        "field_uniqueness_percent": 1.68
      },
      "ajcc_pathologic_n": {
        "field_data_type": "object",
        "field_description": "The column \"ajcc_pathologic_n\" in the \"main\" table is likely used to represent the pathologic classification of lymph node involvement in cancer staging, as defined by the American Joint Committee on Cancer (AJCC). The sample values, which include 'NX', 'N0', and 'N1', indicate different levels of lymph node involvement: \n\n- 'NX' signifies that regional lymph nodes cannot be assessed,\n- 'N0' indicates no regional lymph node involvement, and \n- 'N1' denotes the presence of metastasis in regional lymph nodes.\n\nWith a uniqueness percentage of 1.68, this column contains a limited number of distinct values, suggesting that most entries in this field are similar or repeated across the dataset.",
        "field_sample_values": [
          "NX",
          "N0",
          "N1"
        ],
        "field_unique_values": [
          "NX",
          "N0",
          "N1"
        ],
        "field_uniqueness_percent": 1.68
      },
      "ajcc_pathologic_stage": {
        "field_data_type": "object",
        "field_description": "The column \"ajcc_pathologic_stage\" in the \"main\" table represents the pathologic stage of a disease, likely cancer, as classified by the American Joint Committee on Cancer (AJCC). The values in this column indicate the severity or extent of the disease, with stages ranging from I to IV, where stage I typically represents an earlier, less severe stage and stage IV indicates a more advanced, severe stage. The unique values suggest that there are four distinct stages recorded in this dataset, and the low uniqueness percentage indicates that many records may share the same stage classification.",
        "field_sample_values": [
          "III",
          "I",
          "IV",
          "II"
        ],
        "field_unique_values": [
          "III",
          "I",
          "IV",
          "II"
        ],
        "field_uniqueness_percent": 2.23
      },
      "ajcc_pathologic_t": {
        "field_data_type": "object",
        "field_description": "The column \"ajcc_pathologic_t\" in the \"main\" table likely represents the pathologic classification of tumors according to the AJCC (American Joint Committee on Cancer) staging system. This classification system is used to describe the extent of cancer in a patient's body, specifically focusing on the size and local extent of the primary tumor. The sample values, such as 'T3', 'T1b', 'T3a', 'T1a', and 'T3b', indicate different stages or subcategories of tumor size and involvement. The unique values suggest a range of classifications from T1 to T4, where 'T1' typically indicates a smaller tumor and 'T4' indicates a larger or more invasive tumor. The uniqueness percent of 4.47 indicates that there is a relatively low diversity of values in this column, suggesting that most entries fall within a limited set of classifications.",
        "field_sample_values": [
          "T3",
          "T1b",
          "T3a",
          "T1a",
          "T3b"
        ],
        "field_unique_values": [
          "T3",
          "T1b",
          "T3a",
          "T1a",
          "T3b",
          "T2a",
          "T2b",
          "T4"
        ],
        "field_uniqueness_percent": 4.47
      },
      "ajcc_staging_system_edition": {
        "field_data_type": "object",
        "field_description": "The column \"ajcc_staging_system_edition\" in the \"main\" table likely represents the edition of the AJCC (American Joint Committee on Cancer) staging system used for cancer classification. The data type is an object, indicating that it may contain string values. The sample value provided is \"7th,\" which suggests that this column specifically refers to the 7th edition of the staging system. With only one unique value observed, it appears that this field is primarily used to indicate the version of the staging system applied to the records in this database, with a uniqueness percentage of 0.56, indicating that it is not widely varied across the dataset.",
        "field_sample_values": [
          "7th"
        ],
        "field_unique_values": [
          "7th"
        ],
        "field_uniqueness_percent": 0.56
      },
      "alcohol_history": {
        "field_data_type": "object",
        "field_description": "The \"alcohol_history\" column in the \"main\" table is designed to capture information regarding an individual's history of alcohol consumption. It contains categorical data represented as text, with possible values including 'No', indicating no history of alcohol use; 'Not Reported', suggesting that the individual did not provide information on their alcohol consumption; and 'Yes', signifying a history of alcohol use. The uniqueness percentage of 1.68 indicates that this field has a limited variety of responses, with the majority of entries falling into one of the three specified categories. This column is likely used for assessing alcohol-related health risks or behaviors in the dataset.",
        "field_sample_values": [
          "No",
          "Not Reported",
          "Yes"
        ],
        "field_unique_values": [
          "No",
          "Not Reported",
          "Yes"
        ],
        "field_uniqueness_percent": 1.68
      },
      "alcohol_intensity": {
        "field_data_type": "object",
        "field_description": "The column \"alcohol_intensity\" in the \"main\" table categorizes individuals based on their drinking habits. It contains values that indicate the frequency or extent of alcohol consumption, with sample entries including 'Lifelong Non-Drinker', 'Unknown', 'Occasional Drinker', and 'Non-Drinker'. The uniqueness percent of 2.23 suggests that this column has a low level of unique entries relative to the total number of records, indicating that many individuals fall into the same categories regarding their alcohol consumption. This field is likely used for analyzing the relationship between alcohol consumption and various health or demographic factors.",
        "field_sample_values": [
          "Lifelong Non-Drinker",
          "Unknown",
          "Occasional Drinker",
          "Non-Drinker"
        ],
        "field_unique_values": [
          "Lifelong Non-Drinker",
          "Unknown",
          "Occasional Drinker",
          "Non-Drinker"
        ],
        "field_uniqueness_percent": 2.23
      },
      "biospecimen_anatomic_site": {
        "field_data_type": "object",
        "field_description": "The column \"biospecimen_anatomic_site\" in the \"main\" table likely represents the specific anatomical location from which a biospecimen, such as a tissue sample, has been collected. In this case, the sample value indicates that the biospecimen is derived from the \"Kidney.\" With a uniqueness percent of 0.56, this suggests that there are limited distinct values in this column, indicating that most entries may refer to the same anatomical site.",
        "field_sample_values": [
          "Kidney"
        ],
        "field_unique_values": [
          "Kidney"
        ],
        "field_uniqueness_percent": 0.56
      },
      "bmi": {
        "field_data_type": "float64",
        "field_description": "The \"bmi\" column in the \"main\" table represents the Body Mass Index (BMI) values of individuals. BMI is a numerical value derived from an individual's weight and height, used to assess whether a person has a healthy body weight for their height. The data type of this column is float64, indicating that the values are stored as floating-point numbers, allowing for decimal precision. \n\nSample values such as 22.8, 34.15, and 27.47 suggest a range of BMI measurements, which can indicate various categories of body weight, from underweight to obesity. The column contains a total of 66 unique BMI values, with a uniqueness percentage of 27.37%, indicating that many individuals share similar BMI measurements. This field is likely used for health assessments, research, or statistical analysis related to body weight and health outcomes.",
        "field_sample_values": [
          22.8,
          34.15,
          27.47,
          28.23,
          37.88
        ],
        "field_unique_values": [
          22.8,
          34.15,
          27.47,
          28.23,
          37.88,
          32.82,
          27.44,
          36.81,
          28.7,
          42.92,
          38.94,
          27.35,
          32.0,
          59.88,
          36.57,
          26.18,
          33.66,
          37.72,
          42.33,
          37.96,
          40.74,
          21.96,
          68.59,
          38.99,
          29.49,
          29.6,
          30.81,
          35.66,
          29.01,
          27.04,
          19.49,
          30.56,
          33.96,
          19.72,
          47.25,
          27.85,
          36.36,
          45.37,
          34.76,
          30.86,
          46.17,
          25.31,
          39.45,
          36.0,
          29.38,
          48.46,
          38.08,
          42.77,
          27.52
        ],
        "field_uniqueness_percent": 27.37
      },
      "cause_of_death": {
        "field_data_type": "object",
        "field_description": "The \"cause_of_death\" column in the \"main\" table is designed to capture the specific reasons for an individual's death. It is categorized as an object data type, indicating that it contains textual descriptions. Sample values include \"Cancer Related,\" \"Infection,\" and \"Unknown,\" suggesting that the column records various medical conditions or circumstances leading to death. The presence of unique values indicates that there are only a few distinct categories represented, with a uniqueness percentage of 1.68%, implying that most entries in this column may fall into a limited number of categories. Overall, this field likely serves to provide insights into mortality causes within the dataset.",
        "field_sample_values": [
          "Cancer Related",
          "Infection",
          "Unknown"
        ],
        "field_unique_values": [
          "Cancer Related",
          "Infection",
          "Unknown"
        ],
        "field_uniqueness_percent": 1.68
      },
      "initial_weight": {
        "field_data_type": "object",
        "field_description": "The \"initial_weight\" column in the \"main\" table likely represents the starting weight of an item or individual before any changes or modifications occur. The data type is classified as an object, indicating that the values are stored as strings rather than numerical types. Sample values such as '484', '252', '575', '223', and '272' suggest that these weights are recorded in a numeric format, possibly representing grams or another unit of measurement. With 125 unique values and a uniqueness percentage of 69.83%, this column contains a diverse range of initial weight entries, indicating that while many weights are repeated, there is still a significant variety present in the dataset.",
        "field_sample_values": [
          "484",
          "252",
          "575",
          "223",
          "272"
        ],
        "field_unique_values": "125 unique values",
        "field_uniqueness_percent": 69.83
      },
      "cigarettes_per_day": {
        "field_data_type": "object",
        "field_description": "The column \"cigarettes_per_day\" in the \"main\" table likely represents the number of cigarettes smoked by an individual on a daily basis. The data type is categorized as an object, indicating that the values are stored as strings rather than numeric types. Sample values include '20', '40', '10', '30', and '5', which suggest that the entries reflect various daily smoking habits. The unique values include a range of numbers, as well as '0.0' and 'nan', which may indicate instances of non-smoking or missing data. The uniqueness percent of 6.7 suggests that there is a relatively low diversity in the values recorded, with many entries potentially repeating. Overall, this column is intended to capture the daily cigarette consumption of individuals in the dataset.",
        "field_sample_values": [
          "20",
          "40",
          "10",
          "30",
          "5"
        ],
        "field_unique_values": [
          "20",
          "40",
          "10",
          "30",
          "5",
          "12",
          "24",
          "0.0, nan",
          "50",
          "3",
          "4",
          "15"
        ],
        "field_uniqueness_percent": 6.7
      },
      "composition": {
        "field_data_type": "object",
        "field_description": "The \"composition\" column in the \"main\" table is designed to describe the physical state or form of the data entries. It currently contains object data types, with sample values indicating a specific type of material or substance. In this case, the only unique value present is \"Solid Tissue,\" suggesting that this column is likely used to categorize biological samples or materials, specifically indicating that they are composed of solid tissue. The uniqueness percentage of 0.56 indicates that this value is not widely varied within the dataset, implying a focused scope of data related to solid tissue samples.",
        "field_sample_values": [
          "Solid Tissue"
        ],
        "field_unique_values": [
          "Solid Tissue"
        ],
        "field_uniqueness_percent": 0.56
      },
      "consent_type": {
        "field_data_type": "object",
        "field_description": "The \"consent_type\" column in the \"main\" table is designed to capture the type of consent provided by individuals involved in a study or process. Currently, it contains a single unique value, \"Informed Consent,\" indicating that participants have been fully informed about the details of the study and have agreed to participate. The uniqueness percentage of 0.56 suggests that this column may have limited variability, with most entries reflecting the same consent type. This field is crucial for ensuring ethical standards are met in research or data collection practices.",
        "field_sample_values": [
          "Informed Consent"
        ],
        "field_unique_values": [
          "Informed Consent"
        ],
        "field_uniqueness_percent": 0.56
      },
      "current_weight": {
        "field_data_type": "object",
        "field_description": "The column \"current_weight\" in the \"main\" table appears to represent the weight of items or entities, recorded as string values (object data type). The sample values, which include whole numbers and a decimal (e.g., '201', '480', '0.267', '300', '448'), suggest that the weights can vary significantly, possibly indicating different units of measurement or types of items. With 74 unique values and a uniqueness percentage of 41.34%, it indicates that there are some repeated weights among the entries, but a substantial variety exists as well. This field is likely used for tracking or analyzing the weight of various items within the database.",
        "field_sample_values": [
          "201",
          "480",
          "0.267",
          "300",
          "448"
        ],
        "field_unique_values": "74 unique values",
        "field_uniqueness_percent": 41.34
      },
      "days_to_birth": {
        "field_data_type": "int64",
        "field_description": "The \"days_to_birth\" column in the \"main\" table represents the number of days from a given reference date to an individual's birth date. The negative values indicate that the birth dates occurred in the past relative to the reference date. For example, a value of -26409 suggests that the individual's birth date was 26,409 days before the reference date. With 106 unique values and a uniqueness percentage of 59.22%, this column captures a range of birth dates for different individuals, with some individuals sharing the same birth date.",
        "field_sample_values": [
          -26409,
          -11025,
          -23307,
          -23881,
          -18021
        ],
        "field_unique_values": "106 unique values",
        "field_uniqueness_percent": 59.22
      },
      "days_to_consent": {
        "field_data_type": "float64",
        "field_description": "The column \"days_to_consent\" in the \"main\" table represents the number of days it takes for an individual to provide consent for a specific process or action. The data type is float64, indicating that the values can be decimal numbers, which allows for more precise measurements of time. Sample values include 0.0, 4.0, 10.0, 6.0, and 8.0 days, suggesting that the time to consent can vary significantly among individuals. The column contains a total of 14 unique values, with a uniqueness percentage of 7.82%, indicating that many entries share the same values, while a few are distinct. This field is likely used to analyze the time efficiency of obtaining consent in various contexts.",
        "field_sample_values": [
          0.0,
          4.0,
          10.0,
          6.0,
          8.0
        ],
        "field_unique_values": [
          0.0,
          4.0,
          10.0,
          6.0,
          8.0,
          7.0,
          3.0,
          1.0,
          15.0,
          14.0,
          17.0,
          2.0,
          9.0,
          5.0
        ],
        "field_uniqueness_percent": 7.82
      },
      "days_to_death": {
        "field_data_type": "float64",
        "field_description": "The column \"days_to_death\" in the \"main\" table likely represents the number of days remaining until an individual is expected to pass away. The values are stored as floating-point numbers (float64), indicating that they can include decimal points, although the sample values provided are all whole numbers. The range of unique values suggests a wide variation in the number of days, with some individuals having only a few days left, while others may have several years. The uniqueness percentage of 11.73 indicates that there are many repeated values in this column, suggesting that multiple individuals may share similar timeframes until death. This field could be used in analyses related to health outcomes, life expectancy, or mortality rates.",
        "field_sample_values": [
          241.0,
          274.0,
          694.0,
          71.0,
          1659.0
        ],
        "field_unique_values": [
          241.0,
          274.0,
          694.0,
          71.0,
          1659.0,
          1779.0,
          91.0,
          1230.0,
          1045.0,
          781.0,
          1028.0,
          633.0,
          55.0,
          1229.0,
          1623.0,
          126.0,
          1363.0,
          1637.0,
          99.0,
          452.0,
          47.0
        ],
        "field_uniqueness_percent": 11.73
      },
      "days_to_follow_up": {
        "field_data_type": "float64",
        "field_description": "The column \"days_to_follow_up\" in the \"main\" table likely represents the number of days until a follow-up action is required or scheduled. This field is of type float64, indicating that it can store decimal values, which may be useful for capturing precise durations. The sample values show a range of follow-up periods, suggesting that the follow-up times can vary significantly, from as few as 5 days to as many as 1780 days. With a uniqueness percentage of 27.93, it indicates that there are multiple records with the same follow-up duration, but there are also a variety of distinct values present. This field is likely used in contexts such as patient care, project management, or customer relationship management, where tracking follow-up timelines is essential.",
        "field_sample_values": [
          384.0,
          896.0,
          229.0,
          1769.0,
          245.0
        ],
        "field_unique_values": [
          384.0,
          896.0,
          229.0,
          1769.0,
          245.0,
          687.0,
          68.0,
          1735.0,
          1659.0,
          1779.0,
          1780.0,
          91.0,
          608.0,
          1714.0,
          671.0,
          1758.0,
          1796.0,
          1230.0,
          301.0,
          1045.0,
          768.0,
          1093.0,
          1098.0,
          266.0,
          441.0,
          708.0,
          1094.0,
          333.0,
          495.0,
          344.0,
          8.0,
          5.0,
          15.0,
          966.0,
          1415.0,
          1369.0,
          1419.0,
          1426.0,
          1422.0,
          1423.0,
          735.0,
          1028.0,
          630.0,
          1435.0,
          53.0,
          1229.0,
          329.0,
          250.0,
          1354.0,
          1406.0
        ],
        "field_uniqueness_percent": 27.93
      },
      "days_to_last_follow_up": {
        "field_data_type": "int64",
        "field_description": "The column \"days_to_last_follow_up\" in the \"main\" table likely represents the number of days that have elapsed since the last follow-up action was taken for a particular record or entity. The values are stored as integers (int64), indicating the duration in days. For example, a value of 384 suggests that it has been 384 days since the last follow-up, while a value of 1769 indicates a longer period of 1769 days. With 99 unique values and a uniqueness percentage of 55.31%, this column captures a range of follow-up durations, reflecting varying levels of engagement or activity related to the records in the database.",
        "field_sample_values": [
          384,
          896,
          229,
          1769,
          245
        ],
        "field_unique_values": "99 unique values",
        "field_uniqueness_percent": 55.31
      },
      "days_to_last_known_disease_status": {
        "field_data_type": "int64",
        "field_description": "The column \"days_to_last_known_disease_status\" in the \"main\" table likely represents the number of days elapsed since the last recorded status of a patient's disease. This integer field captures the duration in days, with sample values ranging from 241 to 1769 days, indicating a wide range of time since the last known status was documented. With 98 unique values and a uniqueness percentage of 54.75%, this column reflects a diverse set of time intervals, suggesting that patients may have varying lengths of time since their last assessment.",
        "field_sample_values": [
          384,
          896,
          241,
          1769,
          274
        ],
        "field_unique_values": "98 unique values",
        "field_uniqueness_percent": 54.75
      },
      "days_to_lost_to_followup": {
        "field_data_type": "object",
        "field_description": "The column \"days_to_lost_to_followup\" in the \"main\" table is intended to represent the number of days until a case or individual is considered lost due to a lack of follow-up. However, since there are no sample values or unique values present, it appears that this column may currently be empty or not utilized. The uniqueness percent of 0.0 indicates that there are no distinct entries in this column, suggesting it may not contain meaningful data at this time.",
        "field_sample_values": [],
        "field_unique_values": [],
        "field_uniqueness_percent": 0.0
      },
      "days_to_recurrence": {
        "field_data_type": "float64",
        "field_description": "The \"days_to_recurrence\" column in the \"main\" table likely represents the number of days until a specific event or occurrence is set to repeat. The values are stored as floating-point numbers (float64), indicating that they can include decimal points, although the sample values provided are whole numbers. The unique values suggest a variety of recurrence intervals, ranging from 368 to 1402 days. With a uniqueness percentage of 6.15%, this indicates that there are relatively few distinct values compared to the total number of entries, suggesting that many records may share similar recurrence periods.",
        "field_sample_values": [
          833.0,
          1402.0,
          779.0,
          368.0,
          389.0
        ],
        "field_unique_values": [
          833.0,
          1402.0,
          779.0,
          368.0,
          389.0,
          780.0,
          733.0,
          876.0,
          594.0,
          1416.0,
          456.0
        ],
        "field_uniqueness_percent": 6.15
      },
      "days_to_sample_procurement": {
        "field_data_type": "float64",
        "field_description": "The column \"days_to_sample_procurement\" in the \"main\" table is a numerical field represented as a float64 data type. It likely indicates the number of days remaining or elapsed until the procurement of a sample is completed. The values can be positive, negative, or zero, suggesting that the field may track both the time left (positive values) and the time that has already passed (negative values) relative to a specific procurement deadline. Sample values include 0.0, which may indicate that the procurement is due today, and negative values such as -4.0 and -9.0, which could represent delays or overdue procurement processes. The uniqueness percent of 6.7 indicates that there is a relatively low variety of distinct values in this column, suggesting that many entries may share similar timeframes for sample procurement.",
        "field_sample_values": [
          0.0,
          -4.0,
          -6.0,
          -9.0,
          -8.0
        ],
        "field_unique_values": [
          0.0,
          -4.0,
          -6.0,
          -9.0,
          -8.0,
          -7.0,
          -2.0,
          -1.0,
          -14.0,
          -10.0,
          -3.0,
          -5.0
        ],
        "field_uniqueness_percent": 6.7
      },
      "demographic.state": {
        "field_data_type": "object",
        "field_description": "The column \"demographic.state\" in the \"main\" table appears to represent a specific status or condition related to demographics, with the only recorded value being \"released.\" Given that this is the sole unique value and constitutes 0.56% of the total entries, it suggests that this field may indicate whether a demographic record has been finalized or made public. The use of the term \"released\" implies that the data may pertain to individuals or groups whose demographic information has been officially disclosed or published.",
        "field_sample_values": [
          "released"
        ],
        "field_unique_values": [
          "released"
        ],
        "field_uniqueness_percent": 0.56
      },
      "diabetes_treatment_type": {
        "field_data_type": "object",
        "field_description": "The column \"diabetes_treatment_type\" in the \"main\" table is designed to indicate the type of treatment a patient is receiving for diabetes. The data type is an object, suggesting that it can hold various types of values, although the sample and unique values currently show only 'Insulin'. This indicates that, at present, the only treatment type recorded in this column is insulin therapy. The uniqueness percent of 0.56 implies that a significant portion of the entries in this column may share the same value, indicating that insulin is a common treatment among the patients represented in this dataset.",
        "field_sample_values": [
          "Insulin"
        ],
        "field_unique_values": [
          "Insulin"
        ],
        "field_uniqueness_percent": 0.56
      },
      "diagnoses.state": {
        "field_data_type": "object",
        "field_description": "The column \"diagnoses.state\" in the \"main\" table likely represents the current status of a diagnosis for a patient or case. Given that the data type is an object and the sample and unique values are both 'released', it suggests that this field indicates whether a diagnosis has been finalized and the patient has been released from care or treatment. The uniqueness percent of 0.56 indicates that this value is not highly varied, implying that most entries in this column are likely to reflect the same state, which is 'released'.",
        "field_sample_values": [
          "released"
        ],
        "field_unique_values": [
          "released"
        ],
        "field_uniqueness_percent": 0.56
      },
      "diagnosis_is_primary_disease": {
        "field_data_type": "int64",
        "field_description": "The column \"diagnosis_is_primary_disease\" in the \"main\" table is an integer field that indicates whether a diagnosis is classified as the primary disease for a patient. The sample and unique values suggest that this column primarily contains the value '1', which likely signifies that the diagnosis is indeed the primary disease. The uniqueness percentage of 0.56 indicates that this field has limited variability, with most entries consistently marked as the primary diagnosis.",
        "field_sample_values": [
          1
        ],
        "field_unique_values": [
          1
        ],
        "field_uniqueness_percent": 0.56
      },
      "diagnosis_pathologically_confirmed": {
        "field_data_type": "object",
        "field_description": "The column \"diagnosis_pathologically_confirmed\" in the \"main\" table likely indicates whether a diagnosis has been confirmed through pathological examination. The data type is an object, suggesting that the values are stored as strings. The sample and unique values show that the only recorded response is \"Yes,\" implying that all entries in this column confirm that the diagnoses have been pathologically validated. The uniqueness percent of 0.56 indicates that this field has low variability, with nearly all records affirming the pathological confirmation of diagnoses.",
        "field_sample_values": [
          "Yes"
        ],
        "field_unique_values": [
          "Yes"
        ],
        "field_uniqueness_percent": 0.56
      },
      "disease_response": {
        "field_data_type": "object",
        "field_description": "The \"disease_response\" column in the \"main\" table likely represents the response of patients to a specific treatment or intervention related to a disease. The values in this column indicate different outcomes of the treatment: \"CR-Complete Response\" suggests that there is no detectable disease following treatment, \"PD-Progressive Disease\" indicates that the disease has worsened, and \"Unknown\" signifies that the response has not been determined or recorded. With a uniqueness percent of 1.68, this column contains a limited variety of responses, suggesting that most entries may fall into one of the defined categories.",
        "field_sample_values": [
          "Unknown",
          "CR-Complete Response",
          "PD-Progressive Disease"
        ],
        "field_unique_values": [
          "Unknown",
          "CR-Complete Response",
          "PD-Progressive Disease"
        ],
        "field_uniqueness_percent": 1.68
      },
      "disease_type": {
        "field_data_type": "object",
        "field_description": "The \"disease_type\" column in the \"main\" table contains information about different types of diseases, specifically related to renal cell carcinoma and adenomas. The data type is an object, indicating that the values are stored as strings. Sample values include \"Clear Cell Renal Cell Carcinoma,Adenomas and Adenocarcinomas\" and \"Non-Clear Cell Renal Cell Carcinoma,Adenomas and Adenocarcinomas,\" which suggest that the column captures both the specific subtype of renal cell carcinoma and associated conditions. With only two unique values and a uniqueness percentage of 1.12, this column likely categorizes the disease types into a limited set of classifications.",
        "field_sample_values": [
          "Clear Cell Renal Cell Carcinoma,Adenomas and Adenocarcinomas",
          "Non-Clear Cell Renal Cell Carcinoma,Adenomas and Adenocarcinomas"
        ],
        "field_unique_values": [
          "Clear Cell Renal Cell Carcinoma,Adenomas and Adenocarcinomas",
          "Non-Clear Cell Renal Cell Carcinoma,Adenomas and Adenocarcinomas"
        ],
        "field_uniqueness_percent": 1.12
      },
      "ecog_performance_status": {
        "field_data_type": "object",
        "field_description": "The column \"ecog_performance_status\" in the \"main\" table likely represents the performance status of patients based on the Eastern Cooperative Oncology Group (ECOG) scale. This scale is commonly used in clinical settings to assess a patient's level of functioning and ability to carry out daily activities, particularly in the context of cancer treatment. The sample values indicate that the status may not always be reported or may be unknown, with '0' typically signifying that the patient is fully active and able to carry on all pre-disease activities without restriction. The uniqueness percent of 1.68 suggests that the values in this column are not highly diverse, with only a few distinct entries present.",
        "field_sample_values": [
          "Not Reported",
          "Unknown",
          "0"
        ],
        "field_unique_values": [
          "Not Reported",
          "Unknown",
          "0"
        ],
        "field_uniqueness_percent": 1.68
      },
      "ethnicity": {
        "field_data_type": "object",
        "field_description": "The \"ethnicity\" column in the \"main\" table is designed to capture the ethnic background of individuals. It contains categorical data represented as strings, with sample values including 'not hispanic or latino', 'hispanic or latino', and 'not reported'. The column has a low uniqueness percentage of 1.68, indicating that the majority of entries fall into a few common categories. This field likely serves to classify individuals based on their ethnicity for demographic analysis or reporting purposes.",
        "field_sample_values": [
          "not hispanic or latino",
          "hispanic or latino",
          "not reported"
        ],
        "field_unique_values": [
          "not hispanic or latino",
          "hispanic or latino",
          "not reported"
        ],
        "field_uniqueness_percent": 1.68
      },
      "exposures.state": {
        "field_data_type": "object",
        "field_description": "The column \"exposures.state\" in the \"main\" table is an object data type that appears to represent the state of exposures within the dataset. Based on the sample and unique values, which both indicate \"released,\" it is likely that this field is used to denote whether an exposure has been officially released or made public. The uniqueness percentage of 0.56 suggests that while there are some variations in the data, the majority of entries in this column are consistent, indicating that most exposures are in the \"released\" state.",
        "field_sample_values": [
          "released"
        ],
        "field_unique_values": [
          "released"
        ],
        "field_uniqueness_percent": 0.56
      },
      "freezing_method": {
        "field_data_type": "object",
        "field_description": "The \"freezing_method\" column in the \"main\" table likely represents the technique used to freeze samples or materials within the database. Given that the sample value is 'LN2', which stands for liquid nitrogen, it suggests that this method is primarily used for rapid freezing to preserve biological samples or other materials. The uniqueness percent of 0.56 indicates that this column has a low variety of values, with 'LN2' being the predominant method recorded.",
        "field_sample_values": [
          "LN2"
        ],
        "field_unique_values": [
          "LN2"
        ],
        "field_uniqueness_percent": 0.56
      },
      "gender": {
        "field_data_type": "object",
        "field_description": "The \"gender\" column in the \"main\" table is designed to represent the gender of individuals recorded in the database. It is of object data type and contains two unique values: 'male' and 'female'. The uniqueness percentage of 1.12 indicates that this column has a low level of variability, suggesting that most entries are likely to fall into one of these two categories. This field is likely used for demographic analysis or to categorize individuals based on gender.",
        "field_sample_values": [
          "male",
          "female"
        ],
        "field_unique_values": [
          "male",
          "female"
        ],
        "field_uniqueness_percent": 1.12
      },
      "height_in_cm": {
        "field_data_type": "float64",
        "field_description": "The column \"height_in_cm\" in the \"main\" table represents the height of individuals measured in centimeters. The data type of this column is float64, indicating that the heights can include decimal values for more precise measurements. Sample values such as 170.0, 177.0, and 180.0 suggest that the heights are recorded in a standard format, likely reflecting the actual physical height of individuals. The presence of unique values, which include a range of heights from 152.0 cm to 188.0 cm, indicates a diverse dataset with varying heights. The uniqueness percent of 17.88 suggests that there is a moderate level of repetition among the height entries, meaning that many individuals may share similar heights. Overall, this column is likely used for demographic analysis, health assessments, or other studies where height is a relevant factor.",
        "field_sample_values": [
          170.0,
          177.0,
          180.0,
          163.0,
          175.0
        ],
        "field_unique_values": [
          170.0,
          177.0,
          180.0,
          163.0,
          175.0,
          178.0,
          185.0,
          175.2,
          165.1,
          175.26,
          168.0,
          185.4,
          162.0,
          157.5,
          171.45,
          160.02,
          156.21,
          170.18,
          172.72,
          187.96,
          176.53,
          180.34,
          163.83,
          177.8,
          177.98,
          152.0,
          185.42,
          167.64,
          160.0,
          165.0,
          157.48,
          173.0
        ],
        "field_uniqueness_percent": 17.88
      },
      "is_ffpe": {
        "field_data_type": "int64",
        "field_description": "The column \"is_ffpe\" in the \"main\" table is an integer field (int64) that appears to indicate a specific condition or characteristic related to the data it represents. Based on the sample and unique values, which both consist solely of the integer 0, it is likely that this field is used to denote whether a sample is formalin-fixed paraffin-embedded (FFPE) tissue. In this context, a value of 0 may indicate that the sample is not FFPE. The uniqueness percent of 0.56 suggests that this field has low variability, with most entries sharing the same value.",
        "field_sample_values": [
          0
        ],
        "field_unique_values": [
          0
        ],
        "field_uniqueness_percent": 0.56
      },
      "iss_stage": {
        "field_data_type": "object",
        "field_description": "The column \"iss_stage\" in the \"main\" table is an object data type that appears to represent the stage or status of an issue. Based on the sample and unique values, which consist solely of \"Not Reported,\" it suggests that this field is primarily used to indicate that the status of the issue has not been documented or is currently unknown. The uniqueness percent of 0.56 indicates that a significant portion of the entries in this column share the same value, reinforcing the idea that many records may lack specific information regarding the issue's stage.",
        "field_sample_values": [
          "Not Reported"
        ],
        "field_unique_values": [
          "Not Reported"
        ],
        "field_uniqueness_percent": 0.56
      },
      "karnofsky_performance_status": {
        "field_data_type": "object",
        "field_description": "The column \"karnofsky_performance_status\" in the \"main\" table likely represents the Karnofsky Performance Status (KPS) score, which is a standard way of measuring the ability of cancer patients to perform ordinary tasks. The KPS score ranges from 0 to 100, with higher scores indicating better performance and functionality. In this dataset, the sample values include 'Not Reported' and 'Unknown', which suggest that there may be instances where the KPS score is not available or not applicable for certain patients. The unique values indicate that there are only a few distinct entries in this column, reflecting limited variability in the data. The uniqueness percent of 1.68 suggests that the majority of entries in this column are not unique, indicating a high frequency of repeated values.",
        "field_sample_values": [
          "Not Reported",
          "Unknown",
          "100"
        ],
        "field_unique_values": [
          "Not Reported",
          "Unknown",
          "100"
        ],
        "field_uniqueness_percent": 1.68
      },
      "last_known_disease_status": {
        "field_data_type": "object",
        "field_description": "The column \"last_known_disease_status\" in the \"main\" table is designed to capture the most recent information regarding a patient's disease condition. It contains categorical data represented as text, with sample values including \"Tumor free,\" \"With tumor,\" and \"Unknown tumor status.\" These values indicate whether a patient is currently free of tumors, has an active tumor, or if the tumor status is not known. The uniqueness percent of 1.68 suggests that this field has a limited variety of entries relative to the total number of records, indicating that most patients fall into one of the three defined categories. This field is crucial for understanding the current health status of patients in relation to tumor presence.",
        "field_sample_values": [
          "Tumor free",
          "With tumor",
          "Unknown tumor status"
        ],
        "field_unique_values": [
          "Tumor free",
          "With tumor",
          "Unknown tumor status"
        ],
        "field_uniqueness_percent": 1.68
      },
      "lost_to_followup": {
        "field_data_type": "object",
        "field_description": "The column \"lost_to_followup\" in the \"main\" table indicates whether an individual has been lost to follow-up in a study or program. It contains two possible values: 'No' signifies that the individual is still engaged or has been successfully followed up, while 'Yes' indicates that the individual has not been reachable or has dropped out of the follow-up process. With a low uniqueness percentage of 1.12, this field suggests that the majority of individuals in the dataset have consistent follow-up status, predominantly either 'No' or 'Yes'.",
        "field_sample_values": [
          "No",
          "Yes"
        ],
        "field_unique_values": [
          "No",
          "Yes"
        ],
        "field_uniqueness_percent": 1.12
      },
      "method_of_sample_procurement": {
        "field_data_type": "object",
        "field_description": "The column \"method_of_sample_procurement\" in the \"main\" table likely represents the technique or procedure used to obtain biological samples for analysis. In this case, the sample value \"Tumor Resection\" indicates that the method involves surgically removing a tumor to collect tissue for further examination. With only one unique value present, it suggests that all entries in this column currently reflect the same procurement method, indicating a focused dataset on tumor resections. The uniqueness percent of 0.56 implies that there is limited variation in the data for this field.",
        "field_sample_values": [
          "Tumor Resection"
        ],
        "field_unique_values": [
          "Tumor Resection"
        ],
        "field_uniqueness_percent": 0.56
      },
      "morphology": {
        "field_data_type": "object",
        "field_description": "The \"morphology\" column in the \"main\" table appears to store date and time information, as indicated by the sample value '8312-03-01 00:00:00'. Given that this value is unique and the uniqueness percentage is relatively low at 0.56%, it suggests that this column may be used to represent specific timestamps associated with certain records in the database. The format resembles a standard datetime format, which could imply that it is intended to track events or changes related to the data entries. However, the unusual year '8312' raises questions about the context and accuracy of the data, suggesting that further investigation may be needed to understand its significance.",
        "field_sample_values": [
          "8312-03-01 00:00:00"
        ],
        "field_unique_values": [
          "8312-03-01 00:00:00"
        ],
        "field_uniqueness_percent": 0.56
      },
      "oct_embedded": {
        "field_data_type": "object",
        "field_description": "The column \"oct_embedded\" in the \"main\" table is an object data type that contains binary values, specifically 'Yes' and 'No'. This field likely indicates whether a certain feature or functionality, possibly related to embedding content or data, is present or enabled for a given record. With only two unique values and a uniqueness percentage of 1.12, it suggests that the majority of records may share a common status, likely leaning towards one of the two options.",
        "field_sample_values": [
          "No",
          "Yes"
        ],
        "field_unique_values": [
          "No",
          "Yes"
        ],
        "field_uniqueness_percent": 1.12
      },
      "pack_years_smoked": {
        "field_data_type": "float64",
        "field_description": "The column \"pack_years_smoked\" in the \"main\" table represents the cumulative number of years a person has smoked, calculated in terms of \"pack years.\" A pack year is defined as smoking one pack of cigarettes per day for one year. For example, if someone smoked half a pack per day for 10 years, that would equate to 5 pack years. The data type for this column is float64, indicating that the values can include decimal points, which allows for more precise measurements of smoking history. The sample values range from 0.3 to 96.0 pack years, reflecting a wide variety of smoking experiences among individuals in the dataset. The uniqueness percent of 18.99 suggests that there are many repeated values, indicating that certain pack year amounts are more common among the population represented in this database.",
        "field_sample_values": [
          44.0,
          10.0,
          52.0,
          22.0,
          17.5
        ],
        "field_unique_values": [
          44.0,
          10.0,
          52.0,
          22.0,
          17.5,
          64.5,
          40.0,
          96.0,
          15.0,
          30.0,
          47.0,
          3.8,
          27.0,
          3.0,
          25.0,
          19.0,
          36.0,
          0.5,
          35.0,
          37.5,
          5.0,
          38.0,
          1.0,
          50.0,
          0.3,
          84.0,
          1.5,
          20.0,
          70.5,
          41.0,
          31.0,
          9.6,
          29.3,
          46.5
        ],
        "field_uniqueness_percent": 18.99
      },
      "pool": {
        "field_data_type": "object",
        "field_description": "The \"pool\" column in the \"main\" table is an object data type that appears to represent a categorical attribute, likely indicating the presence or absence of a pool. The sample and unique values show that the only recorded value is 'No', suggesting that this column is primarily used to denote that there is no pool associated with the entries in this table. With a uniqueness percent of 0.56, it indicates that a significant majority of the records share this same value, reinforcing the idea that the dataset predominantly consists of entries without a pool.",
        "field_sample_values": [
          "No"
        ],
        "field_unique_values": [
          "No"
        ],
        "field_uniqueness_percent": 0.56
      },
      "preservation_method": {
        "field_data_type": "object",
        "field_description": "The \"preservation_method\" column in the \"main\" table likely represents the technique used to preserve samples or materials within the database. Given the sample value \"Snap Frozen,\" it suggests that the preservation method involves rapidly freezing the samples to maintain their integrity and prevent degradation. The uniqueness percent of 0.56 indicates that there is a low variety of preservation methods recorded in this column, with \"Snap Frozen\" being the only unique value observed in the sample data.",
        "field_sample_values": [
          "Snap Frozen"
        ],
        "field_unique_values": [
          "Snap Frozen"
        ],
        "field_uniqueness_percent": 0.56
      },
      "primary_diagnosis": {
        "field_data_type": "object",
        "field_description": "The \"primary_diagnosis\" column in the \"main\" table is designed to store the primary medical diagnosis for patients. The data type is an object, indicating that it can contain various types of information, typically text. In this case, the sample value provided is \"Renal cell carcinoma, NOS,\" which refers to a specific type of kidney cancer. The uniqueness percent of 0.56 suggests that there is a low level of diversity in the values recorded in this column, with \"Renal cell carcinoma, NOS\" being the only unique entry noted. This indicates that the dataset may primarily focus on this particular diagnosis or that it is a common diagnosis among the records.",
        "field_sample_values": [
          "Renal cell carcinoma, NOS"
        ],
        "field_unique_values": [
          "Renal cell carcinoma, NOS"
        ],
        "field_uniqueness_percent": 0.56
      },
      "primary_site": {
        "field_data_type": "object",
        "field_description": "The \"primary_site\" column in the \"main\" table likely represents the primary anatomical location or site of a medical condition, such as a tumor or disease. In this case, the sample value \"Kidney\" indicates that the primary site of interest is the kidney. With a uniqueness percent of 0.56, this suggests that the column contains a limited range of distinct values, with \"Kidney\" being the only unique value observed in the sample. This may imply that the dataset is focused on a specific type of condition or that the primary site is consistently recorded as \"Kidney\" for the entries in this dataset.",
        "field_sample_values": [
          "Kidney"
        ],
        "field_unique_values": [
          "Kidney"
        ],
        "field_uniqueness_percent": 0.56
      },
      "progression_or_recurrence": {
        "field_data_type": "object",
        "field_description": "The column \"progression_or_recurrence\" in the \"main\" table is likely used to indicate the status of a medical condition, specifically whether it has progressed or recurred. The possible values for this field are 'no', 'not reported', and 'yes'. A value of 'no' suggests that there has been no progression or recurrence of the condition, 'yes' indicates that there has been progression or recurrence, and 'not reported' signifies that this information has not been provided. With a uniqueness percent of 1.68, this field contains a limited number of distinct values relative to the total number of entries, suggesting that most records fall into one of the three categories.",
        "field_sample_values": [
          "no",
          "not reported",
          "yes"
        ],
        "field_unique_values": [
          "no",
          "not reported",
          "yes"
        ],
        "field_uniqueness_percent": 1.68
      },
      "project_name": {
        "field_data_type": "object",
        "field_description": "The column \"project_name\" in the \"main\" table is designed to store the names of various projects associated with the data. It is of object data type, indicating that it can hold string values. The sample value provided, \"CPTAC3 Discovery and Confirmatory,\" suggests that this field likely represents specific research or development initiatives, possibly within a scientific or academic context. With a uniqueness percentage of 0.56, it indicates that there are a limited number of distinct project names in the dataset, implying that many entries may refer to the same project.",
        "field_sample_values": [
          "CPTAC3 Discovery and Confirmatory"
        ],
        "field_unique_values": [
          "CPTAC3 Discovery and Confirmatory"
        ],
        "field_uniqueness_percent": 0.56
      },
      "race": {
        "field_data_type": "object",
        "field_description": "The \"race\" column in the \"main\" table is designed to capture the racial or ethnic identity of individuals. It is represented as an object data type, which allows for a variety of string values. The sample values include categories such as 'white', 'black or african american', 'asian', 'other', and 'not reported'. The presence of a 'not reported' option indicates that respondents may choose not to disclose their race. With a uniqueness percent of 2.79, this column contains a limited number of unique entries, suggesting that most individuals fall into the predefined categories. Overall, this field likely serves to categorize individuals based on their racial or ethnic background for demographic analysis or reporting purposes.",
        "field_sample_values": [
          "white",
          "not reported",
          "black or african american",
          "asian",
          "other"
        ],
        "field_unique_values": [
          "white",
          "not reported",
          "black or african american",
          "asian",
          "other"
        ],
        "field_uniqueness_percent": 2.79
      },
      "sample_type": {
        "field_data_type": "object",
        "field_description": "The \"sample_type\" column in the \"main\" table categorizes the type of biological samples collected in the study. It contains data represented as objects, with sample values including 'Primary Tumor' and 'Solid Tissue Normal'. These values indicate whether the sample is derived from a primary tumor or from normal solid tissue, respectively. The column has a low uniqueness percentage of 1.12, suggesting that the majority of entries fall into these two categories, reflecting a focused dataset primarily concerned with tumor and normal tissue samples.",
        "field_sample_values": [
          "Primary Tumor",
          "Solid Tissue Normal"
        ],
        "field_unique_values": [
          "Primary Tumor",
          "Solid Tissue Normal"
        ],
        "field_uniqueness_percent": 1.12
      },
      "samples.state": {
        "field_data_type": "object",
        "field_description": "The column \"samples.state\" in the \"main\" table is an object data type that indicates the current status of a sample. Based on the provided sample values, it appears that the only recorded state is \"released.\" This suggests that the samples in this column are likely in a finalized or distributed condition, meaning they have been processed and are now available for use or analysis. With a uniqueness percent of 0.56, it indicates that the majority of entries in this column share the same value, reinforcing the idea that the samples are predominantly in the \"released\" state.",
        "field_sample_values": [
          "released"
        ],
        "field_unique_values": [
          "released"
        ],
        "field_uniqueness_percent": 0.56
      },
      "secondhand_smoke_as_child": {
        "field_data_type": "object",
        "field_description": "The column \"secondhand_smoke_as_child\" in the \"main\" table likely represents whether an individual was exposed to secondhand smoke during their childhood. The data type is an object, indicating that the values are likely categorical. The sample and unique values suggest that the field primarily contains the response \"Yes,\" indicating that the majority of entries confirm exposure to secondhand smoke as a child. The uniqueness percent of 0.56 indicates that this value is not highly diverse within the dataset, suggesting a common experience among the individuals recorded.",
        "field_sample_values": [
          "Yes"
        ],
        "field_unique_values": [
          "Yes"
        ],
        "field_uniqueness_percent": 0.56
      },
      "site_of_resection_or_biopsy": {
        "field_data_type": "object",
        "field_description": "The column \"site_of_resection_or_biopsy\" in the \"main\" table likely represents the anatomical location where a surgical resection or biopsy procedure was performed. The data type is an object, indicating that the values may include a mix of text and possibly other characters. The sample value provided, ' NOS,Kidney', suggests that the site is related to the kidney, with \"NOS\" potentially indicating \"Not Otherwise Specified.\" The uniqueness percent of 0.56 indicates that there is a low level of variation among the entries in this column, meaning that many records may share the same site designation. Overall, this field is important for identifying the specific location of tissue samples taken for medical analysis.",
        "field_sample_values": [
          " NOS,Kidney"
        ],
        "field_unique_values": [
          " NOS,Kidney"
        ],
        "field_uniqueness_percent": 0.56
      },
      "state": {
        "field_data_type": "object",
        "field_description": "The \"state\" column in the \"main\" table is an object data type that appears to represent the current status of an item or record. Based on the sample and unique values, which both indicate \"released,\" it is likely that this field is used to denote whether an item has been made publicly available or launched. The uniqueness percentage of 0.56 suggests that while \"released\" is the predominant value, there may be other states present in the dataset, although they are not shown in the provided sample. Overall, this column is essential for tracking the availability status of items within the database.",
        "field_sample_values": [
          "released"
        ],
        "field_unique_values": [
          "released"
        ],
        "field_uniqueness_percent": 0.56
      },
      "status": {
        "field_data_type": "object",
        "field_description": "The \"status\" column in the \"main\" table is an object data type that appears to represent the current state or classification of an entity within the database. Based on the sample and unique values, which both include only the term \"Qualified,\" it suggests that this column is used to indicate whether an entity meets certain criteria or standards for qualification. With a uniqueness percent of 0.56, it implies that the majority of entries in this column share the same status, indicating a common classification across the dataset.",
        "field_sample_values": [
          "Qualified"
        ],
        "field_unique_values": [
          "Qualified"
        ],
        "field_uniqueness_percent": 0.56
      },
      "taxon": {
        "field_data_type": "object",
        "field_description": "The \"taxon\" column in the \"main\" table likely represents the scientific classification of an organism, specifically its taxonomic group. Given the sample value \"Homo sapiens,\" it indicates that this field is used to store the species name of living organisms, with \"Homo sapiens\" referring to humans. The uniqueness percent of 0.56 suggests that there are a limited number of distinct species recorded in this column, indicating that many entries may refer to the same taxon.",
        "field_sample_values": [
          "Homo sapiens"
        ],
        "field_unique_values": [
          "Homo sapiens"
        ],
        "field_uniqueness_percent": 0.56
      },
      "time_between_clamping_and_freezing": {
        "field_data_type": "float64",
        "field_description": "The column \"time_between_clamping_and_freezing\" in the \"main\" table likely represents the duration, measured in minutes, between the clamping of a sample and the initiation of freezing. This field is recorded as a float64 data type, indicating that it can accommodate decimal values for more precise measurements. The sample values suggest that this duration typically ranges from 26.0 to 30.0 minutes, with additional unique values indicating a broader range of possible durations. The uniqueness percentage of 7.26 suggests that there is a relatively low diversity of values in this field, indicating that many samples may share similar clamping and freezing times.",
        "field_sample_values": [
          26.0,
          29.0,
          28.0,
          27.0,
          30.0
        ],
        "field_unique_values": [
          26.0,
          29.0,
          28.0,
          27.0,
          30.0,
          25.0,
          22.0,
          24.0,
          21.0,
          23.0,
          20.0,
          19.0,
          16.0
        ],
        "field_uniqueness_percent": 7.26
      },
      "time_between_excision_and_freezing": {
        "field_data_type": "int64",
        "field_description": "The column \"time_between_excision_and_freezing\" in the \"main\" table likely represents the duration, measured in minutes, between the surgical excision of a tissue sample and its subsequent freezing for preservation. The data type is int64, indicating that the values are stored as integers. Sample values range from 7 to 30 minutes, with a total of 27 unique values observed in the dataset. The uniqueness percentage of 15.64 suggests that there is a relatively low diversity in the recorded times, indicating that many samples may have similar durations between excision and freezing. This field is important for understanding the handling and processing times of tissue samples in a clinical or research setting.",
        "field_sample_values": [
          21,
          22,
          17,
          18,
          13
        ],
        "field_unique_values": [
          21,
          22,
          17,
          18,
          13,
          28,
          29,
          23,
          25,
          19,
          20,
          26,
          30,
          16,
          15,
          12,
          9,
          14,
          27,
          7,
          2,
          4,
          5,
          10,
          8,
          3,
          11,
          6
        ],
        "field_uniqueness_percent": 15.64
      },
      "tissue_or_organ_of_origin": {
        "field_data_type": "object",
        "field_description": "The column \"tissue_or_organ_of_origin\" in the \"main\" table likely represents the specific tissue or organ from which a biological sample is derived. The sample value provided, ' NOS,Kidney', suggests that the entries may include both specific organs (like \"Kidney\") and possibly a classification or status indicator (such as \"NOS,\" which could stand for \"Not Otherwise Specified\"). With a uniqueness percent of 0.56, this indicates that there is a moderate level of variation in the values recorded in this column, but many entries may be similar or identical. Overall, this field is intended to capture important information about the anatomical origin of samples in the database.",
        "field_sample_values": [
          " NOS,Kidney"
        ],
        "field_unique_values": [
          " NOS,Kidney"
        ],
        "field_uniqueness_percent": 0.56
      },
      "tissue_type": {
        "field_data_type": "object",
        "field_description": "The \"tissue_type\" column in the \"main\" table is designed to categorize biological samples based on their tissue origin. It contains two unique values: 'Tumor' and 'Normal'. This suggests that the column is used to differentiate between cancerous tissues (Tumor) and healthy tissues (Normal). With a uniqueness percent of 1.12, it indicates that the majority of entries in this column are likely to be either 'Tumor' or 'Normal', reflecting the binary classification of tissue types in the dataset.",
        "field_sample_values": [
          "Tumor",
          "Normal"
        ],
        "field_unique_values": [
          "Tumor",
          "Normal"
        ],
        "field_uniqueness_percent": 1.12
      },
      "tobacco_smoking_onset_year": {
        "field_data_type": "float64",
        "field_description": "The column \"tobacco_smoking_onset_year\" in the \"main\" table likely represents the year in which individuals began smoking tobacco. The data type is float64, indicating that the values are stored as floating-point numbers, which in this case represent years (e.g., 1961.0, 2006.0). The sample values show a range of years from the late 1950s to the early 2000s, suggesting that the dataset captures a historical timeline of smoking initiation. With a uniqueness percent of 16.2, it indicates that there are multiple entries for some years, reflecting that many individuals may have started smoking in the same year. Overall, this field provides insights into the trends and patterns of tobacco smoking initiation across different years.",
        "field_sample_values": [
          1961.0,
          2006.0,
          1959.0,
          1975.0,
          1981.0
        ],
        "field_unique_values": [
          1961.0,
          2006.0,
          1959.0,
          1975.0,
          1981.0,
          1960.0,
          1963.0,
          1968.0,
          2001.0,
          1966.0,
          1969.0,
          1971.0,
          1987.0,
          1984.0,
          1964.0,
          1978.0,
          1970.0,
          1974.0,
          1996.0,
          1980.0,
          1957.0,
          1951.0,
          2011.0,
          1983.0,
          1979.0,
          2004.0,
          1962.0,
          1997.0,
          1985.0
        ],
        "field_uniqueness_percent": 16.2
      },
      "tobacco_smoking_quit_year": {
        "field_data_type": "float64",
        "field_description": "The column \"tobacco_smoking_quit_year\" in the \"main\" table likely represents the year in which individuals ceased tobacco smoking. The data type is float64, indicating that the values are stored as floating-point numbers, which in this context represent years. Sample values include years such as 2005, 1985, and 1997, suggesting that the field captures a range of quit years spanning several decades. The uniqueness percent of 11.73 indicates that a relatively small proportion of unique quit years exist in the dataset, implying that many individuals may have quit smoking in similar years. Overall, this field is useful for analyzing trends in smoking cessation over time.",
        "field_sample_values": [
          2005.0,
          1985.0,
          1997.0,
          2003.0,
          1998.0
        ],
        "field_unique_values": [
          2005.0,
          1985.0,
          1997.0,
          2003.0,
          1998.0,
          1976.0,
          2015.0,
          1986.0,
          2014.0,
          1989.0,
          2000.0,
          2010.0,
          1975.0,
          1987.0,
          1953.0,
          2009.0,
          2013.0,
          1993.0,
          1999.0,
          2016.0,
          2017.0
        ],
        "field_uniqueness_percent": 11.73
      },
      "tobacco_smoking_status": {
        "field_data_type": "object",
        "field_description": "The column \"tobacco_smoking_status\" in the \"main\" table is designed to capture the smoking habits of individuals. It contains categorical data that classifies individuals into different smoking statuses based on their history with tobacco use. The possible values include:\n\n- \"Current Smoker\": Individuals who are currently smoking tobacco.\n- \"Current Reformed Smoker for < or = 15 yrs\": Individuals who have quit smoking but were smokers for 15 years or less.\n- \"Current Reformed Smoker for > 15 yrs\": Individuals who have quit smoking but were smokers for more than 15 years.\n- \"Lifelong Non-Smoker\": Individuals who have never smoked tobacco.\n- \"Smoking history not documented\": Cases where the smoking status of the individual is not recorded.\n\nWith a uniqueness percentage of 2.79, this indicates that the values in this column are relatively consistent across the dataset, with only a small proportion of unique entries. This field is likely used for health assessments, research studies, or demographic analysis related to tobacco use and its effects.",
        "field_sample_values": [
          "Current Reformed Smoker for < or = 15 yrs",
          "Current Smoker",
          "Lifelong Non-Smoker",
          "Current Reformed Smoker for > 15 yrs",
          "Smoking history not documented"
        ],
        "field_unique_values": [
          "Current Reformed Smoker for < or = 15 yrs",
          "Current Smoker",
          "Lifelong Non-Smoker",
          "Current Reformed Smoker for > 15 yrs",
          "Smoking history not documented"
        ],
        "field_uniqueness_percent": 2.79
      },
      "tumor_descriptor": {
        "field_data_type": "object",
        "field_description": "The \"tumor_descriptor\" column in the \"main\" table is designed to categorize the type of tumor associated with the records in the database. Currently, it contains object data type values, with a sample and unique value of \"Primary.\" This indicates that the column is likely used to specify whether the tumor is a primary tumor, which is the original tumor that has developed in the body, as opposed to a secondary or metastatic tumor that has spread from another location. The uniqueness percent of 0.56 suggests that the majority of entries in this column are the same, indicating a limited variety of tumor descriptors in the dataset.",
        "field_sample_values": [
          "Primary"
        ],
        "field_unique_values": [
          "Primary"
        ],
        "field_uniqueness_percent": 0.56
      },
      "tumor_focality": {
        "field_data_type": "object",
        "field_description": "The column \"tumor_focality\" in the \"main\" table indicates the spatial characteristics of tumors in the dataset. It categorizes tumors as either \"Unifocal,\" meaning there is a single tumor present, or \"Multifocal,\" indicating the presence of multiple tumors. The data type is an object, and the column contains only two unique values, reflecting a binary classification of tumor focality. With a uniqueness percentage of 1.12, this suggests that nearly all entries in this column are either \"Unifocal\" or \"Multifocal,\" providing a clear distinction in tumor presentation for analysis.",
        "field_sample_values": [
          "Unifocal",
          "Multifocal"
        ],
        "field_unique_values": [
          "Unifocal",
          "Multifocal"
        ],
        "field_uniqueness_percent": 1.12
      },
      "tumor_grade": {
        "field_data_type": "object",
        "field_description": "The \"tumor_grade\" column in the \"main\" table likely represents the classification of tumors based on their histological characteristics and aggressiveness. The values, which include 'G1', 'G2', 'G3', and 'G4', indicate different grades of tumor differentiation, with 'G1' typically representing well-differentiated tumors and 'G4' indicating poorly differentiated or high-grade tumors. This grading system is commonly used in oncology to help assess the prognosis and guide treatment decisions for patients with cancer. The column contains a limited number of unique values, suggesting that it categorizes tumors into a standardized grading scale.",
        "field_sample_values": [
          "G3",
          "G4",
          "G2",
          "G1"
        ],
        "field_unique_values": [
          "G3",
          "G4",
          "G2",
          "G1"
        ],
        "field_uniqueness_percent": 2.23
      },
      "tumor_stage": {
        "field_data_type": "object",
        "field_description": "The \"tumor_stage\" column in the \"main\" table is designed to capture the stage of a tumor in patients, which is a critical factor in cancer diagnosis and treatment planning. The data type for this column is an object, indicating that it may contain various types of data, such as strings. Currently, the only sample value present is \"Not Reported,\" which suggests that there may be limited or no information available regarding the tumor stage for the records in this database. With a uniqueness percent of 0.56, it indicates that nearly all entries in this column are the same, reflecting a lack of diverse data on tumor stages. This could imply that the information is either not collected consistently or that many patients have not had their tumor stage documented.",
        "field_sample_values": [
          "Not Reported"
        ],
        "field_unique_values": [
          "Not Reported"
        ],
        "field_uniqueness_percent": 0.56
      },
      "type_of_smoke_exposure": {
        "field_data_type": "object",
        "field_description": "The column \"type_of_smoke_exposure\" in the \"main\" table is designed to capture information regarding the nature of smoke exposure experienced by individuals. The data type is classified as an object, indicating that it may contain textual descriptions. Currently, the sample and unique values consist solely of \"Smoke exposure, NOS,\" which stands for \"Not Otherwise Specified.\" This suggests that the column is likely used to categorize instances of smoke exposure that do not fall into more specific classifications. With a uniqueness percentage of 0.56, it indicates that the majority of entries in this column are the same, pointing to limited variability in the recorded data. Overall, this field appears to be focused on documenting general smoke exposure cases without detailed differentiation.",
        "field_sample_values": [
          "Smoke exposure, NOS"
        ],
        "field_unique_values": [
          "Smoke exposure, NOS"
        ],
        "field_uniqueness_percent": 0.56
      },
      "vital_status": {
        "field_data_type": "object",
        "field_description": "The \"vital_status\" column in the \"main\" table indicates the current life status of individuals represented in the database. It contains two possible values: \"Alive\" and \"Dead.\" With a uniqueness percentage of 1.12, this suggests that the majority of entries in this column are either \"Alive\" or \"Dead,\" with very few variations. This field is likely used to track the survival status of individuals for purposes such as health records, demographic studies, or other analyses related to life status.",
        "field_sample_values": [
          "Alive",
          "Dead"
        ],
        "field_unique_values": [
          "Alive",
          "Dead"
        ],
        "field_uniqueness_percent": 1.12
      },
      "weight_in_kg": {
        "field_data_type": "float64",
        "field_description": "The column \"weight_in_kg\" in the \"main\" table represents the weight of individuals or objects measured in kilograms. The data type is float64, indicating that the values can include decimal points, allowing for precise weight measurements. Sample values such as 65.9, 107.0, and 89.0 illustrate the range of weights recorded in the dataset. The column contains a total of 48 unique values, with a uniqueness percentage of 26.26%, suggesting that many weights are repeated across the dataset. This field is likely used for analyses related to weight, such as health assessments, fitness tracking, or inventory management.",
        "field_sample_values": [
          65.9,
          107.0,
          89.0,
          75.0,
          116.0
        ],
        "field_unique_values": [
          65.9,
          107.0,
          89.0,
          75.0,
          116.0,
          104.0,
          93.9,
          113.0,
          93.0,
          117.0,
          122.0,
          84.0,
          98.0,
          169.0,
          118.5,
          90.0,
          94.0,
          95.0,
          99.0,
          105.0,
          111.58,
          104.33,
          56.25,
          167.38,
          112.94,
          88.0,
          85.73,
          108.86,
          111.13,
          94.35,
          72.57,
          59.87,
          96.62,
          57.0,
          149.69,
          74.0,
          156.0,
          97.7,
          100.0,
          158.0,
          80.0,
          101.0,
          158.76,
          120.2,
          97.52,
          128.0,
          87.0
        ],
        "field_uniqueness_percent": 26.26
      },
      "year_of_birth": {
        "field_data_type": "int64",
        "field_description": "The `year_of_birth` column in the `main` table represents the birth years of individuals recorded in the database. The data type for this column is `int64`, indicating that the values are stored as 64-bit integers. Sample values include years such as 1943, 1986, and 1952, suggesting that the dataset encompasses a wide range of birth years, likely spanning from the early 20th century to the late 20th century. \n\nThe column contains a total of 42 unique values, with a uniqueness percentage of 24.02%, indicating that many individuals share the same birth year. This field is likely used for demographic analysis, age calculations, or other statistical purposes related to the individuals represented in the dataset.",
        "field_sample_values": [
          1943,
          1986,
          1952,
          1950,
          1967
        ],
        "field_unique_values": [
          1943,
          1986,
          1952,
          1950,
          1967,
          1963,
          1957,
          1960,
          1944,
          1926,
          1954,
          1959,
          1981,
          1966,
          1964,
          1961,
          1941,
          1955,
          1972,
          1940,
          1949,
          1975,
          1942,
          1933,
          1936,
          1947,
          1956,
          1978,
          1980,
          1958,
          1946,
          1945,
          1953,
          1970,
          1968,
          1948,
          1969,
          1931,
          1984,
          1937,
          1962,
          1951,
          1965
        ],
        "field_uniqueness_percent": 24.02
      },
      "year_of_death": {
        "field_data_type": "float64",
        "field_description": "The \"year_of_death\" column in the \"main\" table likely represents the year in which individuals passed away. The data type is float64, indicating that the values are stored as floating-point numbers, which in this case are whole years (e.g., 2016.0, 2017.0). The sample values show a range of years from 2016 to 2021, with additional unique values indicating that 2019 is also included. The uniqueness percent of 3.35 suggests that there are relatively few distinct years compared to the total number of entries, indicating that many individuals may share the same year of death.",
        "field_sample_values": [
          2016.0,
          2017.0,
          2018.0,
          2021.0,
          2020.0
        ],
        "field_unique_values": [
          2016.0,
          2017.0,
          2018.0,
          2021.0,
          2020.0,
          2019.0
        ],
        "field_uniqueness_percent": 3.35
      },
      "year_of_diagnosis": {
        "field_data_type": "int64",
        "field_description": "The \"year_of_diagnosis\" column in the \"main\" table is an integer field that represents the year in which a diagnosis was made for a particular case or patient. The sample values indicate that diagnoses were recorded for the years 2016 and 2017, with these years being the only unique values present in the dataset. The uniqueness percentage of 1.12 suggests that this column has a low level of variability, indicating that most entries likely correspond to these two years. This field is essential for analyzing trends in diagnoses over time.",
        "field_sample_values": [
          2016,
          2017
        ],
        "field_unique_values": [
          2016,
          2017
        ],
        "field_uniqueness_percent": 1.12
      },
      "years_smoked": {
        "field_data_type": "float64",
        "field_description": "The column \"years_smoked\" in the \"main\" table likely represents the number of years an individual has been smoking. The data type is float64, indicating that the values can include decimal points, although the sample values provided are whole numbers. The unique values range from 1.0 to 58.0 years, suggesting that the dataset captures a wide range of smoking experiences among individuals. With a uniqueness percentage of 15.64, it indicates that there are many repeated values, meaning that a significant number of individuals in the dataset have similar smoking durations. Overall, this field provides insight into the smoking history of the individuals recorded in the database.",
        "field_sample_values": [
          44.0,
          16.0,
          26.0,
          22.0,
          41.0
        ],
        "field_unique_values": [
          44.0,
          16.0,
          26.0,
          22.0,
          41.0,
          43.0,
          40.0,
          54.0,
          21.0,
          30.0,
          10.0,
          53.0,
          15.0,
          27.0,
          5.0,
          25.0,
          58.0,
          19.0,
          1.0,
          42.0,
          2.0,
          50.0,
          48.0,
          20.0,
          47.0,
          37.0,
          39.0,
          31.0
        ],
        "field_uniqueness_percent": 15.64
      },
      "created_datetime": {
        "field_data_type": "object",
        "field_description": "The `created_datetime` column in the `main` table likely represents the timestamps indicating when each record was created. The data type is an object, which suggests that the timestamps are stored as strings in a specific format. The sample values show that the timestamps include both date and time, along with a timezone offset (e.g., `-05:00` or `-06:00`), indicating the local time zone of the creation event. The uniqueness percent of 2.23 indicates that there are very few unique timestamps relative to the total number of records, suggesting that many records may have been created around the same time or that the dataset contains a significant number of duplicates.",
        "field_sample_values": [
          "2017-03-23T09:16:24.870222-05:00",
          "2017-08-09T11:56:04.005681-05:00",
          "2017-09-04T10:20:52.321423-05:00",
          "2017-12-20T12:18:42.407753-06:00"
        ],
        "field_unique_values": [
          "2017-03-23T09:16:24.870222-05:00",
          "2017-08-09T11:56:04.005681-05:00",
          "2017-09-04T10:20:52.321423-05:00",
          "2017-12-20T12:18:42.407753-06:00"
        ],
        "field_uniqueness_percent": 2.23
      },
      "demographic.created_datetime": {
        "field_data_type": "object",
        "field_description": "The column `demographic.created_datetime` in the `main` table likely represents the timestamps indicating when a particular demographic record was created. The data type is an object, suggesting that the timestamps are stored as strings in a specific format. The sample values show that the timestamps include both date and time, along with a timezone offset (in this case, -05:00). The uniqueness percent of 2.23 indicates that there are relatively few unique timestamps compared to the total number of records, suggesting that many records may have been created around the same time or that the data may be aggregated over a short period.",
        "field_sample_values": [
          "2017-10-30T14:12:23.237346-05:00",
          "2017-10-30T15:26:16.755531-05:00",
          "2017-11-01T09:34:04.825788-05:00",
          "2018-05-16T14:39:18.135509-05:00"
        ],
        "field_unique_values": [
          "2017-10-30T14:12:23.237346-05:00",
          "2017-10-30T15:26:16.755531-05:00",
          "2017-11-01T09:34:04.825788-05:00",
          "2018-05-16T14:39:18.135509-05:00"
        ],
        "field_uniqueness_percent": 2.23
      },
      "demographic.updated_datetime": {
        "field_data_type": "object",
        "field_description": "The column `demographic.updated_datetime` in the `main` table likely represents the timestamps indicating when demographic information was last updated for each record. The data type is an object, which suggests that the timestamps are stored in a string format, specifically in ISO 8601 format with timezone offsets. The sample values show a range of dates and times, indicating that updates have occurred at various points over the years, from 2019 to 2023. The uniqueness percent of 2.23 suggests that there are very few distinct timestamps relative to the total number of records, indicating that many records may share the same update timestamp.",
        "field_sample_values": [
          "2019-06-24T07:45:49.778902-05:00",
          "2021-09-22T10:50:41.534029-05:00",
          "2021-01-20T10:53:06.295401-06:00",
          "2023-02-03T17:42:19.917554-06:00"
        ],
        "field_unique_values": [
          "2019-06-24T07:45:49.778902-05:00",
          "2021-09-22T10:50:41.534029-05:00",
          "2021-01-20T10:53:06.295401-06:00",
          "2023-02-03T17:42:19.917554-06:00"
        ],
        "field_uniqueness_percent": 2.23
      },
      "diagnoses.created_datetime": {
        "field_data_type": "object",
        "field_description": "The column `diagnoses.created_datetime` in the `main` table likely represents the timestamps when diagnoses were created in the database. The data type is an object, indicating that the values are stored as strings rather than a specific date-time format. The sample values show a standard ISO 8601 format, including the date, time, and time zone offset, which suggests that the timestamps are precise and account for different time zones. With a uniqueness percentage of 1.68, it indicates that there are very few unique timestamps relative to the total number of entries, suggesting that multiple diagnoses may have been created at similar times.",
        "field_sample_values": [
          "2018-05-16T11:42:00.274697-05:00",
          "2018-05-17T14:05:59.588773-05:00",
          "2018-12-03T12:05:16.846188-06:00"
        ],
        "field_unique_values": [
          "2018-05-16T11:42:00.274697-05:00",
          "2018-05-17T14:05:59.588773-05:00",
          "2018-12-03T12:05:16.846188-06:00"
        ],
        "field_uniqueness_percent": 1.68
      },
      "diagnoses.updated_datetime": {
        "field_data_type": "object",
        "field_description": "The column `diagnoses.updated_datetime` in the `main` table likely represents the timestamp indicating when a diagnosis record was last updated. The data type is an object, which suggests that the timestamps are stored in a string format. The sample values show that the timestamps include both date and time, along with a timezone offset (e.g., '-05:00' and '-06:00'). The uniqueness percent of 1.12 indicates that there are very few unique timestamps in this column, suggesting that many records may share the same update time.",
        "field_sample_values": [
          "2021-09-22T14:36:32.037275-05:00",
          "2023-02-03T18:28:48.308091-06:00"
        ],
        "field_unique_values": [
          "2021-09-22T14:36:32.037275-05:00",
          "2023-02-03T18:28:48.308091-06:00"
        ],
        "field_uniqueness_percent": 1.12
      },
      "exposures.created_datetime": {
        "field_data_type": "object",
        "field_description": "The column `exposures.created_datetime` in the `main` table likely represents the timestamps indicating when each exposure record was created. The data type is an object, which suggests that the timestamps are stored as strings in a specific format. The sample values show that the timestamps include both date and time, along with timezone information (e.g., `-06:00` for Central Standard Time and `-05:00` for Eastern Daylight Time). The uniqueness percent of 2.23 indicates that there are relatively few unique timestamps compared to the total number of records, suggesting that multiple exposures may have been created at similar times.",
        "field_sample_values": [
          "2017-11-28T15:53:49.100871-06:00",
          "2017-11-28T16:05:34.174444-06:00",
          "2017-11-28T16:15:59.194252-06:00",
          "2018-05-16T14:49:51.536333-05:00"
        ],
        "field_unique_values": [
          "2017-11-28T15:53:49.100871-06:00",
          "2017-11-28T16:05:34.174444-06:00",
          "2017-11-28T16:15:59.194252-06:00",
          "2018-05-16T14:49:51.536333-05:00"
        ],
        "field_uniqueness_percent": 2.23
      },
      "exposures.updated_datetime": {
        "field_data_type": "object",
        "field_description": "The column `exposures.updated_datetime` in the `main` table likely represents the date and time when a particular exposure record was last updated. The data type is an object, which suggests that the values are stored as strings. The sample value provided, '2023-04-11T15:35:44.432980-05:00', follows the ISO 8601 format, indicating a specific timestamp along with a timezone offset of -05:00 hours from UTC. The uniqueness percent of 0.56 indicates that this field has a relatively low level of unique values, suggesting that many records may share the same updated timestamp.",
        "field_sample_values": [
          "2023-04-11T15:35:44.432980-05:00"
        ],
        "field_unique_values": [
          "2023-04-11T15:35:44.432980-05:00"
        ],
        "field_uniqueness_percent": 0.56
      },
      "index_date": {
        "field_data_type": "object",
        "field_description": "The `index_date` column in the `main` table appears to contain categorical data, specifically related to a diagnosis. Given that the data type is classified as an object and the sample and unique values both indicate 'Diagnosis', it is likely that this field is used to denote a specific diagnosis event or category associated with the records in the table. The uniqueness percentage of 0.56 suggests that this column has a limited number of distinct values, indicating that many records may share the same diagnosis. Overall, this field likely serves as a key identifier for categorizing or grouping data based on diagnosis within the dataset.",
        "field_sample_values": [
          "Diagnosis"
        ],
        "field_unique_values": [
          "Diagnosis"
        ],
        "field_uniqueness_percent": 0.56
      },
      "samples.created_datetime": {
        "field_data_type": "object",
        "field_description": "The column `samples.created_datetime` in the `main` table likely represents the date and time when each sample was created. The data type is an object, indicating that the values are stored as strings in a specific format. The sample values show that the timestamps are in ISO 8601 format, including both the date and time along with the timezone offset. The uniqueness percent of 2.79 suggests that there are many duplicate entries, indicating that multiple samples may have been created at similar times. Overall, this field is essential for tracking the creation time of samples in the database.",
        "field_sample_values": [
          "2017-03-27T15:39:54.199156-05:00",
          "2018-01-03T09:54:28.888915-06:00",
          "2017-08-10T13:53:31.598164-05:00",
          "2017-09-04T10:34:12.411465-05:00",
          "2017-12-20T14:25:16.973728-06:00"
        ],
        "field_unique_values": [
          "2017-03-27T15:39:54.199156-05:00",
          "2018-01-03T09:54:28.888915-06:00",
          "2017-08-10T13:53:31.598164-05:00",
          "2017-09-04T10:34:12.411465-05:00",
          "2017-12-20T14:25:16.973728-06:00"
        ],
        "field_uniqueness_percent": 2.79
      },
      "samples.updated_datetime": {
        "field_data_type": "object",
        "field_description": "The column `samples.updated_datetime` in the `main` table likely represents the date and time when a sample was last updated. The data type is an object, which suggests that the values are stored as strings rather than a specific date-time format. The sample value provided, '2019-06-12T11:47:29.431362-05:00', follows the ISO 8601 format, indicating that it includes both the date and time along with a timezone offset. With a uniqueness percent of 0.56, this column contains a relatively low number of unique values, suggesting that many samples may share the same update timestamp.",
        "field_sample_values": [
          "2019-06-12T11:47:29.431362-05:00"
        ],
        "field_unique_values": [
          "2019-06-12T11:47:29.431362-05:00"
        ],
        "field_uniqueness_percent": 0.56
      },
      "updated_datetime": {
        "field_data_type": "object",
        "field_description": "The `updated_datetime` column in the `main` table likely represents the timestamps indicating when a record was last updated. The data type is an object, which suggests that the timestamps are stored as strings in a specific format. The sample values show that the timestamps include both date and time, along with a timezone offset (in this case, -05:00). The uniqueness percent of 1.12 indicates that there are very few unique timestamps relative to the total number of records, suggesting that many records may have been updated at the same time or that updates occur infrequently.",
        "field_sample_values": [
          "2019-06-12T05:10:16.149101-05:00",
          "2020-05-05T12:02:15.128128-05:00"
        ],
        "field_unique_values": [
          "2019-06-12T05:10:16.149101-05:00",
          "2020-05-05T12:02:15.128128-05:00"
        ],
        "field_uniqueness_percent": 1.12
      },
      "aliquot_id": {
        "field_data_type": "object",
        "field_description": "The `aliquot_id` column in the `main` table likely represents a unique identifier for aliquots, which are portions of a larger sample used for analysis or testing. The values in this column are formatted as UUIDs (Universally Unique Identifiers), indicating that each aliquot is distinctly identified. With 179 unique values and a uniqueness percentage of 100.0, it confirms that each entry in this column is unique, ensuring that no two aliquots share the same identifier. This field is essential for tracking and managing individual aliquots within the database.",
        "field_sample_values": [
          "664fbd43-2053-11e9-b7f8-0a80fada099c",
          "67338432-2053-11e9-b7f8-0a80fada099c",
          "5d7f24a7-2053-11e9-b7f8-0a80fada099c",
          "5e5ff060-2053-11e9-b7f8-0a80fada099c",
          "614e3482-2053-11e9-b7f8-0a80fada099c"
        ],
        "field_unique_values": "179 unique values",
        "field_uniqueness_percent": 100.0
      },
      "aliquot_ids": {
        "field_data_type": "object",
        "field_description": "The `aliquot_ids` column in the `main` table appears to store a list of unique identifiers, specifically UUIDs (Universally Unique Identifiers), associated with aliquots. An aliquot is a portion of a larger whole, often used in laboratory settings to refer to a sample taken from a larger specimen for analysis or testing. \n\nThe data type of this column is an object, indicating that the values are stored as strings representing lists. Each entry in the column consists of a string that contains a list of UUIDs, suggesting that multiple aliquots can be linked to a single record in the `main` table. \n\nWith 107 unique values and a uniqueness percentage of 59.78%, it indicates that while there are several distinct combinations of aliquot IDs, some combinations may repeat across different records. This structure allows for the tracking and management of multiple aliquots related to various samples or experiments within the database.",
        "field_sample_values": [
          "['f0dd0ecd-f01b-455d-b856-adde617f1bd0', '29c227bb-50a4-4d50-8d6f-52bc55219883', '1561b97d-8c8f-4fe6-a244-06452760074d', '02fc9aea-63e7-4918-b494-82ab3ac41599', 'edd4102e-3604-425c-949f-09d2634124cc', '82ccdf4e-4527-47ca-8151-7e1248f1da09', '63327ba1-ba31-4984-81a3-725c0d7b2086']",
          "['67f4ea57-c62f-4e49-9075-fae7415731fd', '5fc376df-4539-47ef-9749-44d36230a941', 'bb01e698-e45a-4db9-a198-a29bb5d08f76', '7a2e2088-9a18-4694-a4ca-f688ebd5331f', '87d459d7-11e8-4472-89ea-80933a608d6d', '7164a927-f35a-48c9-ba0c-e4904b529ee8', 'a80f5793-7cd3-41dd-a968-c42680d1c27e']",
          "['d8e8a430-da69-474a-89a8-d7aa9737898e', 'ae175b52-c84d-415a-99c2-c30182ad6c99', 'f47b3035-cf5e-4905-8859-1459781618fc', '1fd51af9-c67f-4c54-8c8e-db4aef40d5ad', 'e04fbc84-8560-4ddd-9406-81537e5044e3', '5637db92-8716-4190-8c2e-9a32bb099cf6']",
          "['4f432fe5-856b-4678-bd0c-e3170f1bf7d5', '7fb72fd0-9f8d-46d5-bd34-9216e4be58ff', '07135762-40dd-42ed-816f-04d268714d2f', 'e7e7be46-4ae9-4c07-8354-c3c310ea060a', '701cf2a3-3084-49f7-965f-7aa2cdf64d9d', 'fe2247ec-0a0d-4f1a-a807-e6f64f9968fc', '20b0c27a-4b8f-4f02-9e55-1a56bda44624']",
          "['976cd063-2bac-4c3e-a608-6d7af80cca8a', '52937cb2-3c89-467e-9e4e-d8116146ff68', '98367696-9771-4a1d-af62-4e7bbe356ce8', '8a539a4f-eaff-4faa-8f3b-c01b24af7a64', '66a0c38b-0783-488a-946b-85127b719408', '86c228d6-3005-46fd-937d-5a773191167e', '56ba12c1-1516-442e-995f-db584a6ec925', '5d9377d8-5910-4eac-8f92-848d00122c75', 'edc8a006-f1d6-44c5-a097-02792f48391c']"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "aliquot_submitter_id": {
        "field_data_type": "object",
        "field_description": "The column \"aliquot_submitter_id\" in the \"main\" table is likely used to store unique identifiers for aliquots submitted to a laboratory or research facility. Each identifier, such as 'CPT0001540009', represents a distinct aliquot, which is a portion of a larger sample that has been separated for analysis. With 179 unique values and a uniqueness percentage of 100.0, this field ensures that each aliquot can be accurately tracked and referenced without duplication, facilitating effective data management and analysis.",
        "field_sample_values": [
          "CPT0001540009",
          "CPT0001550001",
          "CPT0001220008",
          "CPT0001230001",
          "CPT0001340003"
        ],
        "field_unique_values": "179 unique values",
        "field_uniqueness_percent": 100.0
      },
      "case_id": {
        "field_data_type": "object",
        "field_description": "The `case_id` column in the `main` table appears to represent identifiers for cases, likely in a system that tracks multiple related entities. Each entry in this column consists of one or more UUIDs (Universally Unique Identifiers) separated by commas. This suggests that a single record may be associated with multiple cases or entities, indicating a many-to-one or many-to-many relationship. \n\nWith 107 unique values and a uniqueness percentage of 59.78%, it indicates that some case identifiers are repeated across different records, which may imply that certain cases are linked or referenced multiple times within the dataset. Overall, this column is essential for identifying and managing case-related data within the database.",
        "field_sample_values": [
          "ac4960f0-1fb8-11e9-b7f8-0a80fada099c,52153098-f1b2-47fe-ba4e-88ce6d51a6ca",
          "21b33512-73c8-4d7f-a6ce-a07133b9c1ed,ade302cd-1fb8-11e9-b7f8-0a80fada099c",
          "b69c9d3a-4691-4073-be53-c1bc43248fdd,af7c2225-1fb8-11e9-b7f8-0a80fada099c",
          "b118086f-1fb8-11e9-b7f8-0a80fada099c,3866385e-13e2-4372-8201-287df9f58e5e",
          "929e18d5-41fa-4ee2-957f-2812e4501b93,b2aeaffe-1fb8-11e9-b7f8-0a80fada099c"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "case_submitter_id": {
        "field_data_type": "object",
        "field_description": "The column \"case_submitter_id\" in the \"main\" table appears to represent unique identifiers assigned to individuals or entities that submit cases within a system. The identifiers follow a consistent format, likely indicating a structured coding system (e.g., \"C3L-00004\"). With 107 unique values and a uniqueness percentage of 59.78%, it suggests that multiple submissions may be associated with some submitters, while others are unique. This field is essential for tracking and managing case submissions effectively.",
        "field_sample_values": [
          "C3L-00004",
          "C3L-00010",
          "C3L-00011",
          "C3L-00026",
          "C3L-00079"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "comorbidity": {
        "field_data_type": "object",
        "field_description": "The \"comorbidity\" column in the \"main\" table likely represents various medical conditions or diseases that a patient may have in addition to a primary diagnosis. The data type is an object, indicating that the values are stored as strings. Sample values include common health issues such as Cataracts, Colon Polyps, Hypothyroidism, Hypertension, and Gout. The column contains a total of 9 unique values, suggesting a diverse range of comorbid conditions that patients may experience. The uniqueness percent of 5.59 indicates that these conditions are not highly unique among the dataset, implying that many patients may share similar comorbidities. Overall, this field is important for understanding the health complexities of patients and may be used in clinical assessments or research studies.",
        "field_sample_values": [
          "Cataracts",
          "Colon Polyps",
          "Hypothyroidism",
          "Hypertension",
          "Gout"
        ],
        "field_unique_values": [
          "Cataracts",
          "Colon Polyps",
          "Hypothyroidism",
          "Hypertension",
          "Gout",
          "Arthritis",
          "Asthma",
          "Crohn's Disease",
          "Congestive Heart Failure (CHF)",
          "Psoriasis"
        ],
        "field_uniqueness_percent": 5.59
      },
      "demographic.submitter_id": {
        "field_data_type": "object",
        "field_description": "The column `demographic.submitter_id` in the `main` table appears to represent unique identifiers for submitters in a demographic dataset. The values are formatted as alphanumeric strings, typically following a pattern that includes a prefix (likely indicating a category or type), a numeric sequence, and a suffix (in this case, \"-DEMO\"). With 107 unique values and a uniqueness percentage of 59.78%, it suggests that while there are multiple submitters, some may have submitted multiple entries. This field is likely used to track and differentiate between various submitters within the dataset.",
        "field_sample_values": [
          "C3L-00004-DEMO",
          "C3L-00010-DEMO",
          "C3L-00011-DEMO",
          "C3L-00026-DEMO",
          "C3L-00079-DEMO"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "demographic_id": {
        "field_data_type": "object",
        "field_description": "The `demographic_id` column in the `main` table appears to store identifiers related to demographic data. The data type is classified as an object, indicating that the values are likely strings. Each entry consists of one or more UUIDs (Universally Unique Identifiers) separated by commas, which suggests that this field may be used to associate multiple demographic records or categories with a single entry in the table.\n\nWith 107 unique values and a uniqueness percentage of 59.78%, it indicates that while there are a significant number of distinct identifiers, many entries share common demographic IDs. This could imply that certain demographic groups or categories are represented multiple times across different records in the database.\n\nOverall, the `demographic_id` field likely serves to link various demographic attributes or classifications to the corresponding records in the `main` table, facilitating the analysis of demographic-related information.",
        "field_sample_values": [
          "0e078a68-2b4d-4ac7-8f57-8b602055ebf4,0e283b56-2c37-11ec-b712-0a4e2186f121",
          "0e369774-2c37-11ec-b712-0a4e2186f121,cde8d361-0bad-4728-931b-f1fa75979a11",
          "0e461f39-2c37-11ec-b712-0a4e2186f121,ad4e676d-1ccf-4f6e-9519-229c998db7ae",
          "ba9e041a-5d08-4be8-853d-9f7423f25feb,0e5513f3-2c37-11ec-b712-0a4e2186f121",
          "11441f68-d6c8-4391-8171-4a9a9ae1180f,0e5bcbc0-2c37-11ec-b712-0a4e2186f121"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "demographic_submitter_id": {
        "field_data_type": "object",
        "field_description": "The `demographic_submitter_id` column in the `main` table likely represents a unique identifier assigned to individuals or entities that submit demographic information. The values appear to follow a specific format, which includes a prefix (C3L), a numeric sequence, and a suffix (DM), suggesting a structured coding system. With 107 unique values out of a total number of entries, this column has a uniqueness percentage of approximately 59.78%, indicating that some submitters may have multiple entries. This field is essential for tracking and managing demographic submissions within the database.",
        "field_sample_values": [
          "C3L-00004-DM",
          "C3L-00010-DM",
          "C3L-00011-DM",
          "C3L-00026-DM",
          "C3L-00079-DM"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "diagnosis_id": {
        "field_data_type": "object",
        "field_description": "The `diagnosis_id` column in the `main` table likely represents unique identifiers for specific diagnoses recorded in the database. Each identifier is formatted as a UUID (Universally Unique Identifier), which ensures that each diagnosis can be distinctly referenced. With 107 unique values out of a total number of entries, this column exhibits a uniqueness percentage of approximately 59.78%, indicating that some diagnoses may be associated with multiple records. This field is essential for tracking and managing different diagnoses within the dataset.",
        "field_sample_values": [
          "4dd613ea-2c37-11ec-b712-0a4e2186f121",
          "4ddef7bb-2c37-11ec-b712-0a4e2186f121",
          "4de5a2f0-2c37-11ec-b712-0a4e2186f121",
          "4dee3ea9-2c37-11ec-b712-0a4e2186f121",
          "4dfd8002-2c37-11ec-b712-0a4e2186f121"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "diagnosis_ids": {
        "field_data_type": "object",
        "field_description": "The `diagnosis_ids` column in the `main` table appears to store identifiers for medical diagnoses. Each entry in this column is represented as a string that contains a list of UUIDs (Universally Unique Identifiers), which are commonly used to uniquely identify specific diagnoses in a healthcare context. The sample values indicate that each entry is formatted as a string representation of a list, suggesting that multiple diagnosis IDs may be associated with a single record. With 107 unique values and a uniqueness percentage of 59.78, it indicates that while there are several distinct diagnosis IDs, many records share the same IDs, reflecting common diagnoses across different entries.",
        "field_sample_values": [
          "['5f42c473-03d8-40bd-8075-934e06be88de']",
          "['c11c762d-ae40-4c13-87cd-a896f919b083']",
          "['f1261264-83c3-4a41-a0de-e1d5c47cd2c8']",
          "['9051cfdd-daad-4317-9b10-1bc62b15bc1b']",
          "['4b80be5a-280b-48a7-bbe1-a9533e219532']"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "diagnosis_submitter_id": {
        "field_data_type": "object",
        "field_description": "The column \"diagnosis_submitter_id\" in the \"main\" table appears to represent unique identifiers assigned to entities or individuals who submit diagnoses. The sample values, such as 'C3L-00004-DX' and 'C3L-00010-DX', suggest a structured format that likely includes a prefix indicating the type of submission or the source, followed by a numerical identifier and a suffix ('-DX') that may denote the nature of the diagnosis. With 107 unique values and a uniqueness percentage of 59.78%, this field indicates that while there are multiple submitters, some submitters may have submitted multiple diagnoses. Overall, this column is essential for tracking and identifying the sources of diagnosis submissions within the database.",
        "field_sample_values": [
          "C3L-00004-DX",
          "C3L-00010-DX",
          "C3L-00011-DX",
          "C3L-00026-DX",
          "C3L-00079-DX"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "exposure_id": {
        "field_data_type": "object",
        "field_description": "The `exposure_id` column in the `main` table is designed to store identifiers related to specific exposures, likely in a context such as clinical trials, experiments, or data collection scenarios. Each entry in this column contains a string of comma-separated UUIDs (Universally Unique Identifiers), suggesting that it may represent multiple related exposures or events associated with a single record. \n\nWith 107 unique values and a uniqueness percentage of 59.78%, it indicates that while there are several distinct exposure combinations, many records share similar exposure identifiers. This could imply a commonality in the exposures being tracked or a grouping of related events. Overall, the `exposure_id` field serves as a key reference point for linking records to their respective exposures in the database.",
        "field_sample_values": [
          "8c6ce224-1fcb-4d45-a33a-4c6ecced3a9f,198f32af-2c37-11ec-b712-0a4e2186f121",
          "44b2f4e0-9492-46de-af6a-8133883ce9cd,19973da4-2c37-11ec-b712-0a4e2186f121",
          "35f43eba-92c3-493a-869c-042132ac2b04,199edf76-2c37-11ec-b712-0a4e2186f121",
          "19a84237-2c37-11ec-b712-0a4e2186f121,65777134-4a45-4cd3-938b-f1fc92b74e72",
          "e77759df-c87d-4256-aa79-e19673d14479,19aec7ac-2c37-11ec-b712-0a4e2186f121"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "exposure_submitter_id": {
        "field_data_type": "object",
        "field_description": "The column \"exposure_submitter_id\" in the \"main\" table is likely used to identify the submitters of exposure data within the database. The values in this column appear to follow a specific format, consisting of a prefix (C3L), a numeric identifier, and a suffix (EX), which suggests that these IDs are systematically generated for each submitter. With 107 unique values and a uniqueness percentage of 59.78%, it indicates that some submitters may have multiple entries in the database, while others are represented only once. This field is essential for tracking and managing exposure submissions, ensuring that each submitter can be uniquely identified.",
        "field_sample_values": [
          "C3L-00004-EX",
          "C3L-00010-EX",
          "C3L-00011-EX",
          "C3L-00026-EX",
          "C3L-00079-EX"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "exposures.submitter_id": {
        "field_data_type": "object",
        "field_description": "The column `exposures.submitter_id` in the `main` table appears to represent unique identifiers for submitters associated with exposure records. The identifiers follow a consistent format, typically consisting of a prefix (C3L), a numeric code, and a suffix (EXP), indicating that they are likely generated codes used to track submissions in a systematic manner. With 107 unique values and a uniqueness percentage of 59.78%, it suggests that some submitters may have multiple submissions recorded in the database. This field is essential for identifying and differentiating between various submitters in the context of exposure data.",
        "field_sample_values": [
          "C3L-00004-EXP",
          "C3L-00010-EXP",
          "C3L-00011-EXP",
          "C3L-00026-EXP",
          "C3L-00079-EXP"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "follow_up_id": {
        "field_data_type": "object",
        "field_description": "The `follow_up_id` column in the `main` table likely represents a unique identifier for follow-up records or actions associated with a particular entity or process. The values in this column are formatted as UUIDs (Universally Unique Identifiers), which are commonly used to ensure uniqueness across different records. With 51 unique values out of a total number of entries, this column has a uniqueness percentage of 28.49%, indicating that many records may share the same follow-up identifier. This suggests that multiple entries could be linked to the same follow-up action or event, which is typical in scenarios where follow-ups are conducted for various cases, customers, or tasks.",
        "field_sample_values": [
          "b7c6f6c9-40f6-4ec2-b769-0820c043f5cc",
          "97c3fe8c-8627-483d-ae24-02b715f2e1d6",
          "d88c5142-88f0-43df-b14b-979a2daedfe5",
          "525353f6-5414-4962-bb9a-beeb8ced2777",
          "45127493-a19b-426e-95ee-26f783c001a7"
        ],
        "field_unique_values": "51 unique values",
        "field_uniqueness_percent": 28.49
      },
      "follow_up_submitter_id": {
        "field_data_type": "object",
        "field_description": "The column \"follow_up_submitter_id\" in the \"main\" table appears to represent unique identifiers for individuals or entities responsible for submitting follow-up information. The identifiers are formatted as alphanumeric strings, such as 'C3L-00004-FL', which likely indicate a structured coding system. With 51 unique values and a uniqueness percentage of 28.49%, this suggests that multiple records may be associated with the same submitter, indicating that some submitters are responsible for multiple follow-ups. This field is essential for tracking and managing follow-up submissions within the database.",
        "field_sample_values": [
          "C3L-00004-FL",
          "C3L-00010-FL",
          "C3L-00011-FL",
          "C3L-00026-FL",
          "C3L-00079-FL"
        ],
        "field_unique_values": "51 unique values",
        "field_uniqueness_percent": 28.49
      },
      "residual_disease": {
        "field_data_type": "object",
        "field_description": "The column \"residual_disease\" in the \"main\" table is likely used to indicate the status of residual disease in patients, possibly in a medical or clinical context. The sample values suggest three distinct categories: 'R1' may represent the presence of residual disease, 'R0' may indicate no residual disease, and 'RX' could signify an unknown or indeterminate status. With a low uniqueness percentage of 1.68, it appears that the majority of entries in this column are not unique, suggesting that many patients share the same residual disease status.",
        "field_sample_values": [
          "R1",
          "R0",
          "RX"
        ],
        "field_unique_values": [
          "R1",
          "R0",
          "RX"
        ],
        "field_uniqueness_percent": 1.68
      },
      "kw_column": {
        "field_data_type": "object",
        "field_description": "The `kw_column` in the `main` table is an object data type that appears to store unique identifiers in the form of UUIDs (Universally Unique Identifiers). Each value in this column is a 36-character string formatted as a hexadecimal representation, which is commonly used to uniquely identify records across databases. With 179 unique values and a uniqueness percentage of 100.0, it indicates that each entry in this column is distinct, suggesting that it may be used to reference specific entities or records within the system, ensuring that there are no duplicates.",
        "field_sample_values": [
          "6240511e-204c-11e9-b7f8-0a80fada099c",
          "63fb3588-204c-11e9-b7f8-0a80fada099c",
          "65eefbda-204c-11e9-b7f8-0a80fada099c",
          "688b503e-204c-11e9-b7f8-0a80fada099c",
          "6a3e4388-204c-11e9-b7f8-0a80fada099c"
        ],
        "field_unique_values": "179 unique values",
        "field_uniqueness_percent": 100.0
      },
      "sample_type_id": {
        "field_data_type": "float64",
        "field_description": "The column \"sample_type_id\" in the \"main\" table is of type float64 and appears to represent a unique identifier for different types of samples. Given that the sample values consist of a single entry, 11.0, and that this value is unique within the dataset, it suggests that this column is used to categorize or differentiate between various sample types. The uniqueness percentage of 0.56 indicates that this column may not be highly diverse in terms of the number of different sample types represented, which could imply that the dataset is focused on a limited range of sample categories.",
        "field_sample_values": [
          11.0
        ],
        "field_unique_values": [
          11.0
        ],
        "field_uniqueness_percent": 0.56
      },
      "slide_ids": {
        "field_data_type": "object",
        "field_description": "The `slide_ids` column in the `main` table appears to store lists of unique identifiers for slides, likely used in a presentation or document context. Each entry in this column is represented as a string that contains a list of UUIDs (Universally Unique Identifiers), which are formatted as strings within square brackets. The sample values indicate that each entry can contain multiple slide IDs, suggesting that the column may be used to associate multiple slides with a particular record in the database. With 107 unique values and a uniqueness percentage of 59.78%, it indicates that while there are several distinct combinations of slide IDs, some combinations are repeated across different records.",
        "field_sample_values": [
          "['acbb41d0-30e7-48cb-939e-b7f5520af26a', '7ba78c3e-aa75-4b99-a191-b3dcbbf2d2bb']",
          "['32f6c4d5-c516-431b-878b-7abb25489d0d', 'd804087b-21a7-4aff-b4c4-be24c59def69']",
          "['1a1f8640-824d-4c0c-8ab7-3bf7e9e502d0', '9ee7d0f2-362d-41b0-9cb4-125c94929768']",
          "['ceadb27c-fe61-4169-a656-c4dfafd76902', '8800c6af-8d14-4f62-b9b7-f64a0ce1b80e']",
          "['77bc17c7-8709-4c58-a7de-55188a019b89', '748fe1ac-9844-4044-b96e-dc00c5082bd9']"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "submitter_aliquot_ids": {
        "field_data_type": "object",
        "field_description": "The column \"submitter_aliquot_ids\" in the \"main\" table appears to store a list of unique identifiers for aliquots submitted by various users or entities. Each entry in this column is formatted as a string representation of a list, containing multiple identifiers that follow a consistent pattern (e.g., \"CPT0001540165\"). The sample values suggest that these identifiers are likely related to biological samples or specimens, possibly in a clinical or research context. With 107 unique values and a uniqueness percentage of approximately 59.78%, it indicates that while there is a variety of submitter aliquot IDs, some IDs may be repeated across different records. This field is essential for tracking and managing the specific aliquots associated with submissions in the database.",
        "field_sample_values": [
          "['CPT0001540165', 'CPT0001550013', 'CPT0001550006', 'CPT0000140163', 'CPT0001540164', 'CPT0001550009', 'CPT0001540013']",
          "['CPT0001230014', 'CPT0001220165', 'CPT0001230009', 'CPT0001220012', 'CPT0001230006', 'CPT0001220164', 'CPT0000060163']",
          "['CPT0001350009', 'CPT0001350006', 'CPT0001340005', 'CPT0000090163', 'CPT0001350014', 'CPT0001340164']",
          "['CPT0001500003', 'CPT0001500005', 'CPT0001510014', 'CPT0000130163', 'CPT0001510009', 'CPT0001510006', 'CPT0001500164']",
          "['CPT0001270014', 'CPT0001270009', 'CPT0001270002', 'CPT0001270006', 'CPT0001260005', 'CPT0001260013', 'CPT0001260014', 'CPT0001260164', 'CPT0000070163']"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "submitter_diagnosis_ids": {
        "field_data_type": "object",
        "field_description": "The `submitter_diagnosis_ids` column in the `main` table appears to store identifiers related to diagnoses submitted by users or entities. Each entry is represented as a string that contains a list format, suggesting that the values are likely intended to represent a single diagnosis ID enclosed within square brackets and quotes. The sample values indicate that these IDs follow a specific format, such as \"C3L-00004-DIAG\", which may correspond to a coding system for medical diagnoses. With 107 unique values and a uniqueness percentage of 59.78, it suggests that while there are multiple distinct diagnosis IDs, some IDs may be repeated across different records. This column is likely used to track or reference specific diagnoses associated with submissions in the database.",
        "field_sample_values": [
          "['C3L-00004-DIAG']",
          "['C3L-00010-DIAG']",
          "['C3L-00011-DIAG']",
          "['C3L-00026-DIAG']",
          "['C3L-00079-DIAG']"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "submitter_id": {
        "field_data_type": "object",
        "field_description": "The `submitter_id` column in the `main` table likely represents a unique identifier assigned to individuals or entities that submit data or records within the database. The values are formatted as alphanumeric strings, such as 'C3L-00004', indicating a structured coding system. With 107 unique values and a uniqueness percentage of 59.78%, it suggests that while there are multiple submitters, some may have submitted multiple records. This column is essential for tracking submissions and associating them with their respective submitters.",
        "field_sample_values": [
          "C3L-00004",
          "C3L-00010",
          "C3L-00011",
          "C3L-00026",
          "C3L-00079"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "submitter_slide_ids": {
        "field_data_type": "object",
        "field_description": "The `submitter_slide_ids` column in the `main` table appears to store a list of identifiers associated with slides submitted by users or contributors. Each entry in this column is formatted as a string representation of a list, containing multiple slide IDs that follow a specific pattern (e.g., 'C3L-00004-26', 'C3L-00004-21'). The presence of 107 unique values indicates that there are various combinations of slide IDs submitted, with a uniqueness percentage of approximately 59.78%, suggesting that some combinations may be repeated across different records. This column likely serves to track and organize the slide submissions for further analysis or processing.",
        "field_sample_values": [
          "['C3L-00004-26', 'C3L-00004-21']",
          "['C3L-00010-26', 'C3L-00010-21']",
          "['C3L-00011-26', 'C3L-00011-21']",
          "['C3L-00026-21', 'C3L-00026-26']",
          "['C3L-00079-21', 'C3L-00079-26']"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "aliquots.aliquot_run_metadata": {
        "field_data_type": "object",
        "field_description": "The column `aliquots.aliquot_run_metadata` in the `main` table appears to store metadata related to aliquot runs in a structured format. Each entry in this column is an object that contains a list of dictionaries, where each dictionary represents an aliquot run with a unique identifier (`aliquot_run_metadata_id`). The sample values indicate that multiple aliquot run metadata entries can be associated with a single record, suggesting that this field is used to track various aliquot runs linked to a specific sample or experiment. With 179 unique values and a uniqueness percentage of 100.0, it indicates that each entry in this column is distinct, reflecting a diverse set of aliquot run metadata across the dataset.",
        "field_sample_values": [
          "[{'aliquot_run_metadata_id': '6f93b57d-99d0-4dd1-8dab-00b4d62bc890'}, {'aliquot_run_metadata_id': '733c8b73-c25a-46f2-bf97-7279eff72290'}, {'aliquot_run_metadata_id': 'b0e73ca9-207b-11e9-b7f8-0a80fada099c'}, {'aliquot_run_metadata_id': 'd4a47ef4-207b-11e9-b7f8-0a80fada099c'}]",
          "[{'aliquot_run_metadata_id': '23e705bd-207b-11e9-b7f8-0a80fada099c'}, {'aliquot_run_metadata_id': '47b1aae9-207b-11e9-b7f8-0a80fada099c'}, {'aliquot_run_metadata_id': '5c7550e1-dd13-4061-9d3a-35dde8231905'}, {'aliquot_run_metadata_id': '73904c6a-8cf3-4a72-8273-19bf90339563'}]",
          "[{'aliquot_run_metadata_id': '31fffb0f-cc21-438c-ad25-4c16cd185c1a'}, {'aliquot_run_metadata_id': '4592c526-efc7-48a4-a25e-cf1fd0b0a9bc'}, {'aliquot_run_metadata_id': 'cda89d0a-207c-11e9-b7f8-0a80fada099c'}, {'aliquot_run_metadata_id': 'f0fc203f-207c-11e9-b7f8-0a80fada099c'}]",
          "[{'aliquot_run_metadata_id': '3b425050-b08e-4822-8d02-fbc3b3f8e2bc'}, {'aliquot_run_metadata_id': '8b3ca5db-1a23-4539-8374-e7a1f152dab2'}, {'aliquot_run_metadata_id': 'ab80b3a9-207b-11e9-b7f8-0a80fada099c'}, {'aliquot_run_metadata_id': 'cf613331-207b-11e9-b7f8-0a80fada099c'}]",
          "[{'aliquot_run_metadata_id': '2af65ebd-207b-11e9-b7f8-0a80fada099c'}, {'aliquot_run_metadata_id': '4e5d7b97-207b-11e9-b7f8-0a80fada099c'}, {'aliquot_run_metadata_id': '89235fe4-65b8-48f4-a4ca-720ad02f3378'}, {'aliquot_run_metadata_id': 'f8d009e9-f259-4559-a7e0-5de29d6b3dd0'}]"
        ],
        "field_unique_values": "179 unique values",
        "field_uniqueness_percent": 100.0
      },
      "aliquots.analyte_type": {
        "field_data_type": "object",
        "field_description": "The column `aliquots.analyte_type` in the `main` table is designed to categorize the type of analyte present in a sample. Given that the data type is an object and the sample values consist solely of 'Protein', it is likely that this field is used to specify the type of biological substance being analyzed, with a focus on proteins in this instance. The uniqueness percent of 0.56 indicates that there is limited variation in the values stored in this column, suggesting that most entries are likely to be classified under the same analyte type, which is 'Protein'.",
        "field_sample_values": [
          "Protein"
        ],
        "field_unique_values": [
          "Protein"
        ],
        "field_uniqueness_percent": 0.56
      },
      "externalReferences": {
        "field_data_type": "object",
        "field_description": "The `externalReferences` column in the `main` table is designed to store a collection of external reference information related to various entities. Each entry in this column is an object that contains multiple references, each represented as a dictionary. These dictionaries include the following key attributes:\n\n- `external_reference_id`: A unique identifier for the external reference.\n- `reference_entity_location`: A URL pointing to the specific resource or entity associated with the reference.\n- `reference_resource_name`: The full name of the resource where the reference is found.\n- `reference_resource_shortname`: A shorter name or abbreviation for the resource.\n\nThe sample values indicate that the references primarily relate to cancer research resources, such as the Genomic Data Commons and The Cancer Imaging Archive. With 107 unique values and a uniqueness percentage of 59.78%, this column likely serves as a means to link data entries to relevant external resources, facilitating access to additional information and context for users.",
        "field_sample_values": [
          "[{'external_reference_id': '52153098-f1b2-47fe-ba4e-88ce6d51a6ca', 'reference_entity_location': 'https://portal.gdc.cancer.gov/cases/52153098-f1b2-47fe-ba4e-88ce6d51a6ca', 'reference_resource_name': 'Genomic Data Commons', 'reference_resource_shortname': 'GDC'}, {'external_reference_id': 'CPTAC-CCRCC', 'reference_entity_location': 'https://doi.org/10.7937/K9/TCIA.2018.OBLAMN27', 'reference_resource_name': 'The Cancer Imaging Archive', 'reference_resource_shortname': 'TCIA'}]",
          "[{'external_reference_id': '21b33512-73c8-4d7f-a6ce-a07133b9c1ed', 'reference_entity_location': 'https://portal.gdc.cancer.gov/cases/21b33512-73c8-4d7f-a6ce-a07133b9c1ed', 'reference_resource_name': 'Genomic Data Commons', 'reference_resource_shortname': 'GDC'}, {'external_reference_id': 'CPTAC-CCRCC', 'reference_entity_location': 'https://doi.org/10.7937/K9/TCIA.2018.OBLAMN27', 'reference_resource_name': 'The Cancer Imaging Archive', 'reference_resource_shortname': 'TCIA'}]",
          "[{'external_reference_id': 'b69c9d3a-4691-4073-be53-c1bc43248fdd', 'reference_entity_location': 'https://portal.gdc.cancer.gov/cases/b69c9d3a-4691-4073-be53-c1bc43248fdd', 'reference_resource_name': 'Genomic Data Commons', 'reference_resource_shortname': 'GDC'}, {'external_reference_id': 'CPTAC-CCRCC', 'reference_entity_location': 'https://doi.org/10.7937/K9/TCIA.2018.OBLAMN27', 'reference_resource_name': 'The Cancer Imaging Archive', 'reference_resource_shortname': 'TCIA'}]",
          "[{'external_reference_id': '3866385e-13e2-4372-8201-287df9f58e5e', 'reference_entity_location': 'https://portal.gdc.cancer.gov/cases/3866385e-13e2-4372-8201-287df9f58e5e', 'reference_resource_name': 'Genomic Data Commons', 'reference_resource_shortname': 'GDC'}, {'external_reference_id': 'CPTAC-CCRCC', 'reference_entity_location': 'https://doi.org/10.7937/K9/TCIA.2018.OBLAMN27', 'reference_resource_name': 'The Cancer Imaging Archive', 'reference_resource_shortname': 'TCIA'}]",
          "[{'external_reference_id': '929e18d5-41fa-4ee2-957f-2812e4501b93', 'reference_entity_location': 'https://portal.gdc.cancer.gov/cases/929e18d5-41fa-4ee2-957f-2812e4501b93', 'reference_resource_name': 'Genomic Data Commons', 'reference_resource_shortname': 'GDC'}, {'external_reference_id': 'CPTAC-CCRCC', 'reference_entity_location': 'https://doi.org/10.7937/K9/TCIA.2018.OBLAMN27', 'reference_resource_name': 'The Cancer Imaging Archive', 'reference_resource_shortname': 'TCIA'}]"
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 59.78
      },
      "OS_event": {
        "field_data_type": "object",
        "field_description": "The `OS_event` column in the `main` table is designed to capture the status of an operating system event. It is represented as an object data type, which allows for a variety of string values. The sample values include '1', '0', and 'none', indicating that the column likely reflects a binary state or a specific condition related to the event. \n\n- The value '1' may signify that an event has occurred or is active.\n- The value '0' may indicate that no event has occurred or that it is inactive.\n- The value 'none' suggests that there is no applicable event status to report.\n\nWith only three unique values and a uniqueness percentage of 1.68, this column is likely used to categorize or flag events in a straightforward manner, making it easy to filter or analyze the presence or absence of specific operating system events within the dataset.",
        "field_sample_values": [
          "1",
          "0",
          "none"
        ],
        "field_unique_values": [
          "1",
          "0",
          "none"
        ],
        "field_uniqueness_percent": 1.68
      },
      "OS_time": {
        "field_data_type": "object",
        "field_description": "The column \"OS_time\" in the \"main\" table appears to represent a measurement of time, likely in milliseconds or another unit, associated with operating system processes or events. The data type is classified as an object, indicating that the values are stored as strings rather than numeric types. The sample values, which include '384', '896', '241', '1769', and '274', suggest that the times recorded can vary significantly. With 95 unique values and a uniqueness percentage of 53.07%, this column contains a moderate level of diversity in its entries, indicating that while some values may repeat, there is still a considerable range of different time measurements captured.",
        "field_sample_values": [
          "384",
          "896",
          "241",
          "1769",
          "274"
        ],
        "field_unique_values": "95 unique values",
        "field_uniqueness_percent": 53.07
      }
    }
  },
  "Donor": {
    "table_description": "The Donor table contains demographic and health-related information about individuals participating in a study. It includes data on patient identifiers, physical measurements (such as BMI, height, and weight), year of birth, gender, comorbidities, ethnicity, race, and associated study identifiers.",
    "fields": {
      "curated_patient_id": {
        "field_data_type": "object",
        "field_description": "The `curated_patient_id` column in the Donor table likely represents a unique identifier assigned to each patient in a curated dataset. The identifiers follow a specific format, such as 'C3L-00004', which suggests a structured naming convention. With 160 unique values and a uniqueness percentage of 100.0, each entry in this column is distinct, indicating that it is used to uniquely identify individual patients without any duplicates. This field is essential for tracking and managing patient-related data within the database.",
        "field_sample_values": [
          "C3L-00004",
          "C3L-00010",
          "C3L-00011",
          "C3L-00026",
          "C3L-00079"
        ],
        "field_unique_values": "160 unique values",
        "field_uniqueness_percent": 100.0
      },
      "bmi": {
        "field_data_type": "float64",
        "field_description": "The \"bmi\" column in the \"Donor\" table represents the Body Mass Index (BMI) of individuals who are donors. BMI is a numerical value derived from an individual's weight and height, and it is commonly used to assess whether a person has a healthy body weight for their height. The values in this column are of type float64, indicating that they can include decimal points for greater precision. \n\nThe sample values provided, such as 22.8 and 34.15, suggest a range of BMI measurements, which can indicate various weight categories, from underweight to obesity. The uniqueness percent of 30.63 indicates that approximately one-third of the BMI values are unique, suggesting a diverse range of BMI measurements among the donors. Overall, this field is likely used for health assessments or research related to donor eligibility and health status.",
        "field_sample_values": [
          22.8,
          34.15,
          27.47,
          28.23,
          37.88
        ],
        "field_unique_values": [
          22.8,
          34.15,
          27.47,
          28.23,
          37.88,
          32.82,
          27.44,
          36.81,
          28.7,
          42.92,
          38.94,
          27.35,
          32.0,
          59.88,
          36.57,
          26.18,
          33.66,
          37.72,
          42.33,
          37.96,
          40.74,
          21.96,
          68.59,
          38.99,
          29.49,
          29.6,
          30.81,
          35.66,
          29.01,
          27.04,
          19.49,
          30.56,
          33.96,
          19.72,
          47.25,
          27.85,
          36.36,
          45.37,
          34.76,
          30.86,
          46.17,
          25.31,
          39.45,
          36.0,
          29.38,
          48.46,
          38.08,
          42.77,
          27.52
        ],
        "field_uniqueness_percent": 30.63
      },
      "height_in_cm": {
        "field_data_type": "float64",
        "field_description": "The column \"height_in_cm\" in the \"Donor\" table represents the height of donors measured in centimeters. The data type is float64, indicating that the values can include decimal points for more precise measurements. Sample values show a range of heights, with the unique values indicating a diverse set of heights among the donors. The uniqueness percent of 20.0 suggests that there is a significant amount of repeated height measurements, indicating that many donors may share similar heights. Overall, this field is likely used to capture and analyze the physical characteristics of donors for various purposes, such as health assessments or demographic studies.",
        "field_sample_values": [
          170.0,
          177.0,
          180.0,
          163.0,
          175.0
        ],
        "field_unique_values": [
          170.0,
          177.0,
          180.0,
          163.0,
          175.0,
          178.0,
          185.0,
          175.2,
          165.1,
          175.26,
          168.0,
          185.4,
          162.0,
          157.5,
          171.45,
          160.02,
          156.21,
          170.18,
          172.72,
          187.96,
          176.53,
          180.34,
          163.83,
          177.8,
          177.98,
          152.0,
          185.42,
          167.64,
          160.0,
          165.0,
          157.48,
          173.0
        ],
        "field_uniqueness_percent": 20.0
      },
      "weight_in_kg": {
        "field_data_type": "float64",
        "field_description": "The column \"weight_in_kg\" in the \"Donor\" table represents the weight of donors measured in kilograms. The data type is float64, indicating that the values can include decimal points for precision. Sample values such as 65.9, 107.0, and 89.0 illustrate the range of weights recorded. The column contains a variety of unique weight entries, with a uniqueness percentage of 29.38%, suggesting that many donors share similar weights. This field is likely used for health assessments, eligibility criteria for donation, or statistical analysis related to donor characteristics.",
        "field_sample_values": [
          65.9,
          107.0,
          89.0,
          75.0,
          116.0
        ],
        "field_unique_values": [
          65.9,
          107.0,
          89.0,
          75.0,
          116.0,
          104.0,
          93.9,
          113.0,
          93.0,
          117.0,
          122.0,
          84.0,
          98.0,
          169.0,
          118.5,
          90.0,
          94.0,
          95.0,
          99.0,
          105.0,
          111.58,
          104.33,
          56.25,
          167.38,
          112.94,
          88.0,
          85.73,
          108.86,
          111.13,
          94.35,
          72.57,
          59.87,
          96.62,
          57.0,
          149.69,
          74.0,
          156.0,
          97.7,
          100.0,
          158.0,
          80.0,
          101.0,
          158.76,
          120.2,
          97.52,
          128.0,
          87.0
        ],
        "field_uniqueness_percent": 29.38
      },
      "year_of_birth": {
        "field_data_type": "float64",
        "field_description": "The \"year_of_birth\" column in the \"Donor\" table likely represents the birth years of individuals who are donors. The data type is float64, indicating that the values are stored as floating-point numbers, which in this case represent years (e.g., 1943.0, 1986.0). The sample values show a range of birth years, suggesting that the donors span multiple generations. With a uniqueness percentage of 26.88, it indicates that there are a limited number of distinct birth years among the donors, implying that many donors share the same birth year. This field is essential for understanding the demographic distribution of the donor population.",
        "field_sample_values": [
          1943.0,
          1986.0,
          1952.0,
          1950.0,
          1967.0
        ],
        "field_unique_values": [
          1943.0,
          1986.0,
          1952.0,
          1950.0,
          1967.0,
          1963.0,
          1957.0,
          1960.0,
          1944.0,
          1926.0,
          1954.0,
          1959.0,
          1981.0,
          1966.0,
          1964.0,
          1961.0,
          1941.0,
          1955.0,
          1972.0,
          1940.0,
          1949.0,
          1975.0,
          1942.0,
          1933.0,
          1936.0,
          1947.0,
          1956.0,
          1978.0,
          1980.0,
          1958.0,
          1946.0,
          1945.0,
          1953.0,
          1970.0,
          1968.0,
          1948.0,
          1969.0,
          1931.0,
          1984.0,
          1937.0,
          1962.0,
          1951.0,
          1965.0
        ],
        "field_uniqueness_percent": 26.88
      },
      "gender": {
        "field_data_type": "object",
        "field_description": "The \"gender\" column in the \"Donor\" table is designed to capture the gender identity of donors. It is represented as an object data type and contains two unique values: 'male' and 'female'. With a uniqueness percentage of 1.25, this indicates that nearly all entries in this column are either 'male' or 'female', suggesting a binary classification of gender. This field is likely used for demographic analysis and reporting related to donor characteristics.",
        "field_sample_values": [
          "male",
          "female"
        ],
        "field_unique_values": [
          "male",
          "female"
        ],
        "field_uniqueness_percent": 1.25
      },
      "comorbidity": {
        "field_data_type": "object",
        "field_description": "The \"comorbidity\" column in the Donor table likely represents various medical conditions or diseases that a donor may have in addition to their primary health issues. The data type is an object, indicating that the values are stored as strings. Sample values include conditions such as Cataracts, Colon Polyps, Hypothyroidism, Hypertension, and Gout, suggesting that the column captures a range of health-related factors that could impact the donor's overall health status. With a total of 16 unique values, the uniqueness percent of 6.25 indicates that a relatively small proportion of the total possible values are represented, suggesting that many donors may share similar comorbid conditions.",
        "field_sample_values": [
          "Cataracts",
          "Colon Polyps",
          "Hypothyroidism",
          "Hypertension",
          "Gout"
        ],
        "field_unique_values": [
          "Cataracts",
          "Colon Polyps",
          "Hypothyroidism",
          "Hypertension",
          "Gout",
          "Arthritis",
          "Asthma",
          "Crohn's Disease",
          "Congestive Heart Failure (CHF)",
          "Psoriasis"
        ],
        "field_uniqueness_percent": 6.25
      },
      "ethnicity": {
        "field_data_type": "object",
        "field_description": "The \"ethnicity\" column in the \"Donor\" table is designed to capture the ethnic background of donors. It contains categorical data represented as strings, with sample values including 'not hispanic or latino', 'hispanic or latino', and 'not reported'. The unique values indicate that there are three distinct categories for ethnicity, with a low uniqueness percentage of 1.88%, suggesting that most entries fall into a few common categories. This field likely serves to help identify and analyze the ethnic diversity of the donor population.",
        "field_sample_values": [
          "not hispanic or latino",
          "hispanic or latino",
          "not reported"
        ],
        "field_unique_values": [
          "not hispanic or latino",
          "hispanic or latino",
          "not reported"
        ],
        "field_uniqueness_percent": 1.88
      },
      "race": {
        "field_data_type": "object",
        "field_description": "The \"race\" column in the Donor table is designed to capture the racial or ethnic background of donors. It is categorized as an object data type, indicating that it contains string values. Sample values include 'white', 'not reported', 'black or african american', 'asian', and 'other', reflecting a range of racial identities. The column has a total of five unique values, with a uniqueness percentage of 3.12, suggesting that the majority of entries may fall into a few common categories. This field is likely used for demographic analysis and reporting purposes related to the donor population.",
        "field_sample_values": [
          "white",
          "not reported",
          "black or african american",
          "asian",
          "other"
        ],
        "field_unique_values": [
          "white",
          "not reported",
          "black or african american",
          "asian",
          "other"
        ],
        "field_uniqueness_percent": 3.12
      },
      "study_id": {
        "field_data_type": "object",
        "field_description": "The `study_id` column in the Donor table likely represents a unique identifier assigned to each study associated with the donors. The values in this column, such as 'PDC000127' and 'PDC000116', suggest that the identifiers follow a specific format, possibly indicating a systematic way of categorizing or referencing studies. With a uniqueness percentage of 1.25, it indicates that there are very few duplicate entries, reinforcing the idea that each study_id is intended to be distinct and serves as a reliable reference for individual studies within the database.",
        "field_sample_values": [
          "PDC000127",
          "PDC000116"
        ],
        "field_unique_values": [
          "PDC000127",
          "PDC000116"
        ],
        "field_uniqueness_percent": 1.25
      }
    }
  },
  "Exposure": {
    "table_description": "The Exposure table contains data related to patients' alcohol and tobacco use history, including their consumption patterns, smoking onset and quit years, and associated study identifiers. This information is essential for analyzing the impact of these factors on health outcomes in clinical research.",
    "fields": {
      "id": {
        "field_data_type": "int64",
        "field_description": "The \"id\" column in the \"Exposure\" table is an integer field that serves as a unique identifier for each record in the table. With a data type of int64, it can accommodate a wide range of integer values. The presence of 160 unique values indicates that each entry in the table is distinctly identified by its \"id,\" ensuring that there are no duplicate entries. This column is likely used to reference specific exposures or instances within the dataset, making it essential for data integrity and retrieval.",
        "field_sample_values": [
          1,
          2,
          3,
          4,
          5
        ],
        "field_unique_values": "160 unique values",
        "field_uniqueness_percent": 100.0
      },
      "curated_patient_id": {
        "field_data_type": "object",
        "field_description": "The `curated_patient_id` column in the Exposure table likely represents a unique identifier assigned to each patient within the dataset. The identifiers are formatted as alphanumeric strings, such as 'C3L-00004', indicating a systematic approach to categorizing patients. With 160 unique values and a uniqueness percentage of 100.0, each identifier corresponds to a distinct patient, ensuring that there are no duplicates in this field. This column is essential for tracking and referencing individual patients in relation to their exposure data.",
        "field_sample_values": [
          "C3L-00004",
          "C3L-00010",
          "C3L-00011",
          "C3L-00026",
          "C3L-00079"
        ],
        "field_unique_values": "160 unique values",
        "field_uniqueness_percent": 100.0
      },
      "alcohol_history": {
        "field_data_type": "object",
        "field_description": "The \"alcohol_history\" column in the Exposure table is designed to capture information regarding an individual's history of alcohol consumption. It contains categorical data with three possible values: 'No', indicating that the individual does not have a history of alcohol use; 'Yes', indicating a positive history of alcohol consumption; and 'Not Reported', which signifies that the individual has not provided information regarding their alcohol use. With a uniqueness percentage of 1.88, this field suggests that the majority of entries are likely to be similar, with a small proportion of unique responses.",
        "field_sample_values": [
          "No",
          "Not Reported",
          "Yes"
        ],
        "field_unique_values": [
          "No",
          "Not Reported",
          "Yes"
        ],
        "field_uniqueness_percent": 1.88
      },
      "alcohol_intensity": {
        "field_data_type": "object",
        "field_description": "The \"alcohol_intensity\" column in the \"Exposure\" table categorizes individuals based on their drinking habits. The values indicate different levels of alcohol consumption, including \"Lifelong Non-Drinker,\" \"Unknown,\" \"Occasional Drinker,\" and \"Non-Drinker.\" With a low uniqueness percentage of 2.5%, this suggests that most entries in this column are not unique, indicating that many individuals share the same drinking category. This field likely serves to assess the impact of alcohol consumption on health or other related studies.",
        "field_sample_values": [
          "Lifelong Non-Drinker",
          "Unknown",
          "Occasional Drinker",
          "Non-Drinker"
        ],
        "field_unique_values": [
          "Lifelong Non-Drinker",
          "Unknown",
          "Occasional Drinker",
          "Non-Drinker"
        ],
        "field_uniqueness_percent": 2.5
      },
      "tobacco_smoking_onset_year": {
        "field_data_type": "float64",
        "field_description": "The column \"tobacco_smoking_onset_year\" in the \"Exposure\" table likely represents the year in which individuals began smoking tobacco. The data type is float64, indicating that the values are stored as floating-point numbers, which in this case represent years. Sample values such as 1961.0, 2006.0, and 1959.0 suggest that the dataset includes a range of years from the mid-20th century to the early 21st century. The uniqueness percent of 18.12 indicates that there are relatively few distinct years compared to the total number of entries, suggesting that many individuals may have similar onset years for tobacco smoking. This field is important for analyzing trends in smoking behavior over time and understanding the historical context of tobacco use.",
        "field_sample_values": [
          1961.0,
          2006.0,
          1959.0,
          1975.0,
          1981.0
        ],
        "field_unique_values": [
          1961.0,
          2006.0,
          1959.0,
          1975.0,
          1981.0,
          1960.0,
          1963.0,
          1968.0,
          2001.0,
          1966.0,
          1969.0,
          1971.0,
          1987.0,
          1984.0,
          1964.0,
          1978.0,
          1970.0,
          1974.0,
          1996.0,
          1980.0,
          1957.0,
          1951.0,
          2011.0,
          1983.0,
          1979.0,
          2004.0,
          1962.0,
          1997.0,
          1985.0
        ],
        "field_uniqueness_percent": 18.12
      },
      "tobacco_smoking_quit_year": {
        "field_data_type": "float64",
        "field_description": "The column \"tobacco_smoking_quit_year\" in the \"Exposure\" table likely represents the year in which individuals ceased tobacco smoking. The data type is float64, indicating that the values are stored as floating-point numbers, which in this case represent years. Sample values include years such as 2005, 1985, and 1997, suggesting that the field captures a range of quit years spanning several decades. The uniqueness percent of 13.12 indicates that there is a relatively low diversity of quit years among the entries, with only a limited number of unique years recorded. This field is useful for analyzing trends in smoking cessation over time within the dataset.",
        "field_sample_values": [
          2005.0,
          1985.0,
          1997.0,
          2003.0,
          1998.0
        ],
        "field_unique_values": [
          2005.0,
          1985.0,
          1997.0,
          2003.0,
          1998.0,
          1976.0,
          2015.0,
          1986.0,
          2014.0,
          1989.0,
          2000.0,
          2010.0,
          1975.0,
          1987.0,
          1953.0,
          2009.0,
          2013.0,
          1993.0,
          1999.0,
          2016.0,
          2017.0
        ],
        "field_uniqueness_percent": 13.12
      },
      "tobacco_smoking_status": {
        "field_data_type": "object",
        "field_description": "The column \"tobacco_smoking_status\" in the \"Exposure\" table likely represents the smoking habits and history of individuals. It categorizes individuals based on their current and past smoking behaviors, with sample values indicating whether they are current smokers, lifelong non-smokers, or reformed smokers with varying durations of smoking history. Additionally, there is a category for cases where smoking history is not documented. The uniqueness percentage of 3.12 suggests that there are a limited number of distinct values in this column, indicating that most entries fall into one of the predefined categories.",
        "field_sample_values": [
          "Current Reformed Smoker for < or = 15 yrs",
          "Current Smoker",
          "Lifelong Non-Smoker",
          "Current Reformed Smoker for > 15 yrs",
          "Smoking history not documented"
        ],
        "field_unique_values": [
          "Current Reformed Smoker for < or = 15 yrs",
          "Current Smoker",
          "Lifelong Non-Smoker",
          "Current Reformed Smoker for > 15 yrs",
          "Smoking history not documented"
        ],
        "field_uniqueness_percent": 3.12
      },
      "study_id": {
        "field_data_type": "object",
        "field_description": "The `study_id` column in the Exposure table likely represents a unique identifier for different studies or research projects. Each value in this column, such as 'PDC000127' and 'PDC000116', serves to distinguish one study from another, ensuring that data can be accurately associated with its corresponding research. Given that the data type is an object and the uniqueness percent is 1.25, it indicates that there are very few duplicate entries, reinforcing the idea that each study_id is intended to be unique within the dataset.",
        "field_sample_values": [
          "PDC000127",
          "PDC000116"
        ],
        "field_unique_values": [
          "PDC000127",
          "PDC000116"
        ],
        "field_uniqueness_percent": 1.25
      }
    }
  },
  "Clinical_History": {
    "table_description": "The Clinical_History table contains patient clinical data, including unique identifiers, age at diagnosis, and associated study information. It is designed to track and analyze patient histories in clinical studies, facilitating research and insights into various medical conditions.",
    "fields": {
      "id": {
        "field_data_type": "float64",
        "field_description": "The \"id\" column in the \"Clinical_History\" table is a numerical identifier represented as a float64 data type. This column likely serves as a unique identifier for individual records within the clinical history dataset. With 107 unique values out of a total number of entries, it indicates that approximately 66.46% of the entries have distinct identifiers, suggesting that some records may share the same identifier. The sample values (1.0, 2.0, 3.0, 4.0, 5.0) illustrate that the identifiers are numeric and can represent a range of clinical cases or subjects. Overall, this field is essential for distinguishing between different clinical history records in the database.",
        "field_sample_values": [
          1.0,
          2.0,
          3.0,
          4.0,
          5.0
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 66.46
      },
      "curated_patient_id": {
        "field_data_type": "object",
        "field_description": "The `curated_patient_id` column in the `Clinical_History` table likely represents a unique identifier assigned to each patient within the clinical database. The identifiers are formatted as alphanumeric strings, such as 'C3L-00004', which suggest a systematic naming convention. With 161 unique values and a uniqueness percentage of 100.0, each entry in this column corresponds to a distinct patient, ensuring that there are no duplicate identifiers. This field is essential for accurately tracking and managing patient-specific clinical data.",
        "field_sample_values": [
          "C3L-00004",
          "C3L-00010",
          "C3L-00011",
          "C3L-00026",
          "C3L-00079"
        ],
        "field_unique_values": "161 unique values",
        "field_uniqueness_percent": 100.0
      },
      "age_at_diagnosis_in_yrs": {
        "field_data_type": "float64",
        "field_description": "The column \"age_at_diagnosis_in_yrs\" in the \"Clinical_History\" table represents the age of patients, measured in years, at the time they were diagnosed with a medical condition. The data type is float64, indicating that the values can include decimal points, which allows for more precise age measurements. Sample values such as 72.4, 30.2, 63.9, 65.4, and 49.4 suggest that ages can vary widely among patients. With 97 unique values and a uniqueness percentage of 60.25, this column captures a diverse range of ages at diagnosis, reflecting the varied demographics of the patient population.",
        "field_sample_values": [
          72.4,
          30.2,
          63.9,
          65.4,
          49.4
        ],
        "field_unique_values": "97 unique values",
        "field_uniqueness_percent": 60.25
      },
      "study_id": {
        "field_data_type": "object",
        "field_description": "The `study_id` column in the `Clinical_History` table likely represents unique identifiers assigned to different clinical studies or trials. Each entry in this column is expected to be a distinct alphanumeric code that corresponds to a specific study. The sample values, such as 'PDC000127' and 'PDC000116', indicate that these identifiers follow a particular format, which may include a prefix and a numerical sequence. However, the presence of the value 'study_id' suggests that there may be instances of placeholder or non-standard entries. With a uniqueness percentage of 1.86, it indicates that the majority of entries in this column are not unique, which may require further investigation to ensure data integrity.",
        "field_sample_values": [
          "PDC000127",
          "study_id",
          "PDC000116"
        ],
        "field_unique_values": [
          "PDC000127",
          "study_id",
          "PDC000116"
        ],
        "field_uniqueness_percent": 1.86
      }
    }
  },
  "Diagnosis": {
    "table_description": "The Diagnosis table contains clinical data related to cancer diagnoses, including patient identifiers, primary diagnosis details, tumor characteristics, and staging information. It serves to document the pathological and clinical attributes of samples collected from patients for research and analysis in oncology.",
    "fields": {
      "id": {
        "field_data_type": "float64",
        "field_description": "The \"id\" column in the \"Diagnosis\" table is a numerical identifier represented as a float64 data type. This column likely serves as a unique reference for different diagnoses recorded in the database. With 107 unique values out of a total number of entries, it indicates that approximately 66.46% of the entries have distinct identifiers, suggesting that some diagnoses may share the same identifier. The sample values (1.0, 2.0, 3.0, 4.0, 5.0) illustrate that the identifiers are numeric and may be sequential or categorized in a specific manner. Overall, this field is essential for distinguishing between various diagnoses within the dataset.",
        "field_sample_values": [
          1.0,
          2.0,
          3.0,
          4.0,
          5.0
        ],
        "field_unique_values": "107 unique values",
        "field_uniqueness_percent": 66.46
      },
      "curated_patient_id": {
        "field_data_type": "object",
        "field_description": "The `curated_patient_id` column in the Diagnosis table likely represents a unique identifier assigned to each patient within the database. The values are formatted as alphanumeric strings (e.g., 'C3L-00004'), indicating a structured coding system for patient identification. With 161 unique values and a uniqueness percentage of 100.0, each identifier corresponds to a distinct patient, ensuring that there are no duplicates. This column is essential for accurately tracking and managing patient-related data in the context of diagnoses.",
        "field_sample_values": [
          "C3L-00004",
          "C3L-00010",
          "C3L-00011",
          "C3L-00026",
          "C3L-00079"
        ],
        "field_unique_values": "161 unique values",
        "field_uniqueness_percent": 100.0
      },
      "primary_diagnosis": {
        "field_data_type": "object",
        "field_description": "The \"primary_diagnosis\" column in the Diagnosis table is designed to capture the main medical diagnosis assigned to a patient. The data type for this column is an object, indicating that it can contain text values. Based on the sample value provided, which is \"Renal cell carcinoma, NOS\" (Not Otherwise Specified), this field likely represents a specific type of cancer diagnosis. The uniqueness percent of 0.62 suggests that there is a moderate level of variation in the diagnoses recorded in this column, with many entries potentially sharing the same or similar diagnoses. Overall, this field is essential for identifying the primary health condition affecting patients within the database.",
        "field_sample_values": [
          "Renal cell carcinoma, NOS"
        ],
        "field_unique_values": [
          "Renal cell carcinoma, NOS"
        ],
        "field_uniqueness_percent": 0.62
      },
      "primary_site": {
        "field_data_type": "object",
        "field_description": "The \"primary_site\" column in the Diagnosis table likely represents the main anatomical location or site of a medical condition or diagnosis. In this case, the sample value \"Kidney\" indicates that the diagnosis pertains specifically to the kidney. With a data type of object and a uniqueness percent of 0.62, it suggests that while there are some unique entries, a significant portion of the data may be repetitive, indicating that multiple diagnoses may be recorded for the same primary site.",
        "field_sample_values": [
          "Kidney"
        ],
        "field_unique_values": [
          "Kidney"
        ],
        "field_uniqueness_percent": 0.62
      },
      "morphology": {
        "field_data_type": "object",
        "field_description": "The \"morphology\" column in the \"Diagnosis\" table appears to represent a specific classification or description related to the morphology of a medical condition or specimen. The data type is an object, which suggests that the values may be formatted as strings. The sample value provided, '8312-03-01 00:00:00', indicates a structured format that could potentially represent a date and time, possibly related to when the morphology was assessed or recorded. \n\nWith only one unique value observed and a uniqueness percentage of 0.62, it seems that this column may not be widely varied across the dataset, suggesting that it may be used for a specific type of diagnosis or that the data has not been fully populated. Overall, this field likely serves to document specific morphological characteristics relevant to patient diagnoses.",
        "field_sample_values": [
          "8312-03-01 00:00:00"
        ],
        "field_unique_values": [
          "8312-03-01 00:00:00"
        ],
        "field_uniqueness_percent": 0.62
      },
      "curated_sample_stage": {
        "field_data_type": "object",
        "field_description": "The column \"curated_sample_stage\" in the \"Diagnosis\" table likely represents the clinical stages of a disease, possibly cancer, as indicated by the Roman numeral values ('I', 'II', 'III', 'IV'). These stages typically denote the progression of the disease, with 'I' indicating an early stage and 'IV' representing advanced disease. The uniqueness percent of 2.48 suggests that this field has a limited number of distinct values relative to the total number of entries, indicating that many records may share the same stage classification.",
        "field_sample_values": [
          "III",
          "I",
          "IV",
          "II"
        ],
        "field_unique_values": [
          "III",
          "I",
          "IV",
          "II"
        ],
        "field_uniqueness_percent": 2.48
      },
      "curated_sample_tnm_stage": {
        "field_data_type": "object",
        "field_description": "The column \"curated_sample_tnm_stage\" in the \"Diagnosis\" table likely represents the TNM staging classification for cancer diagnoses. TNM stands for Tumor, Node, and Metastasis, which are key factors in determining the extent of cancer spread. \n\n- The \"T\" component indicates the size and extent of the primary tumor (e.g., T1, T2, T3).\n- The \"N\" component reflects the involvement of regional lymph nodes (e.g., N0, N1, NX).\n- The \"M\" component denotes the presence of distant metastasis (e.g., M0, M1).\n\nSample values such as 'T3NX', 'T1bN0', and 'T3aNXM1' illustrate the various combinations of these components, indicating different stages of cancer. The presence of unique values and a uniqueness percentage of 16.77 suggests that while there are several distinct TNM stage combinations, many entries may share similar or identical classifications. This field is essential for understanding the severity and progression of cancer in patients.",
        "field_sample_values": [
          "T3NX",
          "T1bN0",
          "T3aNXM1",
          "T1aNX",
          "T3aN1"
        ],
        "field_unique_values": [
          "T3NX",
          "T1bN0",
          "T3aNXM1",
          "T1aNX",
          "T3aN1",
          "T3aNX",
          "T3aN0M1",
          "T3bN0",
          "T1aNXM0",
          "T2aNX",
          "T3aNXM0",
          "T3bNX",
          "T1bNX",
          "T2bNX",
          "T3aN0M0",
          "T1bNXM0",
          "T1bN1",
          "T3aN0",
          "T1aN0M0",
          "T4N0",
          "T3N0",
          "none",
          "T3N1",
          "T2bNXM0",
          "T2bN0",
          "T2aN0",
          "T2aNXM0"
        ],
        "field_uniqueness_percent": 16.77
      },
      "curated_sample_grade": {
        "field_data_type": "object",
        "field_description": "The column \"curated_sample_grade\" in the \"Diagnosis\" table likely represents a grading system used to categorize samples based on specific criteria related to diagnosis. The values 'G1', 'G2', 'G3', and 'G4' indicate different levels or grades, with 'G1' typically representing the lowest grade and 'G4' the highest. This grading system may be used to assess the quality, severity, or characteristics of the samples in a clinical or research context. The uniqueness percent of 2.48 suggests that this column has a low level of unique entries relative to the total number of records, indicating that many samples may share the same grade.",
        "field_sample_values": [
          "G3",
          "G4",
          "G2",
          "G1"
        ],
        "field_unique_values": [
          "G3",
          "G4",
          "G2",
          "G1"
        ],
        "field_uniqueness_percent": 2.48
      },
      "study_id": {
        "field_data_type": "object",
        "field_description": "The `study_id` column in the Diagnosis table is designed to store unique identifiers for specific studies. The data type is an object, indicating that the values may include alphanumeric characters. A sample value, such as 'PDC000127', suggests that the identifiers follow a specific format, likely assigned to individual studies for tracking and reference purposes. With a uniqueness percent of 0.62, this indicates that a significant portion of the entries in this column are unique, implying that many different studies are represented in the dataset. Overall, the `study_id` serves as a key reference point for linking diagnoses to their respective studies.",
        "field_sample_values": [
          "PDC000127"
        ],
        "field_unique_values": [
          "PDC000127"
        ],
        "field_uniqueness_percent": 0.62
      }
    }
  },
  "Sample": {
    "table_description": "The Sample table contains information about biological samples collected from patients, including identifiers for samples and patients, sample types, preservation methods, and tissue characteristics. It serves to organize and document the details of samples used in research studies, facilitating data analysis and patient sample tracking.",
    "fields": {
      "sample_id": {
        "field_data_type": "object",
        "field_description": "The column \"sample_id\" in the \"Sample\" table appears to represent unique identifiers for various samples. Each identifier follows a specific format, which includes a prefix (C3L), followed by a series of numbers and a suffix that likely indicates a specific sample version or replicate. The presence of 179 unique values out of a total number of entries suggests that while many samples share the same base identifier, there are multiple instances or variations for some of them. With a uniqueness percentage of 76.82%, this column is primarily used to distinguish between different samples in the dataset, making it essential for tracking and analyzing sample-related data.",
        "field_sample_values": [
          "C3L-00004-01",
          "C3L-00004-06",
          "C3L-00010-01",
          "C3L-00010-06",
          "C3L-00011-01"
        ],
        "field_unique_values": "179 unique values",
        "field_uniqueness_percent": 76.82
      },
      "curated_patient_id": {
        "field_data_type": "object",
        "field_description": "The `curated_patient_id` column in the Sample table likely represents a unique identifier assigned to patients within a specific study or dataset. The identifiers, such as 'C3L-00004' and 'C3L-00010', appear to follow a consistent format, suggesting they are systematically generated. With 161 unique values out of a total number of entries, this column has a uniqueness percentage of 69.1%, indicating that a significant portion of the records may correspond to multiple samples from the same patients. This field is essential for tracking and managing patient-related data in the database.",
        "field_sample_values": [
          "C3L-00004",
          "C3L-00010",
          "C3L-00011",
          "C3L-00026",
          "C3L-00079"
        ],
        "field_unique_values": "161 unique values",
        "field_uniqueness_percent": 69.1
      },
      "sample_type": {
        "field_data_type": "object",
        "field_description": "The \"sample_type\" column in the \"Sample\" table categorizes the type of biological samples collected. It contains two unique values: \"Primary Tumor,\" which refers to samples taken directly from a tumor, and \"Solid Tissue Normal,\" which indicates samples obtained from normal tissue adjacent to the tumor. With a uniqueness percentage of 86%, this column effectively distinguishes between different sample types, providing essential context for analyzing the biological data associated with each sample.",
        "field_sample_values": [
          "Primary Tumor",
          "Solid Tissue Normal"
        ],
        "field_unique_values": [
          "Primary Tumor",
          "Solid Tissue Normal"
        ],
        "field_uniqueness_percent": 0.86
      },
      "preservation_method": {
        "field_data_type": "object",
        "field_description": "The \"preservation_method\" column in the \"Sample\" table indicates the method used to preserve biological samples. In this case, the sample value \"Snap Frozen\" suggests that the samples are rapidly frozen to maintain their integrity and prevent degradation. The uniqueness percent of 0.43 indicates that this method is not commonly used across all entries in the table, implying that there may be other preservation methods recorded in different samples.",
        "field_sample_values": [
          "Snap Frozen"
        ],
        "field_unique_values": [
          "Snap Frozen"
        ],
        "field_uniqueness_percent": 0.43
      },
      "site_of_resection_or_biopsy": {
        "field_data_type": "object",
        "field_description": "The column \"site_of_resection_or_biopsy\" in the \"Sample\" table likely represents the anatomical location from which a tissue sample was taken for medical examination. The sample value 'NOS,Kidney' suggests that the site is the kidney, with \"NOS\" indicating \"Not Otherwise Specified.\" This implies that while the kidney is the identified site, there may not be further specific details provided about the exact location or nature of the resection or biopsy. The uniqueness percent of 0.43 indicates that this value is not highly unique within the dataset, suggesting that multiple entries may share the same or similar site descriptions.",
        "field_sample_values": [
          " NOS,Kidney"
        ],
        "field_unique_values": [
          " NOS,Kidney"
        ],
        "field_uniqueness_percent": 0.43
      },
      "tissue_type": {
        "field_data_type": "object",
        "field_description": "The \"tissue_type\" column in the \"Sample\" table indicates the classification of tissue samples collected for analysis. It contains two unique values: 'Tumor' and 'Normal'. This suggests that the samples are categorized based on whether they are derived from tumor tissue or healthy (normal) tissue. With a high uniqueness percentage of 86%, this column is likely used to differentiate between these two types of samples in the database, which is essential for various analyses in medical research and diagnostics.",
        "field_sample_values": [
          "Tumor",
          "Normal"
        ],
        "field_unique_values": [
          "Tumor",
          "Normal"
        ],
        "field_uniqueness_percent": 0.86
      },
      "study_id": {
        "field_data_type": "object",
        "field_description": "The `study_id` column in the `Sample` table is designed to store unique identifiers for studies. The data type is an object, indicating that the values are likely alphanumeric strings. The sample value provided is 'PDC000127', which suggests that the identifiers follow a specific format, possibly indicating a particular study or dataset. With only one unique value observed, the uniqueness percentage is relatively low at 0.43%, implying that this column may not be fully populated with distinct study identifiers across the dataset. Overall, this field likely serves to link samples to their corresponding studies for data organization and analysis purposes.",
        "field_sample_values": [
          "PDC000127"
        ],
        "field_unique_values": [
          "PDC000127"
        ],
        "field_uniqueness_percent": 0.43
      }
    }
  },
  "PDC000116": {
    "table_description": "The PDC000116 table contains clinical and demographic data related to cancer samples, specifically focusing on colon-related diseases. It includes information on sample characteristics, patient demographics, tumor staging, treatment responses, and external references, facilitating research and analysis in cancer studies.",
    "fields": {
      "cid": {
        "field_data_type": "object",
        "field_description": "The column \"cid\" in the table \"PDC000116\" appears to represent a unique identifier for records within the dataset. The data type is classified as \"object,\" which suggests that the values are stored as strings. The sample values provided are formatted as UUIDs (Universally Unique Identifiers), which are commonly used to uniquely identify information in databases. With 53 unique values and a uniqueness percentage of 100.0, it indicates that each entry in this column is distinct, ensuring that no two records share the same identifier. This field is likely used to reference or link to other entities or records within the database or related systems.",
        "field_sample_values": [
          "87408d9e-4029-4e8f-b14c-8efc04",
          "8c73f3a5-fea8-4942-90c0-966f66",
          "591fb460-703a-437d-8d9a-ff2a35",
          "66b829db-1cdd-460d-b2f3-0e9ca9",
          "c2c53076-b5db-4b7d-983c-a35740"
        ],
        "field_unique_values": "53 unique values",
        "field_uniqueness_percent": 100.0
      },
      "sample_submitter_id": {
        "field_data_type": "object",
        "field_description": "The column \"sample_submitter_id\" in the table \"PDC000116\" is likely used to store unique identifiers for individuals or entities that have submitted samples. The data type is an object, indicating that the values are stored as strings, which in this case appear to be formatted as UUIDs (Universally Unique Identifiers). With 53 unique values and a uniqueness percentage of 100.0, each identifier corresponds to a distinct sample submitter, ensuring that there are no duplicate entries. This field is essential for tracking and managing sample submissions within the database.",
        "field_sample_values": [
          "87408d9e-4029-4e8f-b14c-8efc04",
          "8c73f3a5-fea8-4942-90c0-966f66",
          "591fb460-703a-437d-8d9a-ff2a35",
          "66b829db-1cdd-460d-b2f3-0e9ca9",
          "c2c53076-b5db-4b7d-983c-a35740"
        ],
        "field_unique_values": "53 unique values",
        "field_uniqueness_percent": 100.0
      },
      "kw_curated_tissue": {
        "field_data_type": "object",
        "field_description": "The column \"kw_curated_tissue\" in the table \"PDC000116\" likely represents a curated list of tissue types associated with a particular dataset or record. The data type is an object, indicating that the values are stored in a non-standard format, specifically as a JSON-like string. The sample and unique values show that the current dataset contains a single entry, which is \"colon.\" The uniqueness percentage of 1.89 suggests that this field has low variability, indicating that most entries may share the same tissue type. Overall, this field is intended to categorize or identify specific tissues relevant to the data being analyzed.",
        "field_sample_values": [
          "[\"colon\"]"
        ],
        "field_unique_values": [
          "[\"colon\"]"
        ],
        "field_uniqueness_percent": 1.89
      },
      "kw_curated_disease": {
        "field_data_type": "object",
        "field_description": "The column \"kw_curated_disease\" in the table \"PDC000116\" appears to represent a curated list of diseases associated with the data entries in this table. Given that the data type is an object and the sample and unique values both indicate \"Colonic Neoplasms,\" it is likely that this field is used to categorize or identify specific diseases relevant to the records in the database. The uniqueness percent of 1.89 suggests that there are very few distinct disease entries in this column, indicating that it may primarily focus on a limited set of diseases, with \"Colonic Neoplasms\" being the predominant entry.",
        "field_sample_values": [
          "Colonic Neoplasms"
        ],
        "field_unique_values": [
          "Colonic Neoplasms"
        ],
        "field_uniqueness_percent": 1.89
      },
      "kw_curated_cell_type": {
        "field_data_type": "object",
        "field_description": "The column \"kw_curated_cell_type\" in the table \"PDC000116\" is designed to store information about the cell types associated with the data entries. The data type is an object, which suggests that the values are stored in a structured format, likely as JSON strings. The sample and unique values indicate that the only entry present is '[\"none\"]', which implies that there are currently no specific cell types curated for the records in this table. With a uniqueness percentage of 1.89, it indicates that this field has very low variability, reinforcing that most entries do not specify a cell type. Overall, this field likely serves to categorize or label cell types, but in this dataset, it currently reflects a lack of specific information.",
        "field_sample_values": [
          "[\"none\"]"
        ],
        "field_unique_values": [
          "[\"none\"]"
        ],
        "field_uniqueness_percent": 1.89
      },
      "kw_curated_cell_line": {
        "field_data_type": "object",
        "field_description": "The column \"kw_curated_cell_line\" in the table \"PDC000116\" is designed to store information related to curated cell lines used in research or experiments. The data type is an object, indicating that it can hold various types of data, but in this case, the sample and unique values are both 'none'. This suggests that there are currently no curated cell lines associated with the entries in this column. The uniqueness percent of 1.89 indicates that nearly all entries in this column are the same, reinforcing that it primarily contains the value 'none'. Overall, this field likely serves as a placeholder for future data regarding curated cell lines, but currently does not provide any meaningful information.",
        "field_sample_values": [
          "none"
        ],
        "field_unique_values": [
          "none"
        ],
        "field_uniqueness_percent": 1.89
      },
      "kw_curated_drug": {
        "field_data_type": "object",
        "field_description": "The column \"kw_curated_drug\" in the table \"PDC000116\" is designed to store information related to curated drugs associated with the data entries. The data type is an object, indicating that the values are likely stored as strings representing lists or arrays. The sample and unique values show that the only entry present is '[\"none\"]', suggesting that there are currently no curated drugs associated with the records in this table. The uniqueness percentage of 1.89 indicates that this field has very low variability, reinforcing that it predominantly contains the same value. Overall, this field appears to be intended for future use in capturing specific drug information, but currently reflects a lack of such data.",
        "field_sample_values": [
          "[\"none\"]"
        ],
        "field_unique_values": [
          "[\"none\"]"
        ],
        "field_uniqueness_percent": 1.89
      },
      "kw_curated_genetic_mod_type": {
        "field_data_type": "object",
        "field_description": "The column \"kw_curated_genetic_mod_type\" in the table \"PDC000116\" is designed to store information related to the type of genetic modification associated with the data entries. The data type is classified as an object, indicating that it may contain complex data structures, such as lists or arrays. The sample and unique values both show that the only entry present is '[\"none\"]', suggesting that there are currently no recorded genetic modification types for the entries in this column. The uniqueness percentage of 1.89 indicates that this field has very low variability, reinforcing the idea that it predominantly contains the value \"none.\" This field likely serves to indicate the absence of any genetic modification rather than documenting specific types.",
        "field_sample_values": [
          "[\"none\"]"
        ],
        "field_unique_values": [
          "[\"none\"]"
        ],
        "field_uniqueness_percent": 1.89
      },
      "kw_curated_modified_gene": {
        "field_data_type": "object",
        "field_description": "The column \"kw_curated_modified_gene\" in the table \"PDC000116\" is designed to store information related to genes that have been curated or modified in some way. The data type is classified as an object, indicating that the values may be stored in a complex format, such as a JSON string. Sample values, including '[\"none\"]', suggest that this field may often indicate the absence of any curated or modified gene information. With a uniqueness percentage of 1.89, it appears that this column has a low level of diversity in its entries, primarily reflecting a consistent value across many records. Overall, this field likely serves to track modifications or curation status of genes, but in many cases, it indicates that no such modifications have been recorded.",
        "field_sample_values": [
          "[\"none\"]"
        ],
        "field_unique_values": [
          "[\"none\"]"
        ],
        "field_uniqueness_percent": 1.89
      },
      "curated_sample_stage": {
        "field_data_type": "object",
        "field_description": "The column \"curated_sample_stage\" in the table \"PDC000116\" likely represents the classification or stage of a sample in a specific study or dataset. The values, which include designations such as 'IIIB', 'IIA', 'I', 'IVA', 'IIB', and others, suggest a hierarchical or categorical system, possibly related to clinical stages, experimental phases, or other categorizations relevant to the samples being analyzed. With a data type of object and a uniqueness percentage of 15.09, it indicates that there are multiple samples sharing the same stage, while still allowing for a variety of unique classifications within the dataset.",
        "field_sample_values": [
          "IIIB",
          "IIA",
          "I",
          "IVA",
          "IIB"
        ],
        "field_unique_values": [
          "IIIB",
          "IIA",
          "I",
          "IVA",
          "IIB",
          "IIIC",
          "IV",
          "II"
        ],
        "field_uniqueness_percent": 15.09
      },
      "curated_sample_tnm_stage": {
        "field_data_type": "object",
        "field_description": "The column \"curated_sample_tnm_stage\" in the table \"PDC000116\" likely represents the TNM staging classification for cancer samples. TNM stands for Tumor, Node, and Metastasis, which are key factors in determining the extent of cancer spread. The values in this column, such as 'T3N1b' and 'T4aN1b', indicate specific stages of the tumor (T), involvement of regional lymph nodes (N), and the presence of metastasis (M). The unique values suggest a variety of staging combinations, reflecting different levels of tumor size and spread. The uniqueness percentage of 18.87 indicates that there is a relatively low level of distinct entries in this field, suggesting that many samples may share similar TNM classifications.",
        "field_sample_values": [
          "T3N1b",
          "T3N0",
          "T2N0",
          "T4aN1b",
          "T3N2a"
        ],
        "field_unique_values": [
          "T3N1b",
          "T3N0",
          "T2N0",
          "T4aN1b",
          "T3N2a",
          "T4aN0",
          "T3N1a",
          "T3N1",
          "T2N2a",
          "T4aN2a"
        ],
        "field_uniqueness_percent": 18.87
      },
      "curated_sample_grade": {
        "field_data_type": "object",
        "field_description": "The column \"curated_sample_grade\" in the table \"PDC000116\" is designed to categorize the quality or classification of samples within the dataset. Currently, it contains only one unique value, \"none,\" which suggests that this field may be used to indicate that no specific grade or classification has been assigned to the samples. With a uniqueness percentage of 1.89, it implies that this field is not widely utilized for differentiation among samples, and most entries are likely marked as \"none.\" This could indicate that the grading system is either not applicable to the majority of samples or that the data has not been fully curated to include various grades.",
        "field_sample_values": [
          "none"
        ],
        "field_unique_values": [
          "none"
        ],
        "field_uniqueness_percent": 1.89
      },
      "curated_stage": {
        "field_data_type": "object",
        "field_description": "The \"curated_stage\" column in the \"PDC000116\" table likely represents the clinical staging of a disease, possibly cancer, based on the sample values provided. The values such as 'I', 'IIA', 'IIIB', 'IVA', and others indicate different stages of progression, with lower numbers typically representing earlier stages and higher numbers indicating more advanced stages. The presence of unique values suggests a classification system that categorizes the severity or extent of the disease, which is essential for treatment planning and prognosis. The uniqueness percentage of 15.09 indicates that there is a moderate level of repetition among the entries in this column.",
        "field_sample_values": [
          "IIIB",
          "IIA",
          "I",
          "IVA",
          "IIB"
        ],
        "field_unique_values": [
          "IIIB",
          "IIA",
          "I",
          "IVA",
          "IIB",
          "IIIC",
          "IV",
          "II"
        ],
        "field_uniqueness_percent": 15.09
      },
      "curated_drug_sensitivity": {
        "field_data_type": "object",
        "field_description": "The `curated_drug_sensitivity` column in the `PDC000116` table is designed to indicate the sensitivity of a particular sample to various drugs. Given that the data type is an object and the sample values consist solely of 'none', it suggests that there are currently no recorded sensitivities for the samples in this dataset. The uniqueness percent of 1.89 indicates that nearly all entries in this column are identical, reinforcing the notion that drug sensitivity information is either not applicable or has not been documented for the samples in question.",
        "field_sample_values": [
          "none"
        ],
        "field_unique_values": [
          "none"
        ],
        "field_uniqueness_percent": 1.89
      },
      "curated_patient_id": {
        "field_data_type": "object",
        "field_description": "The column \"curated_patient_id\" in the table \"PDC000116\" likely represents a unique identifier assigned to patients within a specific dataset. The identifiers are formatted as alphanumeric strings, such as '06CO001' and '11CO061', which may indicate a coding system that includes a combination of numbers and letters. With 53 unique values and a uniqueness percentage of 100.0, each patient in this dataset is distinctly represented, ensuring that there are no duplicate entries. This field is essential for tracking and managing patient data accurately within the database.",
        "field_sample_values": [
          "06CO001",
          "11CO061",
          "11CO043",
          "05CO053",
          "09CO006"
        ],
        "field_unique_values": "53 unique values",
        "field_uniqueness_percent": 100.0
      },
      "curated_sample_type": {
        "field_data_type": "object",
        "field_description": "The column \"curated_sample_type\" in the table \"PDC000116\" is designed to categorize the type of biological sample being referenced. Given that the data type is an object and the only sample value present is \"primary_tumor,\" it is likely that this field indicates that the samples are specifically derived from primary tumor tissues. The uniqueness percent of 1.89 suggests that this column has limited variability, with \"primary_tumor\" being the sole unique value recorded. This indicates a focused dataset, primarily dealing with samples from primary tumors.",
        "field_sample_values": [
          "primary_tumor"
        ],
        "field_unique_values": [
          "primary_tumor"
        ],
        "field_uniqueness_percent": 1.89
      },
      "vital status": {
        "field_data_type": "int64",
        "field_description": "The \"vital status\" column in the PDC000116 table is an integer field (int64) that indicates the health status of individuals in the dataset. It contains two unique values: 1 and 0. Typically, a value of 1 may represent that the individual is alive, while a value of 0 may indicate that the individual is deceased. The uniqueness percent of 3.77 suggests that this column has a low level of distinct entries relative to the total number of records, indicating that most individuals in the dataset share the same vital status.",
        "field_sample_values": [
          1,
          0
        ],
        "field_unique_values": [
          1,
          0
        ],
        "field_uniqueness_percent": 3.77
      },
      "OS_event": {
        "field_data_type": "object",
        "field_description": "The column \"OS_event\" in the table \"PDC000116\" is designed to capture information related to operating system events. Currently, it contains a single unique value, \"none,\" indicating that there are no recorded events in this field. With a uniqueness percentage of 1.89, it suggests that this column has very low variability, likely indicating that it is not actively used to track diverse operating system events. Instead, it may serve as a placeholder or default value in scenarios where no specific event is applicable.",
        "field_sample_values": [
          "none"
        ],
        "field_unique_values": [
          "none"
        ],
        "field_uniqueness_percent": 1.89
      },
      "OS_time": {
        "field_data_type": "object",
        "field_description": "The column \"OS_time\" in the table \"PDC000116\" appears to represent a time-related attribute, likely associated with an operating system or operational time metric. However, the sample and unique values indicate that it predominantly contains the value 'none', suggesting that this field may not be actively used or populated with meaningful data. The uniqueness percentage of 1.89% further supports this notion, indicating that nearly all entries in this column are identical. As such, this field may require further investigation to determine its intended purpose and whether it should be utilized or removed from the dataset.",
        "field_sample_values": [
          "none"
        ],
        "field_unique_values": [
          "none"
        ],
        "field_uniqueness_percent": 1.89
      },
      "aliquot_submitter_id": {
        "field_data_type": "object",
        "field_description": "The column \"aliquot_submitter_id\" in the table \"PDC000116\" appears to represent a unique identifier for aliquots submitted to a database, likely in a biological or clinical research context. Each identifier is formatted as a combination of a UUID (Universally Unique Identifier) followed by a suffix (e.g., \"_D3\"), which may indicate a specific version, batch, or type of submission. With 53 unique values and a uniqueness percentage of 100.0, each aliquot submitter ID is distinct, ensuring that each entry can be accurately tracked and referenced without duplication. This field is essential for maintaining the integrity of data related to sample submissions.",
        "field_sample_values": [
          "87408d9e-4029-4e8f-b14c-8efc04_D3",
          "8c73f3a5-fea8-4942-90c0-966f66_D3",
          "591fb460-703a-437d-8d9a-ff2a35_D3",
          "66b829db-1cdd-460d-b2f3-0e9ca9_D3",
          "c2c53076-b5db-4b7d-983c-a35740_D3"
        ],
        "field_unique_values": "53 unique values",
        "field_uniqueness_percent": 100.0
      },
      "case_submitter_id": {
        "field_data_type": "object",
        "field_description": "The column \"case_submitter_id\" in the table \"PDC000116\" likely represents a unique identifier assigned to individuals or entities that submit cases within a specific system or database. The data type is categorized as an object, indicating that the identifiers may include alphanumeric characters. Sample values such as '06CO001', '11CO061', and '05CO053' suggest a structured format, possibly indicating a combination of a code for the year or region followed by a sequential number. With 53 unique values and a uniqueness percentage of 100.0, each case submitter ID is distinct, ensuring that each submission can be accurately tracked and attributed to its respective submitter.",
        "field_sample_values": [
          "06CO001",
          "11CO061",
          "11CO043",
          "05CO053",
          "09CO006"
        ],
        "field_unique_values": "53 unique values",
        "field_uniqueness_percent": 100.0
      },
      "demographic.submitter_id": {
        "field_data_type": "object",
        "field_description": "The column `demographic.submitter_id` in the table `PDC000116` likely represents a unique identifier assigned to each submitter of demographic data. The values are formatted as alphanumeric strings, which may include a combination of letters and numbers, followed by a suffix (e.g., '-DG'). With 53 unique values and a uniqueness percentage of 100.0, each submitter_id is distinct, indicating that this field is used to differentiate between individual submitters in the dataset. This identifier is essential for tracking submissions and ensuring data integrity within the demographic information.",
        "field_sample_values": [
          "06CO001-DG",
          "11CO061-DG",
          "11CO043-DG",
          "05CO053-DG",
          "09CO006-DG"
        ],
        "field_unique_values": "53 unique values",
        "field_uniqueness_percent": 100.0
      },
      "demographic_submitter_id_1": {
        "field_data_type": "object",
        "field_description": "The column \"demographic_submitter_id_1\" in the table \"PDC000116\" is likely used to store unique identifiers for submitters of demographic data. The identifiers appear to follow a specific format, which includes a two-digit number representing a year, a two-letter state code (CO), and a three-digit sequence number, followed by a suffix \"-DM\". Given that there are 53 unique values and a uniqueness percentage of 100.0, each identifier is distinct, indicating that this field is designed to uniquely identify each submitter within the dataset.",
        "field_sample_values": [
          "06CO001-DM",
          "11CO061-DM",
          "11CO043-DM",
          "05CO053-DM",
          "09CO006-DM"
        ],
        "field_unique_values": "53 unique values",
        "field_uniqueness_percent": 100.0
      },
      "diagnoses.submitter_id": {
        "field_data_type": "object",
        "field_description": "The column \"diagnoses.submitter_id\" in the table \"PDC000116\" likely represents a unique identifier assigned to each submitter of diagnosis data. The values are formatted as alphanumeric strings, typically consisting of a two-digit number followed by a three-letter code and a suffix \"-DX\". This suggests that the submitter IDs may be associated with specific organizations or individuals responsible for submitting diagnosis information. With 53 unique values and a uniqueness percentage of 100.0, each submitter ID is distinct, indicating that there are no duplicate entries in this column.",
        "field_sample_values": [
          "06CO001-DX",
          "11CO061-DX",
          "11CO043-DX",
          "05CO053-DX",
          "09CO006-DX"
        ],
        "field_unique_values": "53 unique values",
        "field_uniqueness_percent": 100.0
      },
      "diagnosis_submitter_id": {
        "field_data_type": "object",
        "field_description": "The column \"diagnosis_submitter_id\" in the table \"PDC000116\" likely represents a unique identifier assigned to entities or individuals who submit diagnosis information. The values in this column, such as '06CO001-DX' and '11CO061-DX', suggest a structured format that may include a code indicating the submitter's identity, possibly along with a designation related to the type of diagnosis. With 53 unique values and a uniqueness percentage of 100.0, each entry in this column is distinct, indicating that no two records share the same submitter ID. This field is essential for tracking and managing submissions related to diagnoses within the database.",
        "field_sample_values": [
          "06CO001-DX",
          "11CO061-DX",
          "11CO043-DX",
          "05CO053-DX",
          "09CO006-DX"
        ],
        "field_unique_values": "53 unique values",
        "field_uniqueness_percent": 100.0
      },
      "gdc_sample_id": {
        "field_data_type": "object",
        "field_description": "The column \"gdc_sample_id\" in the table \"PDC000116\" likely represents a unique identifier for biological samples within a database. The values are formatted as UUIDs (Universally Unique Identifiers), which are commonly used to ensure that each sample can be distinctly identified without ambiguity. With 52 unique values and a high uniqueness percentage of 98.11%, this column is designed to maintain the integrity of sample identification, allowing for efficient data management and retrieval in research or clinical settings.",
        "field_sample_values": [
          "66364fc1-5e9f-49ec-9fcc-12f0e547c87c",
          "608d55a4-3041-4f97-a776-ba5a39f5f282",
          "9cec7514-2461-4666-a722-221465b25c7f",
          "6464fff6-85fb-402e-9d9b-b8d29ecd772d",
          "937e8fdf-2374-4ce6-9a6b-9f997e23ad4d"
        ],
        "field_unique_values": "52 unique values",
        "field_uniqueness_percent": 98.11
      },
      "sample_type_id": {
        "field_data_type": "int64",
        "field_description": "The column \"sample_type_id\" in the table \"PDC000116\" is an integer field (int64) that likely serves as an identifier for different types of samples within the dataset. Given that the sample values consist of a single unique value (1), it suggests that this column currently categorizes all entries in the table under one specific sample type. The uniqueness percentage of 1.89 indicates that there is very little variation in this field, implying that it may be used to denote a default or primary sample type across the records.",
        "field_sample_values": [
          1
        ],
        "field_unique_values": [
          1
        ],
        "field_uniqueness_percent": 1.89
      },
      "submitter_id": {
        "field_data_type": "object",
        "field_description": "The `submitter_id` column in the `PDC000116` table likely represents a unique identifier assigned to individuals or entities that submit data or records to the database. The values are formatted as alphanumeric strings, which may indicate a specific coding system used to categorize or identify submitters. With 53 unique values and a uniqueness percentage of 100.0, each submitter is distinctly represented in this column, ensuring that there are no duplicate entries. This field is essential for tracking submissions and maintaining data integrity within the database.",
        "field_sample_values": [
          "06CO001",
          "11CO061",
          "11CO043",
          "05CO053",
          "09CO006"
        ],
        "field_unique_values": "53 unique values",
        "field_uniqueness_percent": 100.0
      },
      "ajcc_pathologic_stage": {
        "field_data_type": "object",
        "field_description": "The column \"ajcc_pathologic_stage\" in the table \"PDC000116\" likely represents the pathologic staging of cancer as defined by the American Joint Committee on Cancer (AJCC). This staging system categorizes the extent of cancer progression based on various factors, including tumor size, lymph node involvement, and metastasis. The sample values, such as 'IIIB', 'IIA', 'I', 'IVA', and 'IIB', indicate different stages of cancer, with each designation reflecting a specific level of severity and spread. The presence of unique values like 'IIIC' and 'IV' suggests a comprehensive range of stages is captured in this column. The uniqueness percentage of 15.09 indicates that a relatively small portion of the data entries are unique, implying that many records share the same pathologic stage classification.",
        "field_sample_values": [
          "IIIB",
          "IIA",
          "I",
          "IVA",
          "IIB"
        ],
        "field_unique_values": [
          "IIIB",
          "IIA",
          "I",
          "IVA",
          "IIB",
          "IIIC",
          "IV",
          "II"
        ],
        "field_uniqueness_percent": 15.09
      },
      "aliquots.analyte_type": {
        "field_data_type": "object",
        "field_description": "The column `aliquots.analyte_type` in the table `PDC000116` is designed to categorize the type of analyte present in the aliquots. Given that the data type is an object and the sample and unique values are both 'Protein', it suggests that this field is used to specify that the analyte being measured or analyzed in the aliquots is a protein. The uniqueness percentage of 1.89 indicates that this field has a low variety of entries, with 'Protein' being the only value recorded, implying that all entries in this column refer to protein analytes.",
        "field_sample_values": [
          "Protein"
        ],
        "field_unique_values": [
          "Protein"
        ],
        "field_uniqueness_percent": 1.89
      },
      "classification_of_tumor": {
        "field_data_type": "object",
        "field_description": "The column \"classification_of_tumor\" in the table \"PDC000116\" is designed to categorize the type of tumor associated with the data entries. Currently, it contains a single unique value, \"not reported,\" indicating that there is no available information regarding the tumor classification for the records in this dataset. With a uniqueness percentage of 1.89, it suggests that the majority of entries in this column lack specific tumor classification data, which may limit the analysis of tumor types within this dataset.",
        "field_sample_values": [
          "not reported"
        ],
        "field_unique_values": [
          "not reported"
        ],
        "field_uniqueness_percent": 1.89
      },
      "days_to_lost_to_followup": {
        "field_data_type": "int64",
        "field_description": "The column \"days_to_lost_to_followup\" in the table \"PDC000116\" likely represents the number of days until a patient or subject is considered lost to follow-up in a study or clinical trial. Given that the data type is int64 and the sample and unique values are both [0], it suggests that all entries in this column currently indicate that there are no days until loss to follow-up, implying that none of the subjects have been lost to follow-up at this time. The uniqueness percent of 1.89 indicates that this column has very low variability, with almost all entries being the same.",
        "field_sample_values": [
          0
        ],
        "field_unique_values": [
          0
        ],
        "field_uniqueness_percent": 1.89
      },
      "demographic.state": {
        "field_data_type": "object",
        "field_description": "The column \"demographic.state\" in the table \"PDC000116\" is of data type object and contains values that indicate the state of a demographic record. Based on the sample and unique values, which both show 'released', it appears that this field is used to signify that the demographic data has been officially released or made available. The uniqueness percentage of 1.89 suggests that this column has very limited variability, with 'released' being the only value present in the dataset. This indicates that all records in this column share the same state, likely reflecting a specific status of the demographic information.",
        "field_sample_values": [
          "released"
        ],
        "field_unique_values": [
          "released"
        ],
        "field_uniqueness_percent": 1.89
      },
      "diagnoses.state": {
        "field_data_type": "object",
        "field_description": "The column \"diagnoses.state\" in the table \"PDC000116\" is an object data type that appears to represent the state or status of a diagnosis. Based on the sample and unique values, which both indicate \"released,\" it is likely that this field is used to denote that a diagnosis has been finalized or made public. The low uniqueness percentage of 1.89 suggests that this column predominantly contains the same value, indicating that most entries in this dataset are in the \"released\" state.",
        "field_sample_values": [
          "released"
        ],
        "field_unique_values": [
          "released"
        ],
        "field_uniqueness_percent": 1.89
      },
      "disease_type": {
        "field_data_type": "object",
        "field_description": "The \"disease_type\" column in the PDC000116 table likely represents the classification of diseases associated with the data entries. The data type is an object, indicating that the values are stored as strings. The sample value provided, \"Colon Adenocarcinoma,Adenomas and Adenocarcinomas,\" suggests that this field may contain a list of related disease types, specifically focusing on different forms of colon cancer and related conditions. With only one unique value observed and a uniqueness percentage of 1.89, it appears that this column may have limited variability, possibly indicating that the dataset is focused on a specific disease or set of diseases.",
        "field_sample_values": [
          "Colon Adenocarcinoma,Adenomas and Adenocarcinomas"
        ],
        "field_unique_values": [
          "Colon Adenocarcinoma,Adenomas and Adenocarcinomas"
        ],
        "field_uniqueness_percent": 1.89
      },
      "ethnicity": {
        "field_data_type": "object",
        "field_description": "The \"ethnicity\" column in the PDC000116 table categorizes individuals based on their ethnic background. It contains three unique values: \"hispanic or latino,\" \"not hispanic or latino,\" and \"not reported.\" This field likely serves to identify the ethnic classification of individuals for demographic analysis or reporting purposes. The uniqueness percentage of 5.66 indicates that a small proportion of the entries in this column are distinct, suggesting that most individuals fall into the same categories.",
        "field_sample_values": [
          "hispanic or latino",
          "not hispanic or latino",
          "not reported"
        ],
        "field_unique_values": [
          "hispanic or latino",
          "not hispanic or latino",
          "not reported"
        ],
        "field_uniqueness_percent": 5.66
      },
      "externalReferences": {
        "field_data_type": "object",
        "field_description": "The `externalReferences` column in the `PDC000116` table contains a list of external reference objects, each represented as a JSON-like string. Each object includes details about a specific external reference, such as:\n\n- `external_reference_id`: A unique identifier for the reference.\n- `reference_entity_location`: A URL pointing to the location of the referenced entity, typically hosted on the Genomic Data Commons (GDC) portal.\n- `reference_resource_name`: The name of the resource where the reference is found, which is consistently \"Genomic Data Commons\" in the sample values.\n- `reference_resource_shortname`: A shortened name for the resource, also consistently \"GDC\".\n\nWith 53 unique values and a uniqueness percentage of 100.0, this column likely serves to link records in the database to specific external resources or datasets, facilitating access to additional information related to genomic data.",
        "field_sample_values": [
          "[{'external_reference_id': '1ecaf581-7f41-444f-8918-f63d568319a2', 'reference_entity_location': 'https://portal.gdc.cancer.gov/cases/1ecaf581-7f41-444f-8918-f63d568319a2', 'reference_resource_name': 'Genomic Data Commons', 'reference_resource_shortname': 'GDC'}]",
          "[{'external_reference_id': '247a73c6-318c-4a1b-bdd9-70e224340cb9', 'reference_entity_location': 'https://portal.gdc.cancer.gov/cases/247a73c6-318c-4a1b-bdd9-70e224340cb9', 'reference_resource_name': 'Genomic Data Commons', 'reference_resource_shortname': 'GDC'}]",
          "[{'external_reference_id': '29b8969f-09ec-493d-a8b7-6109e453cf23', 'reference_entity_location': 'https://portal.gdc.cancer.gov/cases/29b8969f-09ec-493d-a8b7-6109e453cf23', 'reference_resource_name': 'Genomic Data Commons', 'reference_resource_shortname': 'GDC'}]",
          "[{'external_reference_id': '2e3b5fb5-a0d0-4427-a871-3cf6a2f32e04', 'reference_entity_location': 'https://portal.gdc.cancer.gov/cases/2e3b5fb5-a0d0-4427-a871-3cf6a2f32e04', 'reference_resource_name': 'Genomic Data Commons', 'reference_resource_shortname': 'GDC'}]",
          "[{'external_reference_id': '43aed9d1-189d-4570-8ff8-9cce86e2e125', 'reference_entity_location': 'https://portal.gdc.cancer.gov/cases/43aed9d1-189d-4570-8ff8-9cce86e2e125', 'reference_resource_name': 'Genomic Data Commons', 'reference_resource_shortname': 'GDC'}]"
        ],
        "field_unique_values": "53 unique values",
        "field_uniqueness_percent": 100.0
      },
      "figo_stage": {
        "field_data_type": "object",
        "field_description": "The column \"figo_stage\" in the table \"PDC000116\" is designed to capture the FIGO (International Federation of Gynecology and Obstetrics) staging of a condition, likely related to gynecological cancers. Currently, the only sample value present is \"Not Reported,\" indicating that no staging information has been provided for the records in this column. With a uniqueness percentage of 1.89, it suggests that this field has very limited variation, and most entries are likely missing or unreported. This column may be intended for future data entry or updates regarding the FIGO stage of patients.",
        "field_sample_values": [
          "Not Reported"
        ],
        "field_unique_values": [
          "Not Reported"
        ],
        "field_uniqueness_percent": 1.89
      },
      "gender": {
        "field_data_type": "object",
        "field_description": "The \"gender\" column in the PDC000116 table is an object data type that likely represents the gender of individuals recorded in the database. The sample values indicate that the column contains two unique entries: 'male' and 'female'. With a uniqueness percentage of 3.77, this suggests that a small portion of the records have distinct gender values, implying that the majority of entries may be either 'male' or 'female'. This field is essential for demographic analysis and understanding the gender distribution within the dataset.",
        "field_sample_values": [
          "male",
          "female"
        ],
        "field_unique_values": [
          "male",
          "female"
        ],
        "field_uniqueness_percent": 3.77
      },
      "last_known_disease_status": {
        "field_data_type": "object",
        "field_description": "The column \"last_known_disease_status\" in the table \"PDC000116\" is designed to capture the most recent information regarding a subject's disease status. The data type is classified as an object, indicating that it may contain textual information. Based on the sample and unique values, which include only the entry \"not reported,\" it appears that this field primarily reflects instances where the disease status has not been documented or disclosed. The uniqueness percentage of 1.89 suggests that this value is prevalent across the dataset, indicating a lack of reported disease status for the majority of entries. Overall, this field likely serves to indicate the absence of disease status information for the subjects in the dataset.",
        "field_sample_values": [
          "not reported"
        ],
        "field_unique_values": [
          "not reported"
        ],
        "field_uniqueness_percent": 1.89
      },
      "morphology": {
        "field_data_type": "object",
        "field_description": "The \"morphology\" column in the PDC000116 table appears to contain data related to specific morphological characteristics, likely in a medical or biological context. The sample value provided, '8140-03-01 00:00:00', suggests that the entries may represent a coded classification system, possibly indicating a specific type of tissue or cellular morphology, along with a timestamp. The uniqueness percent of 1.89 indicates that there is a low variety of distinct entries in this column, suggesting that it may be used to categorize a limited set of morphological types across the dataset.",
        "field_sample_values": [
          "8140-03-01 00:00:00"
        ],
        "field_unique_values": [
          "8140-03-01 00:00:00"
        ],
        "field_uniqueness_percent": 1.89
      },
      "pool": {
        "field_data_type": "object",
        "field_description": "The \"pool\" column in the PDC000116 table is an object data type that appears to represent a categorical attribute. Based on the sample and unique values, which both consist solely of the entry 'No', it is likely that this field indicates the absence of a certain condition or characteristic related to a pool. Given the low uniqueness percentage of 1.89, it suggests that nearly all entries in this column are the same, reinforcing the idea that this field may be used to denote whether a pool is present or not, with 'No' indicating that there is no pool associated with the records in this table.",
        "field_sample_values": [
          "No"
        ],
        "field_unique_values": [
          "No"
        ],
        "field_uniqueness_percent": 1.89
      },
      "preservation_method": {
        "field_data_type": "object",
        "field_description": "The \"preservation_method\" column in the PDC000116 table indicates the method used to preserve the associated data or samples. Currently, the only recorded value is \"Frozen,\" suggesting that all entries in this column are preserved through freezing. With a uniqueness percent of 1.89, this field shows very low variability, indicating that the preservation method is consistently the same across the dataset.",
        "field_sample_values": [
          "Frozen"
        ],
        "field_unique_values": [
          "Frozen"
        ],
        "field_uniqueness_percent": 1.89
      },
      "primary_diagnosis": {
        "field_data_type": "object",
        "field_description": "The column \"primary_diagnosis\" in the table \"PDC000116\" is designed to store the main diagnosis for patients, represented as a text string. The data type is classified as an object, indicating that it contains alphanumeric characters. A sample value from this column is \"Adenocarcinoma, NOS,\" which refers to a specific type of cancer. The presence of only one unique value suggests that this column may be used in a limited context or dataset, with a uniqueness percentage of 1.89%, indicating that nearly all entries in this column are the same. This field is likely intended for clinical or research purposes, capturing the primary medical condition diagnosed in patients.",
        "field_sample_values": [
          "Adenocarcinoma, NOS"
        ],
        "field_unique_values": [
          "Adenocarcinoma, NOS"
        ],
        "field_uniqueness_percent": 1.89
      },
      "primary_site": {
        "field_data_type": "object",
        "field_description": "The \"primary_site\" column in the \"PDC000116\" table likely represents the main anatomical location where a particular condition or disease, such as cancer, originates. In this case, the sample value \"Colon\" indicates that the primary site of interest is the colon. With a data type of object and a uniqueness percent of 1.89, it suggests that this column contains categorical data, with a limited number of unique entries, indicating that most records in this dataset may pertain to the colon as the primary site.",
        "field_sample_values": [
          "Colon"
        ],
        "field_unique_values": [
          "Colon"
        ],
        "field_uniqueness_percent": 1.89
      },
      "prior_malignancy": {
        "field_data_type": "object",
        "field_description": "The column \"prior_malignancy\" in the table \"PDC000116\" is designed to indicate whether an individual has a history of malignancy (cancer). The data type is an object, which suggests that the values are stored as strings. The sample values include variations of \"no\" and \"yes,\" indicating the presence or absence of prior malignancy. Specifically, the unique values are 'no, No' for individuals without a history of malignancy and 'yes, Yes' for those with such a history. The uniqueness percent of 3.77 indicates that a small proportion of the records contain these values, suggesting that most individuals in the dataset do not have a prior malignancy.",
        "field_sample_values": [
          "no, No",
          "yes, Yes"
        ],
        "field_unique_values": [
          "no, No",
          "yes, Yes"
        ],
        "field_uniqueness_percent": 3.77
      },
      "progression_or_recurrence": {
        "field_data_type": "object",
        "field_description": "The column \"progression_or_recurrence\" in the table \"PDC000116\" is designed to capture information regarding the status of a condition, likely in a medical or clinical context. Given that the data type is an object and the sample and unique values consist solely of \"not reported,\" it suggests that this field may be used to indicate whether there has been any progression or recurrence of a disease or condition. The low uniqueness percentage of 1.89 indicates that the majority of entries in this column are the same, implying that the progression or recurrence status has not been documented for most records. Overall, this field likely serves to track the progression or recurrence of a condition, but currently lacks diverse data entries.",
        "field_sample_values": [
          "not reported"
        ],
        "field_unique_values": [
          "not reported"
        ],
        "field_uniqueness_percent": 1.89
      },
      "project_name": {
        "field_data_type": "object",
        "field_description": "The column \"project_name\" in the table \"PDC000116\" is designed to store the names of various projects associated with the data in this table. The data type is an object, indicating that the values are likely strings. In the provided sample, the project name is \"CPTAC2 Confirmatory,\" which suggests that this field may be used to identify specific research or operational projects within a larger database context. With only one unique value observed, it appears that this column may currently be limited to a single project, resulting in a uniqueness percentage of 1.89%. This indicates that the column may be in the early stages of data collection or that it is focused on a specific project at this time.",
        "field_sample_values": [
          "CPTAC2 Confirmatory"
        ],
        "field_unique_values": [
          "CPTAC2 Confirmatory"
        ],
        "field_uniqueness_percent": 1.89
      },
      "race": {
        "field_data_type": "object",
        "field_description": "The \"race\" column in the PDC000116 table likely represents the racial or ethnic classification of individuals in the dataset. The values include categories such as 'not reported', 'asian', 'white', and 'black or african american', indicating the various racial identities that may be recorded. The presence of the 'not reported' option suggests that some individuals may choose not to disclose their race. With a uniqueness percentage of 7.55, this column contains a limited number of distinct values relative to the total number of entries, indicating that many individuals share the same racial classification.",
        "field_sample_values": [
          "not reported",
          "asian",
          "white",
          "black or african american"
        ],
        "field_unique_values": [
          "not reported",
          "asian",
          "white",
          "black or african american"
        ],
        "field_uniqueness_percent": 7.55
      },
      "sample_status": {
        "field_data_type": "object",
        "field_description": "The column \"sample_status\" in the table \"PDC000116\" is of data type object and contains information about the status of samples. Based on the sample values provided, which include only the value \"Qualified,\" it is likely that this field indicates whether a sample meets certain criteria or standards for qualification. With a uniqueness percent of 1.89, it suggests that nearly all entries in this column share the same status, reinforcing the idea that the samples in this dataset are predominantly classified as \"Qualified.\"",
        "field_sample_values": [
          "Qualified"
        ],
        "field_unique_values": [
          "Qualified"
        ],
        "field_uniqueness_percent": 1.89
      },
      "sample_type": {
        "field_data_type": "object",
        "field_description": "The column \"sample_type\" in the table \"PDC000116\" is designed to categorize the type of biological sample being recorded. Currently, it contains a single unique value, \"Primary Tumor,\" indicating that the samples in this dataset are specifically from primary tumor tissues. The data type is classified as an object, which typically means it can hold various types of data, but in this case, it is consistently representing a specific category of samples. The uniqueness percent of 1.89 suggests that there is very little variation in the data for this column, reinforcing that the dataset primarily focuses on primary tumor samples.",
        "field_sample_values": [
          "Primary Tumor"
        ],
        "field_unique_values": [
          "Primary Tumor"
        ],
        "field_uniqueness_percent": 1.89
      },
      "samples.state": {
        "field_data_type": "object",
        "field_description": "The column \"samples.state\" in the table \"PDC000116\" is of data type object and contains information about the state of samples. Based on the sample values provided, which include only the value 'released', it is likely that this field indicates the current status of the samples, specifically denoting that they have been released for use or distribution. With a uniqueness percent of 1.89, this suggests that the majority of entries in this column share the same value, reinforcing the idea that the samples are predominantly in a 'released' state.",
        "field_sample_values": [
          "released"
        ],
        "field_unique_values": [
          "released"
        ],
        "field_uniqueness_percent": 1.89
      },
      "site_of_resection_or_biopsy": {
        "field_data_type": "object",
        "field_description": "The column \"site_of_resection_or_biopsy\" in the table \"PDC000116\" is designed to capture information about the specific location where a surgical resection or biopsy was performed. Given that the data type is an object and the sample values consist solely of \"not reported,\" it suggests that this field may often lack detailed information regarding the actual site of the procedure. The uniqueness percent of 1.89 indicates that nearly all entries in this column are the same, further emphasizing that the site of resection or biopsy is frequently not documented in the dataset. Overall, this field likely serves to indicate the anatomical location of a procedure when such information is available, but in this case, it predominantly reflects instances where that information has not been provided.",
        "field_sample_values": [
          "not reported"
        ],
        "field_unique_values": [
          "not reported"
        ],
        "field_uniqueness_percent": 1.89
      },
      "specimen_type": {
        "field_data_type": "object",
        "field_description": "The \"specimen_type\" column in the \"PDC000116\" table is designed to categorize the type of biological specimen being recorded. Currently, it contains a single unique value, \"Solid Tissue,\" indicating that all entries in this column refer to specimens derived from solid tissue samples. The data type is classified as an object, suggesting that it may contain textual descriptions or categorical data. With a uniqueness percentage of 1.89, this field shows limited variability, implying that the dataset predominantly consists of solid tissue specimens.",
        "field_sample_values": [
          "Solid Tissue"
        ],
        "field_unique_values": [
          "Solid Tissue"
        ],
        "field_uniqueness_percent": 1.89
      },
      "state": {
        "field_data_type": "object",
        "field_description": "The \"state\" column in the \"PDC000116\" table is an object data type that appears to represent the current status of a record. Based on the sample and unique values, which both indicate \"released,\" it is likely that this field is used to denote whether a particular item or record has been officially released or made available. The uniqueness percentage of 1.89 suggests that this column has very low variability, indicating that almost all entries in this column share the same value of \"released.\" This implies that the majority of records in this table are in the same state, possibly indicating a completed process or a finalized status.",
        "field_sample_values": [
          "released"
        ],
        "field_unique_values": [
          "released"
        ],
        "field_uniqueness_percent": 1.89
      },
      "status": {
        "field_data_type": "object",
        "field_description": "The \"status\" column in the \"PDC000116\" table is an object data type that currently contains a single unique value: \"Qualified.\" This suggests that the field is used to indicate the qualification status of a record within the table. Given that there is only one unique value present, it is likely that this column is intended to categorize records as \"Qualified,\" possibly reflecting a specific condition or criterion that has been met. The uniqueness percentage of 1.89 indicates that the majority of records in this table share the same status, reinforcing the idea that this field serves a specific and consistent purpose in the dataset.",
        "field_sample_values": [
          "Qualified"
        ],
        "field_unique_values": [
          "Qualified"
        ],
        "field_uniqueness_percent": 1.89
      },
      "taxon": {
        "field_data_type": "object",
        "field_description": "The \"taxon\" column in the PDC000116 table likely represents the scientific classification of an organism, specifically indicating the taxonomic group to which it belongs. In this case, the sample value \"Homo sapiens\" refers to humans, suggesting that this column is used to identify the species of biological samples or data entries in the database. With only one unique value observed, it appears that the current dataset predominantly focuses on this specific taxon, resulting in a uniqueness percentage of 1.89%.",
        "field_sample_values": [
          "Homo sapiens"
        ],
        "field_unique_values": [
          "Homo sapiens"
        ],
        "field_uniqueness_percent": 1.89
      },
      "tissue_or_organ_of_origin": {
        "field_data_type": "object",
        "field_description": "The column \"tissue_or_organ_of_origin\" in the table PDC000116 likely represents the specific tissue or organ from which a biological sample is derived. In this case, the sample value \"Colon, NOS\" indicates that the origin is the colon, with \"NOS\" standing for \"not otherwise specified.\" This suggests that the data may be used to categorize samples based on their anatomical source, which is important for research and analysis in fields such as oncology or pathology. The uniqueness percent of 1.89 indicates that there is a low variety of distinct values in this column, suggesting that most samples may originate from a limited number of tissues or organs.",
        "field_sample_values": [
          "Colon, NOS"
        ],
        "field_unique_values": [
          "Colon, NOS"
        ],
        "field_uniqueness_percent": 1.89
      },
      "tissue_type": {
        "field_data_type": "object",
        "field_description": "The \"tissue_type\" column in the \"PDC000116\" table is designed to categorize the type of tissue represented in the dataset. Given that the data type is an object and the sample and unique values both indicate \"Tumor,\" it is likely that this field specifically identifies tumor tissue samples. The uniqueness percent of 1.89 suggests that this column has very low variability, indicating that nearly all entries in this column are classified as \"Tumor.\" This implies that the dataset primarily focuses on tumor-related data, possibly for research or analysis in oncology.",
        "field_sample_values": [
          "Tumor"
        ],
        "field_unique_values": [
          "Tumor"
        ],
        "field_uniqueness_percent": 1.89
      },
      "tumor_descriptor": {
        "field_data_type": "object",
        "field_description": "The \"tumor_descriptor\" column in the PDC000116 table is designed to categorize the type of tumor associated with the data entries. Given that the data type is an object and the sample and unique values both indicate \"Primary,\" it suggests that this field specifically identifies tumors that are classified as primary tumors. Primary tumors are those that originate in the tissue where they are found, as opposed to metastatic tumors, which spread from other parts of the body. The uniqueness percentage of 1.89 indicates that this column has limited variability, with \"Primary\" being the predominant descriptor used in the dataset.",
        "field_sample_values": [
          "Primary"
        ],
        "field_unique_values": [
          "Primary"
        ],
        "field_uniqueness_percent": 1.89
      },
      "tumor_grade": {
        "field_data_type": "object",
        "field_description": "The \"tumor_grade\" column in the PDC000116 table is designed to capture the grading of tumors, which typically indicates the aggressiveness or severity of the cancer. However, based on the provided information, it appears that the only recorded value in this column is \"Not Reported.\" This suggests that there may be a lack of available data regarding tumor grades for the entries in this table, resulting in a very low uniqueness percentage of 1.89%. Consequently, this column may not provide meaningful insights into tumor grading for the current dataset.",
        "field_sample_values": [
          "Not Reported"
        ],
        "field_unique_values": [
          "Not Reported"
        ],
        "field_uniqueness_percent": 1.89
      },
      "tumor_stage": {
        "field_data_type": "object",
        "field_description": "The \"tumor_stage\" column in the PDC000116 table likely represents the classification of cancer stages for patients in the database. This classification is crucial for understanding the extent of cancer progression and is typically denoted using a combination of Roman numerals and letters. The sample values, such as 'Stage IIIB' and 'Stage IIA', indicate specific stages of cancer, where the Roman numeral signifies the stage and the accompanying letters may provide additional information about the tumor's characteristics or spread. The presence of unique values such as 'Stage IIIC' and 'Stage IV' suggests a comprehensive categorization of tumor stages, which can be essential for treatment planning and prognosis. The uniqueness percentage of 15.09 indicates that there is a moderate level of repetition among the entries in this column.",
        "field_sample_values": [
          "Stage IIIB",
          "Stage IIA",
          "Stage1",
          "Stage IVA",
          "Stage IIB"
        ],
        "field_unique_values": [
          "Stage IIIB",
          "Stage IIA",
          "Stage1",
          "Stage IVA",
          "Stage IIB",
          "Stage IIIC",
          "Stage IV",
          "Stage II"
        ],
        "field_uniqueness_percent": 15.09
      },
      "created_datetime": {
        "field_data_type": "object",
        "field_description": "The `created_datetime` column in the `PDC000116` table likely represents the date and time when a record was created. The data type is an object, which suggests that the values may be stored as strings rather than a specific date-time format. The sample value provided, '2017-01-25T15:29:16.160843-06:00', indicates that the timestamps are formatted in ISO 8601, including the date, time, and time zone offset from UTC. With a uniqueness percentage of 1.89, it appears that this column contains a limited number of distinct values, suggesting that many records may share the same creation timestamp.",
        "field_sample_values": [
          "2017-01-25T15:29:16.160843-06:00"
        ],
        "field_unique_values": [
          "2017-01-25T15:29:16.160843-06:00"
        ],
        "field_uniqueness_percent": 1.89
      },
      "demographic.created_datetime": {
        "field_data_type": "object",
        "field_description": "The column `demographic.created_datetime` in the table `PDC000116` likely represents the date and time when a demographic record was created. The data type is an object, which suggests that the values are stored as strings. The sample value provided, '2017-01-25T15:47:58.938244-06:00', follows the ISO 8601 format, indicating that it includes both the date and time, along with a timezone offset of -06:00 hours from UTC. With a uniqueness percent of 1.89, this field contains a very low number of unique values, suggesting that many records may share the same creation timestamp.",
        "field_sample_values": [
          "2017-01-25T15:47:58.938244-06:00"
        ],
        "field_unique_values": [
          "2017-01-25T15:47:58.938244-06:00"
        ],
        "field_uniqueness_percent": 1.89
      },
      "demographic.updated_datetime": {
        "field_data_type": "object",
        "field_description": "The column `demographic.updated_datetime` in the table `PDC000116` likely represents the timestamp indicating when a demographic record was last updated. The data type is an object, which suggests that the values are stored as strings rather than a specific date-time format. The sample value provided, '2019-10-24T07:59:21.887408-05:00', follows the ISO 8601 format, including the date, time, and time zone offset. With a uniqueness percent of 1.89, it indicates that this field contains a limited number of distinct values, suggesting that many records may share the same update timestamp.",
        "field_sample_values": [
          "2019-10-24T07:59:21.887408-05:00"
        ],
        "field_unique_values": [
          "2019-10-24T07:59:21.887408-05:00"
        ],
        "field_uniqueness_percent": 1.89
      },
      "diagnoses.created_datetime": {
        "field_data_type": "object",
        "field_description": "The column `diagnoses.created_datetime` in the table `PDC000116` likely represents the timestamp indicating when a diagnosis record was created. The data type is an object, which suggests that the values may be stored as strings. The sample value provided, '2017-03-01T11:57:00.297885-06:00', follows the ISO 8601 format, indicating a specific date and time, including the time zone offset. With a uniqueness percentage of 1.89, it appears that there are very few distinct timestamps in this column, suggesting that multiple diagnosis records may share the same creation time.",
        "field_sample_values": [
          "2017-03-01T11:57:00.297885-06:00"
        ],
        "field_unique_values": [
          "2017-03-01T11:57:00.297885-06:00"
        ],
        "field_uniqueness_percent": 1.89
      },
      "diagnoses.updated_datetime": {
        "field_data_type": "object",
        "field_description": "The column `diagnoses.updated_datetime` in the table `PDC000116` likely represents the timestamp indicating when a diagnosis record was last updated. The data type is an object, which suggests that the values are stored as strings. A sample value, such as '2019-10-24T07:59:21.887408-05:00', follows the ISO 8601 format, including the date, time, and timezone offset. The uniqueness percent of 1.89 indicates that there is a low level of uniqueness among the values in this column, suggesting that many records may share the same update timestamp.",
        "field_sample_values": [
          "2019-10-24T07:59:21.887408-05:00"
        ],
        "field_unique_values": [
          "2019-10-24T07:59:21.887408-05:00"
        ],
        "field_uniqueness_percent": 1.89
      },
      "samples.created_datetime": {
        "field_data_type": "object",
        "field_description": "The column `samples.created_datetime` in the table `PDC000116` likely represents the date and time when a sample was created. The data type is an object, which suggests that the values are stored as strings rather than a specific date-time format. The sample value provided, '2017-01-25T15:31:52.788719-06:00', follows the ISO 8601 format, indicating that it includes both the date and time, along with a time zone offset of -06:00 hours from UTC. With a uniqueness percentage of 1.89, this column contains a very limited number of unique entries, suggesting that many samples may share the same creation date and time.",
        "field_sample_values": [
          "2017-01-25T15:31:52.788719-06:00"
        ],
        "field_unique_values": [
          "2017-01-25T15:31:52.788719-06:00"
        ],
        "field_uniqueness_percent": 1.89
      },
      "samples.updated_datetime": {
        "field_data_type": "object",
        "field_description": "The column `samples.updated_datetime` in the table `PDC000116` likely represents the date and time when a sample was last updated. The data type is an object, which suggests that the values are stored as strings rather than a specific date-time format. The sample value provided, '2023-10-23T16:49:33.686339-05:00', follows the ISO 8601 format, indicating that it includes both the date and time, along with a time zone offset of -05:00 hours from UTC. With only one unique value observed in the dataset, this column may indicate that all records share the same update timestamp, resulting in a low uniqueness percentage of 1.89%. This could imply that the samples were updated simultaneously or that the data has not been frequently modified.",
        "field_sample_values": [
          "2023-10-23T16:49:33.686339-05:00"
        ],
        "field_unique_values": [
          "2023-10-23T16:49:33.686339-05:00"
        ],
        "field_uniqueness_percent": 1.89
      },
      "updated_datetime": {
        "field_data_type": "object",
        "field_description": "The `updated_datetime` column in the `PDC000116` table likely represents the date and time when a record was last updated. The data type is an object, indicating that the values are stored as strings rather than a specific date-time format. The sample value provided, '2019-10-24T07:59:21.887408-05:00', follows the ISO 8601 format, which includes the date, time, and time zone offset. With a uniqueness percent of 1.89, it suggests that this column contains mostly duplicate values, indicating that many records may have been updated at the same time or that the same timestamp is reused across multiple entries.",
        "field_sample_values": [
          "2019-10-24T07:59:21.887408-05:00"
        ],
        "field_unique_values": [
          "2019-10-24T07:59:21.887408-05:00"
        ],
        "field_uniqueness_percent": 1.89
      },
      "sample_submitter_id_merged": {
        "field_data_type": "object",
        "field_description": "The column \"sample_submitter_id_merged\" in the table \"PDC000116\" likely represents unique identifiers for samples submitted to a database, possibly related to a research study or biobank. Each identifier is formatted as a UUID (Universally Unique Identifier), which ensures that each sample can be distinctly recognized. With 53 unique values and a uniqueness percentage of 100.0, it indicates that each entry in this column is unique, suggesting that it is used to track individual samples without duplication. This field is essential for maintaining the integrity of sample data and facilitating accurate data retrieval and analysis.",
        "field_sample_values": [
          "87408d9e-4029-4e8f-b14c-8efc04",
          "8c73f3a5-fea8-4942-90c0-966f66",
          "591fb460-703a-437d-8d9a-ff2a35",
          "66b829db-1cdd-460d-b2f3-0e9ca9",
          "c2c53076-b5db-4b7d-983c-a35740"
        ],
        "field_unique_values": "53 unique values",
        "field_uniqueness_percent": 100.0
      },
      "study_id": {
        "field_data_type": "object",
        "field_description": "The column \"study_id\" in the table \"PDC000116\" likely represents a unique identifier for a specific study or dataset within the database. Given that the data type is an object and the sample and unique values both show 'PDC000116', it suggests that this identifier is consistent across the entries in this column. The uniqueness percentage of 1.89 indicates that this identifier is not unique across the entire dataset, implying that it may be used to group or categorize multiple records related to the same study. Overall, \"study_id\" serves as a key reference point for identifying and organizing data associated with a particular research study.",
        "field_sample_values": [
          "PDC000116"
        ],
        "field_unique_values": [
          "PDC000116"
        ],
        "field_uniqueness_percent": 1.89
      }
    }
  }
}